{
  "title": "Antipope Philip",
  "text": "Antipope Philip (Latin: Philippus; fl. 8th century) was an antipope who held office for just one day, on 31 July 768.\nIn 768, Philip was a priest serving in the monastery of Saint Vitus on the Esquiline. Rome was in turmoil following the death of Pope Paul I, as rival factions sought to elect a pope to succeed him. The Primicerius, Christophorus, and his son Sergius, the papal treasurer, had sought Lombard help to depose Pope Constantine II, who was the candidate of the military faction in Rome.\nThe Lombard king, Desiderius, agreed to provide troops, and sent a Lombard priest, Waldipert, to act as his representative, with authority to deal with Christophorus and Sergius. Waldipert accompanied Sergius in an attack on Rome that ended Constantine's papacy. When Constantine had been taken captive, Waldipert, without alerting Sergius, and most likely following instructions from Desiderius, collected a number of Romans and entered the monastery of Saint Vitus on the Esquiline on Sunday, 31 July. There they approached Philip, declared that Saint Peter had chosen him as pope, and escorted him to the Lateran Basilica.\nHere, after having the customary prayers read over him by a bishop found for the occasion, Philip held the traditional feast in the Lateran palace, attended by a number of dignitaries from both Church and State. Christophorus had by now returned to Rome and was approaching the city gates. Learning of Philip's uncanonical election, he stated to the Romans who had gone out to greet him, that he would not enter Rome until Philip was removed. Philip's election was declared invalid, he was declared guilty of simony, the pontifical garments were removed from him, and he was forced to return to his monastery. Christophorus entered Rome and oversaw the election of Stephen III.\nAfter his deposition and return to the monastery, Philip was never seen nor heard from again, and died in obscurity.\n\n\n== Notes ==\n\n\n== References ==\nMann, Horace K., The Lives of the Popes in the Early Middle Ages, Vol. I: The Popes Under the Lombard Rule, Part 2, 657–795 (1903)",
  "source_url": "https://en.wikipedia.org/wiki/Antipope_Philip",
  "fetched_at": "2025-12-06T07:25:50.896609",
  "page_id": "842628"
}