{
  "title": "Candidate",
  "text": "A candidate, or nominee, is a prospective recipient of an award or honor, or a person seeking or being considered for some kind of position. For example, one can be a candidate for membership in a group or election to an office, in which case a candidate selection occurs.\n\"Nomination\" is part of the process of selecting a candidate for either election to an office by a political party, or the bestowing of an honor or award. This person is called a \"nominee\", though \"nominee\" is often used interchangeably with \"candidate\". A presumptive nominee is a person or organization whose nomination is considered inevitable or highly likely. The phenomenon of being a candidate in a race for either a party nomination or for electoral office is called \"candidacy\". The term \"presumptive candidate\" may be used to describe someone who is predicted to be a formal candidate.\n\n\n== Etymology ==\nCandidate is a derivative of the Latin candidus (‘shining white’). In ancient Rome, men seeking political office would usually wear the toga candida, a toga chalked and bleached to be bright white at speeches, debates, conventions, and other public functions.\n\n\n== Candidates in elections ==\n\nIn the context of elections for public office in a representative democracy, a candidate who has been nominated by a political party, or a qualified group of citizens, is normally said to be the nominee of that party, or civic group. The party's selection (that is, the nomination) is typically accomplished either based on one or more primary elections according to the rules of the party and any applicable electoral laws, while non-party candidates, who are also known as independent candidates or civic candidates, are usually nominated by a qualified number of citizens, in accordance with legal provisions. Electoral candidacy can be individual (a single candidate for a single-seat electoral unit), or collective (electoral list of candidates for a multi-seat electoral unit).\nCandidates are called \"incumbents\" if they are already serving in the office for which they are seeking re-election, or \"challengers\", if they are seeking to replace an incumbent.\nIn the context of elections for public office in a direct democracy, a candidate can be nominated by any eligible person—and if parliamentary procedures are used, the nomination has to be seconded, i.e., receive agreement from a second person.\n\n\n=== Spitzenkandidat ===\n\nIn German politics, the person at the head of an electoral list is called the Spitzenkandidat (\"lead candidate\"). By convention, this means that this person (normally the party leader) will be elected to lead the government if their party wins the election. Various other countries with a parliamentary democracy have the same system.\nIn 2014, the major groups represented in the European Parliament and the European Council agreed to apply this process to determine the next President of the European Commission, as a way of the Council \"taking account of the results of the European Parliament election\" as required by the Union treaties. This led to the appointment and confirmation of Jean-Claude Juncker.\nIn German federal elections, parties nominate a \"Chancellor candidate\".\n\n\n== In the Roman Catholic Church ==\nIndividuals who wish to be received into the membership of the Catholic Church who have been baptized in another mainstream Christian denomination are known as candidates; their reception into the Catholic Church is done through a profession of faith, followed by the reception of Holy Communion and Confirmation. In contrast, those persons who have never received the sacrament of baptism are, as a matter of Catholic canon law, considered non-Christians and if they are preparing to become a member of the Catholic Church (through the church process called the Christian Initiation of Adults, they are known as catechumens.\n\n\n== See also ==\n\nNon-human electoral candidate\nPaper candidate\nParachute candidate\nPerennial candidate\nStar candidate\nWrite-in candidate\n\n\n== References ==",
  "source_url": "https://en.wikipedia.org/wiki/candidate",
  "fetched_at": "2025-12-06T07:26:03.404541",
  "page_id": "615670"
}