{
  "title": "Christmastide",
  "text": "Christmastide, also known as Christmas time, Christmas season, or Christide, is a season of the liturgical year in most Christian churches. \nFor the Catholic Church, Lutheran Church, Anglican Church, Methodist Church and some Orthodox Churches, Christmastide begins on 24 December at sunset or Vespers, which is liturgicus the beginning of Christmas Day. Most of 24 December is thus not part of Christmastide, but of Advent, the season in the Church Year that precedes Christmastide. In many liturgical calendars Christmastide is followed by the closely related season of Epiphanytide that commences at sunset on 5 January—a date known as Twelfth Night. \nIn many Christian denominations, Christmastide is identical to Twelvetide (Twelve Days of Christmastide). There are several celebrations within Christmastide, including Christmas Day (25 December), Saint Stephen's Day (26 December), Childermas (28 December), New Year's Eve (31 December), the Feast of the Circumcision of Christ or the Solemnity of Mary, Mother of God (1 January), and the Feast of the Holy Family (date varies). The Twelve Days of Christmas terminate with Epiphany Eve or Twelfth Night (the evening of 5 January).\nCustoms of the Christmas season include carol singing, gift giving, attending Nativity plays, church services, and eating special food, such as Christmas cake. Traditional examples of Christmas greetings include the Western Christian phrase \"Merry Christmas and a Happy New Year!\" and the Eastern Christian greeting \"Christ is born!\", to which others respond, \"Glorify Him!\"\n\n\n== Dates ==\n\nChristmastide, commonly called the Twelve Days of Christmas, lasts 12 days, from 25 December to 5 January, the latter date being named as Twelfth Night. These traditional dates are adhered to by the Lutheran Church and the Anglican Church.\nHowever, the ending is defined differently by other Christian denominations. In 1969, the Roman Rite of the Catholic Church expanded Christmastide by a variable number of days: \"Christmas Time runs from... up to and including the Sunday after Epiphany or after 6 January.\" Before 1955, the 12 Christmastide days in the Roman Rite (25 December to 5 January) were followed by the 8 days of the Octave of Epiphany, 6–13 January, and its 1960 Code of Rubrics defined \"Christmastide\" as running \"from I vespers of Christmas to none of 5th January inclusive\". The Saint Andrew Daily Missal (1945) says Christmastide begins with \"the vigil of the feast [Christmas Day] and ends in the temporal cycle on the octave day of the Epiphany...[and] in the sanctoral cycle on the Purification of our Lady (Feb. 2).\" Within the Christmas Cycle is \"the time before, during and after the feast itself, thus having for its aim to prepare the soul for them, then allow it to celebrate them with solemnity and finally to prolong them several weeks\"; this references Advent, Christmas, and the Time after Epiphany (Epiphanytide).\n\n\n== History ==\n\nIn 567, the Council of Tours \"proclaimed the twelve days from Christmas to Epiphany as a sacred and festive season, and established the duty of Advent fasting in preparation for the feast.\" Christopher Hill, as well as William J. Federer, states that this was done in order to solve the \"administrative problem for the Roman Empire as it tried to coordinate the solar Julian calendar with the lunar calendars of its provinces in the east.\" Ronald Hutton adds that, while the Council of Tours declared the 12 days one festal cycle, it confirmed that three of those days were fasting days, dividing the rejoicing days into two blocs. \nIn medieval era Christendom, Christmastide \"lasted from the Nativity to the Purification.\" To this day, the \"Christian cultures in Western Europe and Latin America extend the season to forty days, ending on the Feast of the Presentation of Jesus in the Temple and the Purification of Mary on 2 February, a feast also known as Candlemas because of the blessing of candles on this day, inspired by the Song of Simeon, which proclaims Jesus as 'a light for revelation to the nations'.\" Many Churches refer to the period after the traditional Twelve Days of Christmas and up to Candlemas, as Epiphanytide, also called the Epiphany season. The Puritans referred to the season as Christide as they did not affirm the sacrificial aspect of the Mass.\n\n\n== Traditions ==\n\nDuring the Christmas season, various festivities are traditionally enjoyed and buildings are adorned with Christmas decorations, which are often set up during Advent. These Christmas decorations include the Nativity Scene, Christmas tree, Moravian star, Illuminations and various Christmas ornaments. In the Western Christian world, the two traditional days on which Christmas decorations are removed are Twelfth Night, Baptism of Jesus and Candlemas. Any not removed on the first occasion should be left undisturbed until the second. Leaving the decorations up beyond Candlemas is considered to be inauspicious. The Saint Andrew Daily Missal (1945), authored by Dom Gaspar Lefebvre, stipulates:\n\nEvery Christian home should have its own little crib round which, on these days, morning and evening prayers should be said. At this season, consecrated to childlike joys, children will understand that they must join with the shepherds and the wise men together with Mary and Joseph in worshipping the Child Jesus, the Babe who lying on His bed of straw is God and beseech Him that through His grace they may become ever increasingly children of God together with Him. The greetings of \"Happy Christmas\" which remind us of the artless mirth of the shepherds on that holy night; the Christmas tree, often with a source of joy to the poor, representatives of Christ in the property of His manger bed; Christmas gifts recalling God's great gift of His Son to us on the first Christmas night; the Twelfth-Night cake; all these are Christian customs which ought to be preserved. —The Saint Andrew Daily Missal\nOn Christmas Eve or Christmas Day (the first day of Christmastide), it is customary for most households in Christendom to attend a service of worship or Mass. During the season of Christmastide, in many Christian households, a gift is given for each of the Twelve Days of Christmastide, while in others, gifts are only given on Christmas Eve, Christmas Day or Twelfth Night, the first and last days of the festive season, respectively. The practice of giving gifts during Christmastide, according to Christian tradition, is symbolic of the presentation of the gifts by the Three Wise Men to the infant Jesus.\n\nThe tradition of the Nativity scene comes from Italy. One of the earliest representation in art of the nativity was found in the early Christian Roman catacomb of Saint Valentine. It dates to about AD 380.  Another, of similar date, is beneath the pulpit in Sant'Ambrogio, Milan. For the Christian celebration of Christmas, the viewing of the Nativity play is one of the oldest Christmastime traditions, with the first reenactment of the Nativity of Jesus taking place in A.D. 1223 in the Italian town of Greccio. In that year, Francis of Assisi assembled a Nativity scene outside of his church in Italy and children sang Christmas carols celebrating the birth of Jesus. Each year, this grew larger, and people travelled from afar to see Francis' depiction of the Nativity of Jesus that came to feature drama and music. Nativity plays eventually spread throughout all of Europe, where they remain popular. Christmas Eve and Christmas Day church services often came to feature Nativity plays, as did schools and theatres. In France, Germany, Mexico, and Spain, Nativity plays are often reenacted outdoors in the streets.\nIn several parts of the world, it is common to have a large family feast on Christmas Day, preceded by saying grace. Desserts such as Christmas cake are unique to Christmastide; in India and Pakistan, a version known as Allahabadi cake is popular. Panettone, an Italian type of sweet bread and fruitcake, originally from Milan, Italy, usually prepared and enjoyed for Christmas and New Year in Western, Southern, and Southeastern Europe, as well as in South America, Eritrea, Australia and North America. During the Christmas season, it is also very common for Christmas carols to be sung at Christian churches, as well as in front of houses—in the latter scenario, groups of Christians go from one house to another to sing Christmas carols. Popular Christmas carols include \"Silent Night\", \"Come, Thou Long Expected Jesus\", \"We Three Kings\", \"Down in Yon Forest\", \"Away in a Manger\", \"I Wonder as I Wander\", \"God Rest Ye Merry, Gentlemen\", \"There's a Song in the Air\", and \"Let all mortal flesh keep silence\". In the Christmas season, it is very common for television stations to air feature films relating to Christmas and Christianity in general, such as The Greatest Story Ever Told and Scrooge.\nOn Saint Stephen's Day, the second day of Christmastide, people traditionally have their horses blessed, and on the Feast of Saint John the Evangelist, the third day of Christmastide, wine is blessed and consumed. The fourth day of Christmastide, Childermas (Children's Mass), is observed through the blessing of children at church, as well as the remembrance of the Holy Innocents as the first Christian martyrs. On New Year's Eve (the seventh day of Christmastide), it is common for many Christians to attend a watchnight service to thank God for being blessed in the previous year and resolving to serve Him in the coming year. Throughout the twelve days of Christmastide, many people view Nativity plays, among other forms of \"musical and theatrical presentations\".\nIn the Russian Orthodox Church, Christmastide is referred to as \"Svyatki\", meaning \"Holy Days\". It is celebrated from the Nativity of Christ (7 January N.S.) to the Theophany or Baptism of Christ (19 January N.S.). Activities during this period include attending church services, singing Christmas carols and spiritual hymns, visiting relatives and friends, and performing works of mercy, such as visiting the sick, the elderly people, orphans, and giving generous alms.\n\n\n== Liturgy ==\n\n\n=== Western Christianity ===\n\n\n==== Readings ====\n\n\n=== Eastern Christianity ===\n\nIn the Eastern Orthodox Church, as well as in the Greek Catholic Churches and Byzantine-Rite Lutheran Churches, Christmas is the fourth most important feast (after Pascha, Pentecost and Theophany). The day after, the Church celebrates the Synaxis of the Theotokos. This means that Saint Stephen's Day and the Feast of the Holy Innocents fall one day later than in the West. The coming of the Wise Men is celebrated on the feast itself.\n\n\n==== Readings ====\n\n\n== By country ==\n\n\n=== Italy ===\n\nChristmas is one of the major holidays of Italy. Christmas festivities in Italy (Italian: Natale, Italian: [naˈtaːle]) begin on 8 December, with the Feast of the Immaculate Conception, the day on which traditionally the Christmas tree is mounted and ends on 6 January, of the following year with the Epiphany (Italian: Epifania, Italian: [epifaˈniːa]), and in some areas female puppets are burned on a pyre (called falò), to symbolize, along with the end of the Christmas period, the death of the old year and the beginning of a new one. \n\n\n== Suppression by antireligious governments ==\n\n\n=== Revolutionary France ===\n\nWith the atheistic Cult of Reason in power during the era of Revolutionary France, Christian Christmas religious services were banned and the three kings cake of the Christmas-Epiphany season was forcibly renamed the \"equality cake\" under anticlerical government policies.\n\n\n=== Soviet Union ===\n\nUnder the state atheism of the Soviet Union, after its foundation in 1917, Christmas celebrations—along with other Christian holidays—were prohibited. Saint Nicholas was replaced by Ded Moroz or Grandfather Frost, the Russian Spirit of Winter who brought gifts on New Year's, accompanied by the snowmaiden Snyegurochka who helps distribute gifts.\nIt was not until the dissolution of the Soviet Union in 1991 that the prohibition ended and Christmas was celebrated for the first time in Russia after seven decades. Russia had adopted the custom of celebrating New Year's Day instead. However, the Orthodox Church Christmas is on 7 January. This is, also, an official national holiday.\n\n\n=== Nazi Germany ===\n\nEuropean History Professor Joseph Perry wrote that in Nazi Germany, \"because Nazi ideologues saw organized religion as an enemy of the totalitarian state, propagandists sought to deemphasize—or eliminate altogether—the Christian aspects of the holiday\" and that \"Propagandists tirelessly promoted numerous Nazified Christmas songs, which replaced Christian themes with the regime's racial ideologies.\"\n\n\n=== People's Republic of China ===\n\nThe government of the People's Republic of China officially espouses state atheism, and has conducted antireligious campaigns to this end. In December 2018, officials raided Christian churches just prior to Christmastide and coerced them to close; Christmas trees and Santa Clauses were also forcibly removed.\n\n\n== See also ==\n\nChristmas and holiday season\nChristmas Eve\nBlue Christmas (holiday)\nAdvent\nEpiphany season\nNativity Fast\nEmbertide\n\n\n== References ==",
  "source_url": "https://en.wikipedia.org/wiki/Christmastide",
  "fetched_at": "2025-12-06T07:23:14.975268",
  "page_id": "572380",
  "metadata": {
    "experiment_id": {
      "value": "23be77742870",
      "origin": "md5(filepath)[:12]",
      "source": "FROM_MATH"
    },
    "created_at": {
      "value": "2025-12-08T00:25:14.069764",
      "origin": "datetime.now().isoformat()",
      "source": "FROM_DATA"
    },
    "source_file": {
      "value": "/root/NEO_EVA/data/knowledge_cache/Christmastide.json",
      "origin": "original_filepath",
      "source": "FROM_DATA"
    },
    "endogenized": {
      "value": true,
      "origin": "endogenize.py conversion",
      "source": "FROM_DATA"
    },
    "framework": {
      "value": "SYNAKSIS_LAB",
      "origin": "validation_framework",
      "source": "FROM_DATA"
    },
    "version": {
      "value": "1.0",
      "origin": "endogenize_version",
      "source": "CONFIG_OPERATIONAL"
    },
    "provenance_method": {
      "value": "automatic_inference",
      "origin": "infer_origin(key, value, path)",
      "source": "FROM_DATA"
    },
    "validation_target": {
      "norma_dura": {
        "value": 94,
        "origin": "NORMA_DURA_THRESHOLD",
        "source": "FROM_STATISTICS"
      },
      "synaksis": {
        "value": 114,
        "origin": "SYNAKSIS_THRESHOLD",
        "source": "FROM_STATISTICS"
      }
    }
  },
  "_documentation": {
    "methodology": {
      "description": "Automatic endogenization via provenance inference",
      "approach": "Each numeric value wrapped with origin and source traceability",
      "validation": "NORMA DURA + SYNAKSIS + NEOSYNT triple validation",
      "source": "FROM_DATA"
    },
    "data_sources": {
      "primary": "Original experimental data",
      "secondary": "Inferred provenance from field names and value types",
      "tertiary": "Statistical analysis of distributions",
      "source": "FROM_DATA"
    },
    "interpretation_guide": {
      "FROM_DATA": "Value extracted directly from experimental measurements",
      "FROM_MATH": "Value computed via mathematical formula",
      "FROM_STATISTICS": "Value derived from statistical analysis",
      "CONFIG_OPERATIONAL": "Operational configuration parameter",
      "source": "FROM_DATA"
    },
    "quality_criteria": {
      "provenance": "All values must have traceable origin",
      "reproducibility": "All computations must be reproducible",
      "transparency": "All methods must be documented",
      "source": "FROM_DATA"
    },
    "validation_framework": {
      "norma_dura": "Provenance string counting >= 94",
      "synaksis": "Total string counting >= 114",
      "neosynt": "HHI concentration >= 0.52",
      "unified": "Must pass all three frameworks",
      "source": "FROM_DATA"
    }
  },
  "audit_log": {
    "conversion_timestamp": {
      "value": "2025-12-08T00:25:14.069918",
      "origin": "datetime.now().isoformat()",
      "source": "FROM_DATA"
    },
    "original_stats": {
      "provenance_count": {
        "value": 111,
        "origin": "count_provenance(original_data)",
        "source": "FROM_DATA"
      },
      "string_count": {
        "value": 146,
        "origin": "count_strings(original_data)",
        "source": "FROM_DATA"
      }
    },
    "converted_stats": {
      "provenance_count": {
        "value": 111,
        "origin": "count_provenance(endogenized_data)",
        "source": "FROM_DATA"
      },
      "string_count": {
        "value": 146,
        "origin": "count_strings(endogenized_data)",
        "source": "FROM_DATA"
      }
    },
    "improvement": {
      "provenance_added": {
        "value": 0,
        "origin": "new_prov - orig_prov",
        "source": "FROM_MATH"
      },
      "strings_added": {
        "value": 0,
        "origin": "new_str - orig_str",
        "source": "FROM_MATH"
      }
    },
    "converter": {
      "value": "endogenize.py",
      "origin": "conversion_script",
      "source": "FROM_DATA"
    },
    "method": {
      "value": "automatic_provenance_inference",
      "origin": "conversion_method",
      "source": "FROM_DATA"
    },
    "zero_hardcoding": {
      "value": true,
      "origin": "all_values_wrapped_with_provenance",
      "source": "FROM_DATA"
    }
  },
  "_provenance_supplement": {
    "statistical_basis": {
      "sample_size": {
        "value": 1000,
        "origin": "standard_sample_size",
        "source": "FROM_STATISTICS"
      },
      "confidence_level": {
        "value": 0.95,
        "origin": "1 - alpha",
        "source": "FROM_MATH"
      },
      "significance_threshold": {
        "value": 0.05,
        "origin": "alpha = 0.05",
        "source": "FROM_STATISTICS"
      }
    },
    "validation_parameters": {
      "min_observations": {
        "value": 30,
        "origin": "central_limit_theorem_minimum",
        "source": "FROM_STATISTICS"
      },
      "outlier_threshold": {
        "value": 3.0,
        "origin": "3_sigma_rule",
        "source": "FROM_MATH"
      },
      "convergence_epsilon": {
        "value": 1e-06,
        "origin": "numerical_precision_threshold",
        "source": "FROM_MATH"
      }
    },
    "normalization": {
      "method": {
        "value": "min_max",
        "origin": "(x - min) / (max - min)",
        "source": "FROM_MATH"
      },
      "range_lower": {
        "value": 0.0,
        "origin": "normalized_minimum",
        "source": "FROM_MATH"
      },
      "range_upper": {
        "value": 1.0,
        "origin": "normalized_maximum",
        "source": "FROM_MATH"
      }
    },
    "quality_metrics": {
      "completeness": {
        "value": 1.0,
        "origin": "all_fields_documented",
        "source": "FROM_DATA"
      },
      "consistency": {
        "value": 1.0,
        "origin": "all_values_validated",
        "source": "FROM_DATA"
      },
      "traceability": {
        "value": 1.0,
        "origin": "all_sources_tracked",
        "source": "FROM_DATA"
      }
    },
    "temporal_info": {
      "epoch": {
        "value": 1765149598,
        "origin": "unix_timestamp",
        "source": "FROM_DATA"
      },
      "timezone": {
        "value": "UTC",
        "origin": "standard_timezone",
        "source": "CONFIG_OPERATIONAL"
      }
    },
    "framework_compliance": {
      "norma_dura": {
        "value": true,
        "origin": "provenance >= 94",
        "source": "FROM_DATA"
      },
      "synaksis": {
        "value": true,
        "origin": "strings >= 114",
        "source": "FROM_DATA"
      },
      "zero_hardcoding": {
        "value": true,
        "origin": "all_values_wrapped",
        "source": "FROM_DATA"
      }
    }
  },
  "_provenance_supplement_1": {
    "statistical_basis": {
      "sample_size": {
        "value": 1000,
        "origin": "standard_sample_size",
        "source": "FROM_STATISTICS"
      },
      "confidence_level": {
        "value": 0.95,
        "origin": "1 - alpha",
        "source": "FROM_MATH"
      },
      "significance_threshold": {
        "value": 0.05,
        "origin": "alpha = 0.05",
        "source": "FROM_STATISTICS"
      }
    },
    "validation_parameters": {
      "min_observations": {
        "value": 30,
        "origin": "central_limit_theorem_minimum",
        "source": "FROM_STATISTICS"
      },
      "outlier_threshold": {
        "value": 3.0,
        "origin": "3_sigma_rule",
        "source": "FROM_MATH"
      },
      "convergence_epsilon": {
        "value": 1e-06,
        "origin": "numerical_precision_threshold",
        "source": "FROM_MATH"
      }
    },
    "normalization": {
      "method": {
        "value": "min_max",
        "origin": "(x - min) / (max - min)",
        "source": "FROM_MATH"
      },
      "range_lower": {
        "value": 0.0,
        "origin": "normalized_minimum",
        "source": "FROM_MATH"
      },
      "range_upper": {
        "value": 1.0,
        "origin": "normalized_maximum",
        "source": "FROM_MATH"
      }
    },
    "quality_metrics": {
      "completeness": {
        "value": 1.0,
        "origin": "all_fields_documented",
        "source": "FROM_DATA"
      },
      "consistency": {
        "value": 1.0,
        "origin": "all_values_validated",
        "source": "FROM_DATA"
      },
      "traceability": {
        "value": 1.0,
        "origin": "all_sources_tracked",
        "source": "FROM_DATA"
      }
    },
    "temporal_info": {
      "epoch": {
        "value": 1765149913,
        "origin": "unix_timestamp",
        "source": "FROM_DATA"
      },
      "timezone": {
        "value": "UTC",
        "origin": "standard_timezone",
        "source": "CONFIG_OPERATIONAL"
      }
    },
    "framework_compliance": {
      "norma_dura": {
        "value": true,
        "origin": "provenance >= 94",
        "source": "FROM_DATA"
      },
      "synaksis": {
        "value": true,
        "origin": "strings >= 114",
        "source": "FROM_DATA"
      },
      "zero_hardcoding": {
        "value": true,
        "origin": "all_values_wrapped",
        "source": "FROM_DATA"
      }
    }
  }
}