{
  "title": "Climate of the United Kingdom",
  "text": "The United Kingdom straddles the higher mid-latitudes between 49° and 61°N on the western seaboard of Europe. Since the UK is always in or close to the path of the polar front jet stream, frequent changes in pressure and unsettled weather are typical. Many types of weather can be experienced in a single day. The basic climate of the UK annually is wet and cool in winter, spring, and autumn with frequent cloudy skies, and drier and warmer (though usually not hot) in summer. \nThe climate in the United Kingdom is defined as a humid temperate oceanic climate, or Cfb on the Köppen climate classification system, a classification it shares with most of north-west Europe. Regional climates are influenced by the Atlantic Ocean and latitude. Northern Ireland, Wales and western parts of England and Scotland are generally the mildest, wettest, and windiest regions of the UK, being closest to the Atlantic Ocean, and temperature ranges there are seldom extreme. Eastern areas are drier and less windy. Northern areas are generally cooler and wetter and have slightly larger temperature ranges than southern areas, which are generally warmer and drier. The south of England is the least exposed to polar air masses from the north,so winters are the least cold, though heavy overcast conditions are common. Summer temperatures in the south of England are cool and range from 18 to 25 °C (64 to 77 °F).\nIf the air masses are strong enough in their respective areas during the summer, there can sometimes be a large difference in temperature between the far north of Scotland (including its islands) and the south-east of England – often a difference of 10–15 °C (18–27 °F) but sometimes as much as 20 °C (36 °F) or more.\n\n\n== England ==\n\n\n=== Averages ===\nEngland generally has low maximum temperatures year round. England is also sunnier throughout the year than Wales, Northern Ireland and Scotland, the sunniest month is July, with an average of 193.5 hours. It rains on fewer days every month throughout the year than the rest of the UK, and rainfall totals are less in every month, with the driest month, May, averaging 58.4 mm (2.30 in). The climate of south-west England displays a seasonal temperature variation, although it is less extreme than most of the United Kingdom with milder winters. Gales are less common in England compared to Scotland; however, on some occasions, there can be strong winds, and rarely, the non-tropical remains of Atlantic hurricanes and tropical storms. Some events such as the Great Storm of 1987 occurred near the UK and caused damage in England.\nRare summer heatwaves of 28 °C+ occur on occasion, but sustained is uncommon, due to the high latitude and cool maritime climate.  London is vulnerable to climate change, and there is increasing concern among hydrological experts that London households may run out of water before 2050.\n\n\n=== Extremes ===\nThe highest temperature recorded in England (and in the United Kingdom) occurred on 19 July 2022 at Coningsby, Lincolnshire. The lowest temperature ever recorded in England occurred on 10 January 1982 in Newport, Shropshire.\n\n\n== Northern Ireland ==\nNorthern Ireland is warmer than Scotland throughout the year. Maximum temperatures are milder than in Wales from December to April, and milder than in England from December to February, but Northern Ireland is cooler during the rest of the year. Sunshine totals in every month are more than those of Scotland, but less than those of the rest of Great Britain. Northern Ireland is drier and has fewer rainy days than Scotland throughout the year, except in May, when it rains on more days. Northern Ireland is also drier than Wales in every month, yet it rains on more days. The rainiest month is January, when 17.8 days have more than 1 mm (0.04 in) of rain on average.\n\nBelow is a list of record temperatures for Northern Ireland, according to the UK Met Office. Both the highest and the lowest temperatures were set in Castlederg in County Tyrone.\n\n\n== Scotland ==\n\nScotland is generally cool compared to the rest of the UK. In the lowlands, an oceanic climate (Köppen: Cfb) prevails, while in the mountains and in parts of Shetland, the summers get cool enough for the climate to be classified as subpolar oceanic (Cfc). As a whole, Scotland has average minimum temperatures just above zero in winter months and rather cool average highs of 17 °C (63 °F) in summer. The Central Lowlands have higher temperatures during the summer than any other part of Scotland, and have also broken some records for the whole of the UK. Aviemore is considered one of the coldest inhabited places, with its inland location and an altitude of about 210 m (690 ft). The wettest month in Scotland is January; most months are wetter than other parts of the UK, except for the late spring to early autumn months.\n\nBelow is a list of record temperatures for Scotland, according to the UK Met Office.\n\n\n== Wales ==\nWales has warmer temperatures throughout the year than Northern Ireland and Scotland and has milder winter minima than England, but cooler winter maxima than Northern Ireland. Wales is wetter throughout the year than Northern Ireland and England, but has fewer rainy days than Northern Ireland; meaning that rainfall tends to be more intense. Wales is also drier than Scotland in every month apart from May, June and December, and there are fewer days with rain than in Scotland. Sunshine totals throughout the year are more than that of Scotland and Northern Ireland, but less than that of neighbouring England. May is the sunniest month, averaging 186.8 hours. The south-western coast is the sunniest part of Wales, averaging over 1700 hours of sunshine annually, with Tenby, Pembrokeshire, its sunniest town. The dullest time of year is between November and January and the sunniest between May and August. The least sunny areas are the mountains, some parts of which average less than 1200 hours of sunshine annually. The prevailing wind is south-westerly. Coastal areas are the windiest, gales occur most often during winter, on average between 15 and 30 days each year, depending on location. Inland, gales average fewer than six days annually. Wales experiences long summer days and short winter days result of northerly latitudes (between 53° 43′ N and 51° 38′ N). Aberystwyth, at the midpoint of the country's west coast, has nearly 17 hours of daylight at the summer solstice. Daylight at midwinter there falls to just over seven and a half hours.\n\nThe country's wide geographic variations cause localised differences in sunshine, rainfall and temperature. Average annual coastal temperatures reach 10.5 °C (51 °F) and in low lying inland areas, 1 °C (1.8 °F) lower. It becomes cooler at higher altitudes; annual temperatures decrease on average approximately 0.5 °C (0.9 °F) each 100 metres (330 feet) of altitude. Consequently, the higher parts of Snowdonia experience average annual temperatures of 5 °C (41 °F). Temperatures in Wales remain higher than would otherwise be expected at its latitude because of the North Atlantic Drift, a branch of the Gulf Stream. The ocean current, bringing warmer water to northerly latitudes, has a similar effect on most of north-west Europe. As well as its influence on Wales' coastal areas, air warmed by the Gulf Stream blows further inland with the prevailing winds. At low elevations, summers tend to be warm and sunny. Average maximum temperatures range between 19 and 22 °C (66 and 72 °F). Winters tend to be fairly wet, rainfall is excessive and the temperature usually stays above freezing. Spring and autumn feel quite similar and the temperatures tend to stay above 14 °C (57 °F) – also the average annual daytime temperature. Rainfall patterns show significant variation. The further west, the higher the expected rainfall; up to 40 per cent more. At low elevations, rain is unpredictable at any time of year, although the showers tend to be shorter in summer. The uplands of Wales have most rain, normally more than 50 days of rain during the winter months (December to February), falling to around 35 rainy days during the summer months (June to August). Annual rainfall in Snowdonia averages between 3,000 millimetres (120 in) (Blaenau Ffestiniog) and 5,000 millimetres (200 in) (Snowdon's summit). The likelihood is that it will fall as sleet or snow when the temperature falls below 5 °C (41 °F) and snow tends to be lying on the ground there for an average of 30 days a year. Snow falls several times each winter in inland areas but is relatively uncommon around the coast. Average annual rainfall in those areas can be less than 1,000 millimetres (39 in).\n\nBelow is a list of record temperatures for Wales, according to the UK Met Office.\n\n\n== Seasons ==\n\n\n=== Spring ===\nSpring is the period from March to May. Spring is generally a calm, cool season, particularly because the Atlantic has lost much of its heat throughout the autumn and winter. As the sun rises higher in the sky and the days get longer, temperatures slowly rise, but the solar effect is mitigated somewhat by the effect of the cool ocean waters and westerly winds that blow across them. There is a chance of snow earlier in the season when temperatures are colder; often in March.\nMean temperatures in Spring are markedly influenced by latitude. Most of Scotland and the mountains of Wales and northern England are the coolest areas of the UK, with average temperatures ranging from −0.6 to 5.8 °C (30.9 to 42.4 °F). The southern half of England experiences the warmest spring temperatures of between 8.8 and 10.3 °C (47.8 and 50.5 °F).\nSpring mean temperatures have become higher during the 2000s and the 2010s. The warmest spring on record was 2017 with a mean temperature for the UK of 9.12C. The coldest spring on record was in 1891 with a mean temperature of 5.42C.\nThe sunniest spring on record for the UK was in 2020 with 626.0 hours recorded on average across the UK. Conversely, the dullest spring on record for the UK was in 1983 with an average of 322.3 hours of sunshine across the UK.\nThe wettest spring on record for the UK was in 1947 with 332.4mm of precipitation falling on average across the UK. The driest spring on record for the UK was in 1893 with just 107.4mm of precipitation falling on average across the UK.\n\n\n=== Summer ===\nSummer lasts from June to August and is the warmest and usually the sunniest season. There can be wide local variations in rainfall totals due to localised thundershowers. These thundershowers mainly occur in southern, eastern, and central England and are less frequent and severe in the north and west. Greater London, Kent, Sussex, Surrey, Essex, Hertfordshire, Cambridgeshire, Suffolk and Norfolk see the most thunderstorms during the summer. The South West, the Midlands, Northern England, Wales and Scotland get thunderstorms too, but they are generally less frequent and severe.  Sometimes during the summer months, a weather pattern called the Spanish Plume forms over the country, bringing very hot weather. This can cause thunderstorms that can be severe in the South West and South East and get weaker as they go north.\nDrought has been noted as a recurring feature.\nThe warmest summer on record for the UK was in 2018 with a mean temperature of 15.76 °C across the UK. Conversely, the coldest summer on record for the UK was in 1922 with a mean temperature of 12.24 °C. Other notable cool summers include 1920, 1954, 1956, 1962, 1965 and 1972.\nThe sunniest summer on record for the UK was in 1976 with 672.1 hours of sunshine recorded across the UK. Conversely, the dullest summer on record for the UK was in 1954 with just 372.7 hours of sunshine recorded on average across the UK.\nThe wettest summer on record for the UK was in 1879 with an average of 399.9mm precipitation across the UK.  Conversely, the driest summer on record for the UK was in 1995 with just 105.9mm of precipitation recorded on average across the UK.\n\n\n=== Autumn ===\nAutumn in the United Kingdom lasts from September to November. The season may be a little more unsettled; as cool polar air moves southwards, it can meet warm air from the tropics and produce an area of disturbance along which the country lies. This can combine with the warm ocean due to heating throughout the spring and summer, to produce some unsettled weather. In addition, the land may become colder than the ocean, resulting in significant amounts of condensation and rain-bearing clouds.\nAtlantic depressions at this time can become intense, and winds of hurricane force (greater than 119 km/h or 74 mph) can be recorded. Western areas, closest to the Atlantic, experience these severe conditions more often than eastern areas. Autumn, particularly the latter part, is often the stormiest time of the year. One particularly intense depression was the Great Storm of 1987. A very severe storm also affected the UK on 27 October 2002. At Mumbles Head near Swansea, a maximum sustained wind speed of over 123 km/h was recorded: equivalent to a Category 1 hurricane. The autumn of 2013 was also littered with severe storms, including the St. Jude's Storm on 28 October 2013.\nAutumn can sometimes be a cold season—in recent years, very low temperatures and heavy snowfall have been recorded during November 1985, November 1993 and November 2010. There was a new record low of −18.0 °C (−0.4 °F) in Wales on 28 November 2010. At Northolt, in Greater London, the coldest temperature of the year 2016 was set on 30 November. Snow also fell rather widely across the UK on 28–29 October 2008, causing traffic problems where it settled on the M4. Even further south, low temperatures can be recorded, with temperatures well below freezing as far south as Heathrow Airport on 29–31 October 1997, with a lower temperature than any recorded at this station in March.\nHowever, the United Kingdom sometimes experiences an \"Indian summer\", when temperatures, particularly by night, can be very mild and rarely fall below 10 °C (50 °F). Such events are aided by the surrounding Atlantic Ocean and seas being at their warmest, keeping the country in warm air, despite the relatively weak sun. Examples of this were in 1985, 1999, 2005, 2006, 2011 and 2016 when September saw above average temperatures which felt more like a continuation of summer than autumn. Autumns since 2000 have generally been very mild, with notable extremes of precipitation; the UK has seen some of its wettest and driest autumns since the millennium. 2011 and 2016 were notable as many areas of the country recorded their highest temperatures of the year in September and October (for example, 28.2 °C (82.8 °F) at Hawarden on 1 October, 26.3 °C (79.3 °F) at St. Athan on 2 October 2011 and the UK's highest temperature of 2016 on 13 September with 34.4 °C (93.9 °F) at Gravesend). On 13 October 2018, temperatures reached 26.5 °C (79.7 °F) at Donna Nook in Lincolnshire, the latest in the year such a high temperature had been recorded. Temperatures on the night of 12–13 October were also just under 18.2 °C (64.8 °F) in London.\nCoastal areas in the southern half of England have on average the warmest autumns, with mean temperatures of 10.7 to 13.0 °C (51.3 to 55.4 °F). Mountainous areas of Wales and northern England, and almost all of Scotland, experience mean temperatures between 1.7 and 7.5 °C (35.1 and 45.5 °F).\n\nThe warmest autumn on record was in 2006 with a mean temperature of 11.35C. The coldest autumn on record was in 1887 with a mean temperature of 6.97C.\nThe sunniest autumn on record for the UK was 1959 with an average of 341.3 sunshine hours recorded on average across the UK. The dullest autumn on record for the UK was in 1968 with just 208.2 hours of sunshine recorded.\nThe wettest autumn on record for the UK was in 2000 with an average of 509.6mm of precipitation across the UK.  The driest autumn on record for the UK was in 1922 with 192.7mm of precipitation.\n\n\n=== Winter ===\nWinter in the UK is defined as lasting from December to February. The season is generally cool, wet, windy, and cloudy. Temperatures at night rarely drop below −10 °C (14 °F) and in the day rarely rise above 15 °C (59 °F). Precipitation can be plentiful throughout the season, though snow is relatively infrequent despite the country's high latitude: often the only areas with significant snowfall are the Scottish Highlands and the Pennines, where at higher elevations a colder climate determines the vegetation, mainly temperate coniferous forest, although deforestation has severely decreased the forest area. For a majority of the UK, snow is frequent in winter time yet is usually light and does not last long, apart from the higher altitudes, where snow can lie for 1–5 months or even beyond 6 months.\nTowards the later part of the season the weather usually stabilises with less wind, less precipitation and lower temperatures. This change is particularly pronounced near the coasts, mainly because the Atlantic Ocean is often at its coldest at this time after being cooled throughout the autumn and the winter. The early part of winter however is often unsettled and stormy; often the wettest and windiest time of the year.\n\nSnow falls intermittently and mainly affects northern and eastern areas, high ground in Wales and especially the mountains of Scotland, where there is often enough snow lying to permit skiing at some of the five Scottish ski resorts. These resorts usually operate between December and April, depending on the snowfall. Frequently in the mountains potent depressions may move in from the north in the form of \"polar lows\", introducing heavy snow and often blizzard-like conditions to parts of the United Kingdom, particularly Scotland. Blizzards have become rarer in the 21st century, although much of England was affected by one on 30 January 2003. During periods of light winds and high pressure, frost and fog can become a problem and can pose a major hazard to drivers.\nMean winter temperatures in the UK are most influenced by proximity to the sea. The coldest areas are the mountains of Wales and northern England, and inland areas of Scotland, averaging −3.6 to 2.3 °C (25.5 to 36.1 °F). Coastal areas, particularly those in the south and west, experience the mildest winters, on average 5 to 8.7 °C (41.0 to 47.7 °F). Hardiness zones in the UK are high, ranging from zone 7 in the Scottish Highlands, the Pennines and Snowdonia, to zone 10 on the Isles of Scilly. Most of the UK lies in zones 8 or 9. In zone 7, the average lowest temperature each year is between −17.7 and −12.3 °C (0.1 and 9.9 °F), and in zone 10, this figure is between −1.1 and 4.4 °C (30.0 and 39.9 °F).\nSnow falls in the UK every year, but in small quantities. The UK can suffer extreme winters like 1684, 1740, 1795 (when London had its record lowest temperature of −21.1 °C (−6.0 °F), 1947 and 1963. In 1962 it snowed on Boxing Day, and snow lasted in most areas until 6 March, with blizzards through February, which had significant and documented effects on the FA Cup - Wrexham were forced to play on sand for one tie. In recent times snow has generally become rarer, but the UK can still get heavy falls, such as in 1978–79, 1981–82, 1986–87 and 1990–91. The winter of 2008/09 produced the heaviest snowfall since 1991 between 1 and 3 February, and the winter of 2009–10 was even more severe, with many parts of the United Kingdom having the coldest and snowiest winters since 1978/79; temperatures plummeted to −22.3 °C (−8.1 °F) at Altnaharra, Sutherland – close to the −22.9 °C (−9.2 °F) recorded in Antarctica in the same period. The lowest temperature ever recorded in the UK was −27.2 °C (−17.0 °F), on 10 January 1982 and 11 February 1895 in Braemar, Scotland and on 30 December 1995 in Altnaharra.\nDecember 2015 was the wettest calendar month ever recorded in the United Kingdom, and January 2016 the second wettest. In these months, some northern and western parts had 2 to 4 times as much rainfall as normal. December 2015 was also the warmest December averaged over the whole UK, and the CET had the warmest December on record. (CET was 9.7 °C (49.5 °F), this is warmer than even any March). Most areas of southern England had average monthly temperatures 5–6 deg. C above normal. Some plants flowered that would normally do so in the spring.\nThe mildest winter on record for England was the winter of 2015–16 with a mean temperature for England of 6.47C.  The coldest winter on record for England was the winter of 1962–63 with a mean temperature of  −0.60 °C (30.9 °F).\n\n\n== Sunshine and cloud ==\n\nThe average total annual sunshine in the United Kingdom is 1339.7 hours, which is just under 30% of the maximum possible (The maximum hours of sunshine possible in one year is approximately 4476 hours). The hours of sunshine vary from 1200 to about 1580 hours per year, and since 1996 the UK has been and still is receiving above the 1981 to 2010 average hours of sunshine.\nGenerally the United Kingdom sees frequent cloudy skies due to its high latitude and oceanic controlled climate. The lowest sunshine hours are found in northern parts of the country and the highest in the southern parts and southern coast of England. The counties of Dorset, Hampshire, Sussex and Kent are the sunniest areas, which have annual average totals of around 1,750 hours of sunshine per year. Northern, western and mountainous areas are generally the cloudiest areas of the UK, with some mountainous areas receiving fewer than 1,000 hours of sunshine a year.\n\nValley areas such as the South Wales Valleys, due to their north–south orientation, receive less sunshine than lowland areas because the mountains on either side of the valley obscure the sun in the early morning and late evening. This is noticeable in winter where there are only a few hours of sunshine. The mountains of Wales, northern England and Scotland can be especially cloudy with extensive mist and fog. Near the coast, sea fog may develop in the spring and early summer. Radiation fog may develop over inland areas of Great Britain and can persist for hours or even days in the winter and can pose a major hazard for drivers and aircraft.\nOften anticyclones (high pressure systems) may move over the United Kingdom, which can persist for weeks or even months. The subsided, dry air from the Azores often results in clear skies and few clouds, bringing frosty nights in winter and warm days in the summer.\nAverage hours of sunshine in winter range from 38–108 hours in some mountainous areas and western Scotland, up to 217 hours in the south and east of England; while average hours of sunshine in summer range from 294–420 hours in northern Scotland and Northern Ireland, to 600–760 hours in southern English coastal counties.\nThe most sunshine recorded in one month was 383.9 hours at Eastbourne (East Sussex) in July 1911.\n\n\n=== Extremes ===\n\n\n== Atlantic Ocean ==\nOne of the greatest influences on the climate of the UK is the Atlantic Ocean and especially the Gulf Stream, which carries warm water up from lower latitudes and modifies the high latitude air masses that pass across the UK. This thermohaline circulation has a powerful moderating and warming effect on the country's climate. This warm water current warms the climate to such a great extent that if the current did not exist then temperatures in winter would be about 10 °C (18 °F) lower than they are today and similar to eastern Russia or Canada near the same latitude. The current allows England to have vineyards at the same latitude that Canada has polar bears. These warm ocean currents also bring substantial amounts of humidity which contributes to the notoriously wet climate that western parts of the UK experience.\n\n\n== Winds ==\n\nThe high latitude and proximity to a large ocean to the west means that the United Kingdom experiences strong winds. The prevailing wind is from the south-west, but it may blow from any direction for sustained periods of time. Winds are strongest near westerly facing coasts and exposed headlands.\nGales—which are defined as winds with speeds of 51 to 101 km/h (32 to 63 mph)—are strongly associated with the passage of deep depressions across the country. The Hebrides experience on average 35 days of gale a year (a day where there are gale-force winds) while inland areas in England and Wales receive fewer than 5 days of gale a year. Areas of high elevation tend to have higher wind speeds than low elevations, and Great Dun Fell in Cumbria (at 857 m or 2,812 ft) averaged 114 days of gale a year during the period 1963 to 1976. The highest gust recorded at a low level in England was 191 km/h (119 mph) at Gwennap Head in Cornwall on 15 December 1979, and a 115 mph gust was also recorded at Shoreham-By-Sea on 16 October 1987. A disputed 122 mph gust was recorded on 16 October 1987 at Gorleston in Norfolk during the Great Storm of 1987. In Scotland, Fraserburgh in Aberdeenshire recorded 229 km/h (142 mph) on 13 February 1989, which was equalled during Cyclone Xaver on 5 December 2013. Wales' highest wind speed gust of 200 km/h (124 mph) was set at Rhoose, Vale of Glamorgan on 28 October 1989. Especially potent storm systems typically affect the UK during autumn and winter, with the winters of 1989/1990 and 2013/2014 particularly notable for the frequency and potency of storm systems.\nAn unofficial gust of 194 mph (312 km/h) was recorded in the Shetland Isles during the New Year's Day Storm on 1 January 1992, and an equal unofficial 194 mph wind gust is claimed to have been set in the Cairngorm Mountains on 19 December 2008.\nBarometric pressure plays a role in storm systems. For the United Kingdom, record figures for barometric pressure recordings are:\nHighest – 1053.6mb (Aberdeen, 31 January 1902)\nLowest – 925.6mb (Ochtertyre, 26 January 1884)\nNotably a low pressure storm system affected the UK with a central pressure of 914.0mb on 10 January 1993, however this figure is not recorded over the UK but out in the Atlantic, despite the system affecting the UK.\n\n\n== Rainfall ==\nRainfall amounts can vary greatly across the United Kingdom: generally the further west and the higher the elevation, the greater the rainfall. The mountains of Wales, Scotland, the Pennines in Northern England and the moors of South West England are the wettest parts of the country, and in some of these places as much as 4,577 millimetres (180.2 in) of rain can fall annually, making these locations some of the wettest in Europe. The wettest spot in the United Kingdom is Crib Goch, in Snowdonia, which averaged 178 inches (4,500 mm) rain over a 30 year period. Most rainfall in the United Kingdom comes from North Atlantic depressions which roll into the country throughout the year from the west or southwest and are particularly frequent and intense in the autumn and winter. They can on occasions bring prolonged periods of heavy rain, and flooding is quite common.\nParts of England are dry in global terms, which is contrary to the stereotypical view—London receives just below 650 millimetres (25.6 in) per annum, which is less than Rome, Sydney, or New York City. In East Anglia it typically rains on about 113 days per year. Most of the south, south-east and East Anglia receive less than 700 millimetres (27.6 in) of rain per year. The English counties of Essex, Cambridgeshire—as well as parts of North Yorkshire, the East Riding of Yorkshire, Suffolk and Norfolk—are amongst the driest in the UK, with an average annual rainfall of around 600 millimetres (23.6 in). This is due to a mild rainshadow effect, due to mountainous parts of the South West, Wales and Cumbria blocking the moist airflow across the country to the east. In some years rainfall totals in Essex and South Suffolk can be below 450 millimetres (17.7 in) (especially areas around Colchester, Clacton and Ipswich)—less than the average annual rainfall in Jerusalem, Beirut and even some semi-arid parts of the world. The rainy reputation of Britain originates from the frequent cool, cloudy and drizzly conditions rather than overall rainfall amounts.\nParts of the United Kingdom have had drought problems in recent years, particularly in 2004–2006 and more recently in 2018. Fires broke out in some areas, even across the normally damp higher ground of north-west England and Wales. The landscape in much of England and east Wales became very parched, even near the coast; water restrictions were in place in some areas.\nJuly 2006 was the hottest month on record for the United Kingdom and much of Europe, however England has had warmer spells of 31 days which did not coincide with a calendar month—in 1976 and 1995. The impact of droughts is increased because the driest parts of England also have the highest population density, and therefore the highest water consumption. The drought in 2006 was eased when in the period from October 2006 to January 2007, which had well above average rainfall.\nDecember 2015 was the wettest month ever recorded in the United Kingdom. The average rainfall for the month was almost doubled.\n\n\n=== Extremes ===\n\n\n== Temperature ==\n\nGenerally, the United Kingdom has cool to mild winters and warm to hot summers with moderate variation in temperature throughout the year. In England the average annual temperature varies from 8.5 °C (47.3 °F) in the north to 11 °C (51.8 °F) in the south, but over the higher ground this can be several degrees lower. This small variation in temperature is to a large extent due to the moderating effect the Atlantic Ocean has—water has a much greater specific heat capacity than air and tends to heat and cool slowly throughout the year. This has a warming influence on coastal areas in winter and a cooling influence in summer.\nThe ocean is at its coldest in February or early March, thus around coastal areas February is often the coldest month, but inland there is little to choose between January and February as the coldest. Temperatures tend to drop lowest on late winter nights inland, in the presence of high pressure, clear skies, light winds and when there is snow on the ground. On occasions, cold polar or continental air can be drawn in over the United Kingdom to bring very cold weather.\nThe floors of inland valleys away from the warming influence of the sea can be particularly cold, as cold, dense air drains into them. A temperature of −26.1 °C (−15.0 °F) was recorded under such conditions at Edgmond in Shropshire on 10 January 1982, the coldest temperature recorded in England and Wales. The following day the coldest maximum temperature in England, at −11.3 °C (11.7 °F), was recorded at the same site.\nOn average the warmest winter temperatures occur on the south and west coasts, however, warm temperatures occasionally occur due to a foehn wind warming up downwind after crossing the mountains. Temperatures in these areas can rise to 15 °C (59 °F) in winter on rare occasions This is a particularly notable event in northern Scotland, mainly Aberdeenshire, where these high temperatures can occur in midwinter when the sun only reaches about 10° above the horizon.\nJuly is on average the warmest month, and the highest temperatures tend to occur away from the Atlantic in southern, eastern and central England, where summer temperatures can rise above 30 °C (86 °F).\n\n\n== Severe weather ==\nThe United Kingdom is not particularly noted for extreme weather, as the region's cool, oceanic climate is opposed to convective storms. However, events such as floods and drought may be experienced. The summer of 1976 or 2018, for example, experienced temperatures as high as 35 °C (95 °F), and it was so dry the country suffered drought and water shortages.\nExtended periods of extreme weather, such as the droughts of 1975–1976, summer 2006, and spring 2012, the long hot summers of 1911, 1976, 2003, 2006 and 2018, and the winters of 1946–1947, 1962–1963, 2009–2010, and 2010–2011 are often caused by blocking anticyclones which can persist for several days, weeks, or even months. In winter they can bring long periods of cold dry weather and in summer long periods of hot dry weather.\n\nThere have also been occurrences of severe flash floods caused by intense rainfall; the most severe was the Lynmouth disaster of 1952 in which 34 people died and 38 houses and buildings were completely destroyed. In the summer of 2004, a severe flash flood devastated the town of Boscastle in Cornwall. However, the worst floods in the United Kingdom in modern times occurred in the North Sea flood of 1953. A powerful storm from the Atlantic moved around Scotland and down the east coast of England. As it moved south it produced a storm surge which was magnified as the North Sea became narrower further south. By the time the storm affected south-east England and the Netherlands, the surge had reached the height of 3.6 metres (12 ft). Over 300 people were killed by the floods in eastern England.\nThunderstorms in general are not common in the U.K. The areas that see the most occur in the southern part of England, while areas in the north and west see very few thunderstorms annually. In London, thunderstorms occur on average 14–19 days a year, while in most of Northern Ireland and the west of Scotland thunderstorms occur on around 3 days a year. The counties that see the most storms are Kent, the eastern part of Surrey, Sussex, Greater London, Essex, Cambridgeshire, Hertfordshire, Suffolk, Norfolk and to a lesser extent Lincolnshire and Nottinghamshire. Occasionally, thunderstorms can be severe and produce large hailstones as seen in Ottery St Mary, Devon in October 2008, where drifts reached 1.8 metres (5 ft 11 in).\nStrong winds occur mainly in the autumn and winter months associated with low pressure systems and Scotland experiences hurricane-force winds in most winters. The Gale of January 1976, Great Storm of 1987 (23 fatalities) and the Burns' Day storm of 1990 (97 fatalities) are particularly severe examples; Scotland saw winds of 142 mph during Cyclone Xaver in 2013.\nThe most rain recorded to fall on a single day was 279 mm at Martinstown (Dorset) on 18 July 1955, but also 243 mm fell at Bruton, Somerset on 28 June 1917. Heavy rain also fell between 20 and 25 June in 2007; some areas experienced a month's rainfall in one day. Four people died in the flooding and over £1.5 billion of damage to businesses and properties was caused.\nTropical cyclones do not affect the UK due to the high latitude, cold ocean waters, and distance from source regions of tropical storms. so any tropical cyclone that does come anywhere near the UK has said to have undergone a process called extratropical transition. This now means it is an extratropical cyclone, which the UK frequently experiences. The Great Storm of 1987 was a very deep depression which formed in the Bay of Biscay, which also contained the remnants of Hurricane Floyd. Hurricane Lili of 1996 and Hurricane Gordon of 2006 both crossed the UK as strong extratropical cyclones with tropical hurricane-force winds, causing transport closures, power-cuts and flooding in Northern Ireland, Scotland and South West England. In 2011, the remnants of Hurricane Katia passed over northwestern Scotland with winds near 70 mph (110 km/h).\n\n\n== Tornadoes ==\nThe United Kingdom has at least 33 tornadoes per year, more than any other country in the world relative to its land area. Though these tornadoes are much weaker than in areas of the United States, there is a significant number of these tornadoes annually. Dr. Ted Fujita (inventor of the Fujita scale), an American meteorologist, was the first to recognise the UK as the top site for tornadoes in 1973. Although most tornadoes are weak, there are occasional destructive events, for example, the 2005 Birmingham tornado and the 2006 London tornado, registering IF3 and F2 on the International Fujita scale and Fujita scale respectively. both caused significant damage and injury. The largest ever recorded was thought to have been an F4, again in London in 1091. The deadliest known tornado was an F3 which occurred on 27 October 1913 in south Wales.\nThe UK also holds the title for the largest known tornado outbreak outside of the United States. On 23 November 1981, 105 tornadoes were spawned by a cold front in the space of 5.25 hours. Excepting Derbyshire, every county in a triangular area from Gwynedd to Humberside to Essex was hit by at least one tornado, while Norfolk was hit by at least 13. Very fortunately most tornadoes were short-lived and also weak (the strongest was around T5 on the TORRO Tornado Scale) and no deaths occurred.\nSouthern England between the Isle of Wight and Beachy Head has been recognised as a 'hotspot' for tornadoes and waterspouts. The area (known as 'The Isle of Wight and South Coast Anomaly') has seen significant activity and is thought to be due to the shedding of vortices, downwind of the Isle of Wight, under certain weather conditions.\n\n\n== Climate history ==\n\nThe climate of the United Kingdom has not always been the way it is today. During some periods it was much warmer and in others it was much colder. The last glacial period was a period of extreme cold weather that lasted for tens of thousands of years and ended about 10,000 years ago. During this period the temperature was so low that much of the surrounding ocean froze and a great ice sheet extended over all of the United Kingdom except the south of England (connected to mainland Europe via the dry English Channel) and southern coastal areas of Wales.\nThe cold period from the 16th to the mid-19th centuries is known as the Little Ice Age.\nThe temperature records in England are continuous back to the mid-17th century. The Central England temperature (CET) record is the oldest in the world, and is a compound source of cross-correlated records from several locations in central England. Precipitation records date back to the eighteenth century and the modern England and Wales Precipitation series begins in 1766.\nA detailed narrative account of the weather of every year from 1913 to 1942, with photographs of plants taken on the same day in each of those years, may be found in Willis (1944).\nAs with many parts of the world, over the last century the United Kingdom has reported a warming trend in temperatures. While some of this may be due to a recovery from the cooler period of climate mid 20th century (particularly the 1960s) the last 20 years has nonetheless seen an unprecedented level of warm weather. In July 2019, BBC reported that records from the Met Office show that the 10 warmest years in the UK have occurred since 2002, with 2014 being the warmest. In the same period, the coolest year has been 2010; however, this still only ranks 22nd on the overall list of coolest years on record. In January 2024, provisional data released by the Met Office report that 2023 was the second hottest year on record, surpassing 2014. This puts it just behind 2022, which recorded an average temperature of only 0.06 °C (32.11 °F) higher. However, for both Wales and Northern Ireland, 2023 was their hottest year on record.\nThe averages shown below have been calculated using month CET data from 1659, using periods of 30 years as the WMO advises.\n\n\n== Monthly temperature extremes ==\nMonthly extremes are only accepted by the UK Met Office if they are reported at stations below 500 metres (1,600 ft) in elevation. Lower temperatures have been frequently reported at slightly more elevated stations.\n\n\n=== Overall ===\n\n\n=== Maximum temperatures ===\nBelow is a list of the highest and lowest daily maximum temperatures recorded in the UK. This is in accordance with the Met Office, hence readings from the Cairn Gorm station are not on this list.\n\n\n=== Minimum temperatures ===\nBelow is a list of the highest and lowest daily minimum temperatures recorded in the UK. This is in accordance with the met office, hence readings from the Cairn Gorm station are not on this list.\n\n\n== Climate change ==\n\nCentral estimates produced by the Met Office predict average annual temperature to increase by 2 °C and the warmest summer day to increase by 3 °C by the 2050s. Average winter rainfall is also likely to increase and most areas will see a slight decrease in annual rainfall.\nAccording to the Met Office, in the UK, the decade from 2000 to 2009 was the warmest since instrumental record dating started in 1850. Additionally, it was reported by the Met Office and BBC in 2019 that the 10 warmest years in the UK have all been since 2002.\nBoris Johnson announced that UK will set a target of 68% reduction in GHG emissions by the year 2030 and include this target in its commitments in the Paris agreement.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nMet Office",
  "source_url": "https://en.wikipedia.org/wiki/Climate_of_the_United_Kingdom",
  "fetched_at": "2025-12-06T07:06:26.554802",
  "page_id": "84358"
}