{
  "title": "Greek",
  "text": "Greek may refer to:\nAnything of, from, or related to Greece, a country in Southern Europe:\n\nGreeks, an ethnic group\nGreek language, a branch of the Indo-European language family\nProto-Greek language, the assumed last common ancestor of all known varieties of Greek\nMycenaean Greek, most ancient attested form of the language (16th to 11th centuries BC)\nAncient Greek, forms of the language used c. 1000–330 BC\nKoine Greek, common form of Greek spoken and written during Classical antiquity\nMedieval Greek or Byzantine Language, language used between the Middle Ages and the Ottoman conquest of Constantinople\nModern Greek, varieties spoken in the modern era (from 1453 AD)\nGreek alphabet, script used to write the Greek language\nGreek Orthodox Church, several Churches of the Eastern Orthodox Church\nAncient Greece, the ancient civilization before the end of Antiquity\nOld Greek, the language as spoken from Late Antiquity to around 1500 AD\nGreek mythology, a body of myths originally told by the Ancient Greeks\n\n\n== Other uses ==\nGreek (play), a 1980 play by Steven Berkoff\nGreek (opera), a 1988 opera by Mark-Antony Turnage, based on Steven Berkoff's play\nGreek (TV series) (also stylized GRΣΣK), 2007 ABC Family channel's comedy-drama television series set at a fictitious college's fictional Greek system.\nGreek-letter organizations (GLOs), social organizations for undergraduate students at North American colleges\nGreek love, a term referring variously to male bonding, homosexuality, pederasty and anal sex\nGreek Revival architecture, an architectural movement of the late 18th and early 19th centuries\nGreek Theatre (Los Angeles), a theatre located at Griffith Park in Los Angeles, California\nGreeking, a style of displaying or rendering text or symbols in a computer display or typographic layout\nGreeks, a group of scholars in 16th-century England who were part of the Grammarians' War\nGreeks (finance), quantities representing the sensitivity of the price of derivatives\nNick the Greek (Nick Dandolos, 1883–1966), professional gambler\nPhil the Greek, a nickname for Prince Philip, Duke of Edinburgh (1921–2021)\nThe Greek, a fictional character on the HBO drama The Wire.\nThe Greeks (book), a 1951 non-fiction book on classical Greece by H. D. F. Kitto\n\n\n== See also ==\nAll pages with titles beginning with Greek \nGreek dialects (disambiguation)\nGreek to me, an idiom for something not understandable\nGreeks (disambiguation)\nHellenic (disambiguation)\nName of Greece, names for the country\nNames of the Greeks, terms for the Greek people",
  "source_url": "https://en.wikipedia.org/wiki/Greek",
  "fetched_at": "2025-12-06T07:23:16.517612",
  "page_id": "11882"
}