{
  "title": "Hennigsdorf",
  "text": "Hennigsdorf (German pronunciation: [ˈhɛnɪçsˌdɔʁf] ) is a town in the district of Oberhavel, in Brandenburg, in eastern Germany. It is situated north-west of Berlin, just across the city border, which is formed mainly by the Havel river.\n\n\n== History ==\n\nThe town was first mentioned in 1375, when it was part of the Bohemian Crown. Afterwards it was part of the Margraviate of Brandenburg, then of the Kingdom of Prussia from 1701, and of the German Empire from 1871. During World War II, in 1944, a subcamp of the Sachsenhausen concentration camp was established, in which some 650 women, mostly Polish, were imprisoned and subjected to forced labour. In April 1945, the subcamp was dissolved and the surviving prisoners were sent on a death march to the Ravensbrück concentration camp.\nAfter the war, it formed part of East Germany. The municipality shared its borders with the former West Berlin, and so during the period 1961–1990 it was separated from it by the Berlin Wall.\nIn 1951/2, the Havel Canal was constructed to link Hennigsdorf with Paretz, thus avoiding a passage through the reach of the River Havel, between Spandau and Potsdam, that was under the political control of West Berlin. The canal is still in use, providing a shorter route for shipping from west of Berlin to the Oder–Havel Canal and Poland.\n\n\n== Geography ==\n\n\n=== Subdivision ===\nHennigsdorf consists of 3 districts:\n\nHennigsdorf\nNieder Neuendorf (since 1923)\nStolpe-Süd (since May 1, 1998)\n\n\n=== Neighbouring places ===\nVelten\nHohen Neuendorf\nBerlin\nSchönwalde-Glien\nOberkrämer\n\n\n== Twin towns – sister cities ==\n\nHennigsdorf is twinned with:\n\n\n== Economy ==\nLocated in Hennigsdorf  is the (Bombardier until 2021) Stadler LEW Hennigsdorf train factory and a steel smelter.\n\n\n== Sport ==\nHennigsdorf is home to Stahl Hennigsdorf Rugby, a rugby union club. The team, formed in 1948 under the leadership of Erwin Thiesies, was the most successful side during the East German era of the town, having won 27 national championships from 1952 to 1990.\n\n\n== Demography ==\n\n\n== Notable people ==\n\nMichael Hartmann (born 1974), footballer\nFrank Klawonn (born 1966), rower\nDirk Kummer (born 1966), actor, director, writer\nMartin Männel (born 1988), footballer\nErich Muhsfeldt (1913–1948), SS officer at Auschwitz and Majdanek concentration camps executed for war crimes\nErich Priebke (1913–2013), Nazi war criminal\nKarsten Schmeling (born 1962), rower\nErwin Thiesies (1908–1993), rugby union player who died in Hennigsdorf\n\n\n== See also ==\nLEW Hennigsdorf, large rail vehicle factory located in Hennigsdorf\n\n\n== References ==\n\n\n== External links ==\n Media related to Hennigsdorf at Wikimedia Commons\n\nOfficial website  (in German)",
  "source_url": "https://en.wikipedia.org/wiki/Hennigsdorf",
  "fetched_at": "2025-12-06T07:26:07.348604",
  "page_id": "4695672"
}