{
  "title": "Herod",
  "text": "Herod may refer to:\n\n\n== Members of the Herodian dynasty ==\nMembers of the Herodian dynasty, named after Herod the Great, in chronological order:\n\nHerod the Great (born c. 74 BC, ruled 37–4 BC or 1 BC), client king of Judea who expanded the Second Temple in Jerusalem and in the New Testament orders the Massacre of the Innocents\nHerod II or Herod Philip I (c. 27 BC–33 AD), father of the Salome in Mark 6:21-29, did not rule over any territory\nHerod Archelaus (23 BC–c. AD 18, ruled 4 BC–AD 6), ethnarch of Samaria, Judea, and Idumea\nHerod Antipas (born 21 BC, ruled 4 BC–AD 39), tetrarch of Galilee and Peraea and in the New Testament orders the death of John the Baptist and mocks Jesus\nPhilip the Tetrarch, sometimes incorrectly called Herod Philip II, (born c. 20 BC, ruled 4 BC–AD 34), tetrarch of Iturea, Trachonitis, and Batanaea\nHerod Agrippa (born c. 11 BC, ruled AD 41–44), client king of Judaea, called \"King Herod\" or \"Herod\" in Acts 12 of the New Testament\nHerod of Chalcis (died AD 48), also known as Herod II or Herod V, king of Chalcis (r. AD 41–48)\nHerod Agrippa II (born AD 27, ruled 48–c. 92), ruled Chalcis and described in Acts 25 of the New Testament as \"King Agrippa\" before whom Paul the Apostle defended himself\n\n\n== US places ==\nAveritt-Herod House, historic house in Hartsville, Tennessee\nHerod, Illinois, United States\nHerods Run, a stream in West Virginia\n\n\n== Other ==\nHerod (band), a heavy metal band from the United States\nHerod (horse), a thoroughbred racehorse\nHérode et Mariamne, a tragedy by Voltaire\nLike Herod, a song by Scottish post-rock band Mogwai\n\n\n== See also ==\nHerodian dynasty\nHarrod (disambiguation)\nHerodes Atticus (AD 101–177), a Greek aristocrat not related to the Herodian Dynasty who served as a Roman senator and proponent of Sophism\nHerred, an administrative area in Denmark and Norway\nHerodian (disambiguation)\nHerrod (disambiguation)\nOrodes (disambiguation)",
  "source_url": "https://en.wikipedia.org/wiki/Herod",
  "fetched_at": "2025-12-06T07:26:01.550785",
  "page_id": "52291"
}