{
  "title": "It",
  "text": "It or IT may refer to:\n\nIt (pronoun), in English\nInformation technology\n\n\n== Arts and media ==\n\n\n=== Film and television ===\nIt (1927 film), a film starring Clara Bow\nIt! The Terror from Beyond Space, a 1958 science fiction film\nIt! (1967 film), a British horror film starring Roddy McDowell\nIt (1989 film), a Soviet comedy film directed by Sergei Ovcharov\nIt (miniseries), a 1990 television miniseries based on Stephen King's novel\nIt (Phish video), a 2004 DVD set about the Phish festival\nIncredible Tales, simply known as I.T., a 2004 Singaporean horror anthology TV series\nI.T. (film), a 2016 film starring Pierce Brosnan\nIt (2017 film), the first in a two-part film adaptation of Stephen King's novel\nIt Chapter Two (2019), the second in a two-part film adaptation of Stephen King's novel\nIt: Welcome to Derry (2025), a prequel television series\n\n\n=== Characters ===\nIt, properly the Psammead, the title character of the 1902 novel Five Children and It\nIt! The Living Colossus, a 1961 comic book character\nIT, a character in the 1962 novel A Wrinkle in Time\nIt (character), the title character from Stephen King's 1986 novel It (also known as Pennywise)\nIt, a character from the video game Baba Is You\n\n\n=== Journalism ===\nIT, previous name of the Irish Tatler, see Tatler (1901)\nInternational Times, est. 1966, a fortnightly newspaper\nIllinois Times, est. 1975, a weekly newspaper\n\n\n=== Literature ===\n\"It!\" (short story), a 1940 short story by Theodore Sturgeon\nIt (poetry collection), a 1969 book of poetry by Inger Christensen\nIt (novel), a 1986 novel by Stephen King\nIt, a 2013 book by British model and presenter Alexa Chung\n\n\n=== Music ===\nIt (Phish festival), since 1990, the band's festivals and tours in the United States\n\"IT\" (XM), from 2002 to 2007, an annual radio special, with most songs aired in chronological order\n\n\n==== Album ====\nIt (Pulp album), 1983\nIt (Alan Vega album), 2017\n\n\n==== Band ====\nTony Särkkä or It, a Swedish black metal musician\n\n\n==== Song ====\n\"It\", a 1974 song by Genesis from The Lamb Lies Down on Broadway\n\"It\", a 1987 song by Prince from Sign \"O\" the Times\n\"iT\"  [sic], a 2014 song by Christine and the Queens from Chaleur humaine\n\"It\", a 2015 song by Niki & Gabi\n\n\n== Games ==\nTag (game), or It, since at least the fourth century BC\nIt (board game), a 1978 tank battle game\n\n\n== Science and technology ==\n\n.it, the Internet top-level domain for Italy\nInferior temporal gyrus, a.k.a. IT cortex, a region of the brain\nIT (file format), an audio file format used by Impulse Tracker\nIT, an electrical network earthing system\nIntegration testing (usually I&T), a phase in software testing\nIntrathecal administration and intratracheal instillation, routes of drug administration\nIsomeric transition, a decay process in an atomic nucleus\nit drive (1998–2002), a 144 MB superfloppy drive by Caleb\n\n\n== Standards ==\nIran Time\nItaly (ISO 3166 code)\nItalian language (ISO 639-1 code)\n\n\n== Transport ==\nAir Inter (IATA Code 1954–1997), France\nKingfisher Airlines (IATA Code 2003–2012), India\nTigerair Taiwan (IATA Code 2014-)\nIntelligent Transit, a 2009–2015 bus service in West Virginia, U.S.\n\n\n=== Vehicles ===\nAs of the 1970s, a series of Yamaha Enduro motorcycles\nDynasty IT, a 2001 car\n\n\n== Other uses ==\nIT markers, dated between the 6th and 4th century BCE, in the Aṣṭādhyāyī by Pāṇini\nIt, a ropes course at several locations of Jordan's Furniture, founded 1918 in New England\nI.T, founded 1988, a Hong Kong fashion conglomerate\n\n\n== See also ==\nIt girl, a charismatic young woman\nCousin Itt, character in The Addams Family\nGetting It: The Psychology of est",
  "source_url": "https://en.wikipedia.org/wiki/It",
  "fetched_at": "2025-12-06T07:23:19.417125",
  "page_id": "74821"
}