{
  "title": "Planetary equilibrium temperature",
  "text": "The planetary equilibrium temperature is a theoretical temperature that a planet would be if it were in radiative equilibrium, typically under the assumption that it radiates as a black body being heated only by its parent star. In this model, the presence or absence of an atmosphere (and therefore any greenhouse effect) is irrelevant, as the equilibrium temperature is calculated purely from a balance with incident stellar energy.\nOther authors use different names for this concept, such as equivalent blackbody temperature of a planet. The effective radiation emission temperature is a related concept, but focuses on the actual power radiated rather than on the power being received, and so may have a different value if the planet has an internal energy source or when the planet is not in radiative equilibrium.\nPlanetary equilibrium temperature differs from the global mean temperature and surface air temperature, which are measured observationally by satellites or surface-based instruments, and may be warmer than the equilibrium temperature due to the greenhouse effect.\n\n\n== Calculation of equilibrium temperature ==\nConsider a planet orbiting its host star. The star emits radiation isotropically, and some fraction of this radiation reaches the planet. The amount of radiation arriving at the planet is referred to as the incident solar radiation,  \n  \n    \n      \n        \n          I\n          \n            o\n          \n        \n      \n    \n    {\\displaystyle I_{o}}\n  \n. The planet has an albedo that depends on the characteristics of its surface and atmosphere, and therefore only absorbs a fraction of radiation. The planet absorbs the radiation that isn't reflected by the albedo, and heats up. One may assume that the planet radiates energy like a blackbody at some temperature according to the Stefan–Boltzmann law. Radiative equilibrium exists when the power supplied by the star is equal to the power emitted by the planet. The temperature at which this balance occurs is the planetary equilibrium temperature.\n\n\n=== Derivation ===\nThe solar flux absorbed by the planet from the star is equal to the flux emitted by the planet:\n\n  \n    \n      \n        \n          \n            F\n          \n          \n            \n              a\n              b\n              s\n            \n          \n        \n        =\n        \n          \n            F\n          \n          \n            \n              e\n              m\n              i\n              t\n            \n          \n        \n      \n    \n    {\\displaystyle {F}_{\\rm {abs}}={F}_{\\rm {emit}}}\n  \n\nAssuming a fraction of the incident sunlight is reflected according to the planet's Bond albedo, \n  \n    \n      \n        \n          A\n          \n            B\n          \n        \n      \n    \n    {\\displaystyle A_{B}}\n  \n:\n\n  \n    \n      \n        (\n        1\n        −\n        \n          A\n          \n            B\n          \n        \n        )\n        \n          \n            F\n          \n          \n            \n              s\n              o\n              l\n              a\n              r\n            \n          \n        \n        =\n        \n          \n            F\n          \n          \n            \n              e\n              m\n              i\n              t\n            \n          \n        \n      \n    \n    {\\displaystyle (1-A_{B}){F}_{\\rm {solar}}={F}_{\\rm {emit}}}\n  \n\nwhere \n  \n    \n      \n        \n          \n            F\n          \n          \n            \n              s\n              o\n              l\n              a\n              r\n            \n          \n        \n      \n    \n    {\\displaystyle {F}_{\\rm {solar}}}\n  \n represents the area- and time-averaged incident solar flux, and may be expressed as:\n\n  \n    \n      \n        \n          F\n          \n            \n              s\n              o\n              l\n              a\n              r\n            \n          \n        \n        =\n        \n          I\n          \n            o\n          \n        \n        \n          /\n        \n        4\n      \n    \n    {\\displaystyle F_{\\rm {solar}}=I_{o}/4}\n  \n\nThe factor of 1/4 in the above formula comes from the fact that only a single hemisphere is lit at any moment in time (creates a factor of 1/2), and from integrating over angles of incident sunlight on the lit hemisphere (creating another factor of 1/2).\nAssuming the planet radiates as a blackbody according to the Stefan–Boltzmann law at some equilibrium temperature \n  \n    \n      \n        \n          \n            T\n          \n          \n            e\n            q\n          \n        \n      \n    \n    {\\displaystyle {T}_{eq}}\n  \n, a balance of the absorbed and outgoing fluxes produces:\n\n  \n    \n      \n        (\n        1\n        −\n        \n          A\n          \n            B\n          \n        \n        )\n        \n          (\n          \n            \n              \n                I\n                \n                  o\n                \n              \n              4\n            \n          \n          )\n        \n        =\n        σ\n         \n        \n          T\n          \n            \n              e\n              q\n            \n          \n          \n            4\n          \n        \n      \n    \n    {\\displaystyle (1-A_{B})\\left({\\frac {I_{o}}{4}}\\right)=\\sigma \\ T_{\\rm {eq}}^{4}}\n  \n where \n  \n    \n      \n        σ\n      \n    \n    {\\displaystyle \\sigma }\n  \n is the Stefan-Boltzmann constant.\nRearranging the above equation to find the equilibrium temperature leads to:\n\n  \n    \n      \n        \n          \n            T\n          \n          \n            \n              e\n              q\n            \n          \n        \n        =\n        \n          \n            \n              (\n              \n                \n                  \n                    \n                      I\n                      \n                        o\n                      \n                    \n                    \n                      (\n                      \n                        1\n                        −\n                        \n                          A\n                          \n                            B\n                          \n                        \n                      \n                      )\n                    \n                  \n                  \n                    4\n                     \n                    σ\n                  \n                \n              \n              )\n            \n          \n          \n            1\n            \n              /\n            \n            4\n          \n        \n      \n    \n    {\\displaystyle {T}_{\\rm {eq}}={\\left({\\frac {I_{o}\\left(1-A_{B}\\right)}{4\\ \\sigma }}\\right)}^{1/4}}\n  \n\n  \n    \n      \n        \n          T\n          \n            \n              e\n              q\n            \n          \n        \n        =\n        \n          \n            \n              (\n              \n                \n                  \n                    \n                      L\n                      \n                        o\n                      \n                    \n                    \n                      (\n                      \n                        1\n                        −\n                        \n                          A\n                          \n                            B\n                          \n                        \n                      \n                      )\n                    \n                  \n                  \n                    16\n                     \n                    σ\n                     \n                    π\n                     \n                    \n                      d\n                      \n                        2\n                      \n                    \n                  \n                \n              \n              )\n            \n          \n          \n            1\n            \n              /\n            \n            4\n          \n        \n      \n    \n    {\\displaystyle T_{\\mathrm {eq} }={\\left({\\frac {L_{o}\\left(1-A_{B}\\right)}{16\\ \\sigma \\ \\pi \\ d^{2}}}\\right)}^{1/4}}\n  \n where \n  \n    \n      \n        \n          L\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle L_{0}}\n  \n is the luminosity of the Sun (\n  \n    \n      \n        3.828\n        ⋅\n        \n          10\n          \n            26\n          \n        \n      \n    \n    {\\displaystyle 3.828\\cdot 10^{26}}\n  \n W), and \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n is the distance between the planet and the Sun, then : \n\n  \n    \n      \n        \n          T\n          \n            \n              e\n              q\n            \n          \n        \n        =\n        1.07652\n        ⋅\n        \n          10\n          \n            8\n          \n        \n        \n          \n            \n              (\n              \n                \n                  \n                    (\n                    \n                      1\n                      −\n                      \n                        A\n                        \n                          B\n                        \n                      \n                    \n                    )\n                  \n                  \n                    d\n                    \n                      2\n                    \n                  \n                \n              \n              )\n            \n          \n          \n            1\n            \n              /\n            \n            4\n          \n        \n      \n    \n    {\\displaystyle T_{\\mathrm {eq} }=1.07652\\cdot 10^{8}{\\left({\\frac {\\left(1-A_{B}\\right)}{d^{2}}}\\right)}^{1/4}}\n  \n (with \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n in metres), or :\n\n  \n    \n      \n        \n          T\n          \n            \n              e\n              q\n            \n          \n        \n        =\n        3\n        ,\n        404.255\n        ⋅\n        \n          \n            \n              (\n              \n                \n                  \n                    (\n                    \n                      1\n                      −\n                      \n                        A\n                        \n                          B\n                        \n                      \n                    \n                    )\n                  \n                  \n                    d\n                    \n                      2\n                    \n                  \n                \n              \n              )\n            \n          \n          \n            1\n            \n              /\n            \n            4\n          \n        \n      \n    \n    {\\displaystyle T_{\\mathrm {eq} }=3,404.255\\cdot {\\left({\\frac {\\left(1-A_{B}\\right)}{d^{2}}}\\right)}^{1/4}}\n  \n (with \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n in million kilometres).\n\n\n== Calculation for extrasolar planets ==\nFor a planet around another star, \n  \n    \n      \n        \n          I\n          \n            o\n          \n        \n      \n    \n    {\\displaystyle I_{o}}\n  \n(the incident stellar flux on the planet) is not a readily measurable quantity. To find the equilibrium temperature of such a planet, it may be useful to approximate the host star's radiation as a blackbody as well, such that:\n\n  \n    \n      \n        \n          F\n          \n            \n              s\n              t\n              a\n              r\n            \n          \n        \n        =\n        σ\n        \n          T\n          \n            \n              s\n              t\n              a\n              r\n            \n          \n          \n            4\n          \n        \n      \n    \n    {\\displaystyle F_{\\rm {star}}=\\sigma T_{\\rm {star}}^{4}}\n  \n\nThe luminosity (\n  \n    \n      \n        L\n      \n    \n    {\\displaystyle L}\n  \n) of the star, which can be measured from observations of the star's apparent brightness, can then be written as:\n\n  \n    \n      \n        L\n        =\n        4\n        π\n        \n          R\n          \n            \n              s\n              t\n              a\n              r\n            \n          \n          \n            2\n          \n        \n        σ\n        \n          T\n          \n            \n              s\n              t\n              a\n              r\n            \n          \n          \n            4\n          \n        \n      \n    \n    {\\displaystyle L=4\\pi R_{\\rm {star}}^{2}\\sigma T_{\\rm {star}}^{4}}\n  \n where the flux has been multiplied by the surface area of the star.\nTo find the incident stellar flux on the planet, \n  \n    \n      \n        \n          I\n          \n            x\n          \n        \n      \n    \n    {\\displaystyle I_{x}}\n  \n, at some orbital distance from the star, \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n, one can divide by the surface area of a sphere with radius \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n:\n\n  \n    \n      \n        \n          I\n          \n            x\n          \n        \n        =\n        \n          (\n          \n            \n              L\n              \n                4\n                π\n                \n                  a\n                  \n                    2\n                  \n                \n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle I_{x}=\\left({\\frac {L}{4\\pi a^{2}}}\\right)}\n  \n\nPlugging this into the general equation for planetary equilibrium temperature gives:\n\n  \n    \n      \n        \n          \n            T\n          \n          \n            \n              e\n              q\n            \n          \n        \n        =\n        \n          \n            \n              (\n              \n                \n                  \n                    L\n                    \n                      (\n                      \n                        1\n                        −\n                        \n                          A\n                          \n                            B\n                          \n                        \n                      \n                      )\n                    \n                  \n                  \n                    16\n                    σ\n                    π\n                    \n                      a\n                      \n                        2\n                      \n                    \n                  \n                \n              \n              )\n            \n          \n          \n            1\n            \n              /\n            \n            4\n          \n        \n      \n    \n    {\\displaystyle {T}_{\\rm {eq}}={\\left({\\frac {L\\left(1-A_{B}\\right)}{16\\sigma \\pi a^{2}}}\\right)}^{1/4}}\n  \n\nIf the luminosity of the star is known from photometric observations, the other remaining variables that must be determined are the Bond albedo and orbital distance of the planet. Bond albedos of exoplanets can be constrained by flux measurements of transiting exoplanets, and may in future be obtainable from direct imaging of exoplanets and a conversion from geometric albedo. Orbital properties of the planet such as the orbital distance can be measured through radial velocity and transit period measurements.\nAlternatively, the planetary equilibrium may be written in terms of the temperature and radius of the star:\n\n  \n    \n      \n        \n          \n            T\n          \n          \n            \n              e\n              q\n            \n          \n        \n        =\n        \n          T\n          \n            \n              s\n              t\n              a\n              r\n            \n          \n        \n        \n          \n            \n              R\n              \n                2\n                a\n              \n            \n          \n        \n        \n          \n            (\n            \n              1\n              −\n              \n                A\n                \n                  B\n                \n              \n            \n            )\n          \n          \n            1\n            \n              /\n            \n            4\n          \n        \n      \n    \n    {\\displaystyle {T}_{\\rm {eq}}=T_{\\rm {star}}{\\sqrt {\\frac {R}{2a}}}\\left(1-A_{B}\\right)^{1/4}}\n  \n\n\n== Caveats ==\nThe equilibrium temperature is neither an upper nor lower bound on actual temperatures on a planet. There are several reasons why measured temperatures deviate from predicted equilibrium temperatures.\n\n\n=== Greenhouse effect ===\nIn the greenhouse effect, long wave radiation emitted by a planet is absorbed by certain gases in the atmosphere, reducing longwave emissions to space. Planets with substantial greenhouse atmospheres emit more longwave radiation at the surface than what reaches space. Consequently, such planets have surface temperatures higher than their effective radiation emission temperature. For example, Venus has an effective temperature of approximately 226 K (−47 °C; −53 °F), but a surface temperature of 740 K (467 °C; 872 °F). Similarly, Earth has an effective temperature of 255 K (−18 °C; −1 °F), but a surface temperature of about 288 K (15 °C; 59 °F) due to the greenhouse effect in our lower atmosphere. The surface temperatures of such planets are more accurately estimated by modeling thermal radiation transport through the atmosphere.\n\n\n=== Airless bodies ===\nOn airless bodies, the lack of any significant greenhouse effect allows equilibrium temperatures to approach mean surface temperatures, as on Mars, where the equilibrium temperature is 210 K (−63 °C; −82 °F) and the mean surface temperature of emission is 215 K (−58 °C; −73 °F). There are large variations in surface temperature over space and time on airless or near-airless bodies like Mars, which has daily surface temperature variations of 50–60 K. Because of a relative lack of air to transport or retain heat, significant variations in temperature develop. Assuming the planet radiates as a blackbody (i.e. according to the Stefan-Boltzmann law), temperature variations propagate into emission variations, this time to the power of 4. This is significant because our understanding of planetary temperatures comes not from direct measurement of the temperatures, but from measurements of the fluxes. Consequently, in order to derive a meaningful mean surface temperature on an airless body (to compare with an equilibrium temperature), a global average surface emission flux is considered, and then an 'effective temperature of emission' that would produce such a flux is calculated. The same process would be necessary when considering the surface temperature of the Moon, which has an equilibrium temperature of 271 K (−2 °C; 28 °F), but can have temperatures of 373 K (100 °C; 212 °F) in the daytime and 100 K (−173 °C; −280 °F) at night. Again, these temperature variations result from poor heat transport and retention in the absence of an atmosphere.\n\n\n=== Internal energy fluxes ===\nOrbiting bodies can also be heated by tidal heating, geothermal energy which is driven by radioactive decay in the core of the planet, or accretional heating. These internal processes will cause the effective temperature (a blackbody temperature that produces the observed radiation from a planet) to be warmer than the equilibrium temperature (the blackbody temperature that one would expect from solar heating alone).\nFor example, on Saturn, the effective temperature is approximately 95 K, compared to an equilibrium temperature of about 63 K. This corresponds to a ratio between power emitted and solar power received of ~2.4, indicating a significant internal energy source. Jupiter and Neptune have ratios of power emitted to solar power received of 2.5 and 2.7, respectively.\nClose correlation between the effective temperature and equilibrium temperature of Uranus can be taken as evidence that processes producing an internal flux are negligible on Uranus compared to the other giant planets.\nEarth has insufficient geothermal heating to significantly affect its global temperature, with geothermal heating supplying only 0.03% of Earth's total energy budget.\n\n\n== See also ==\nEarth's energy budget\nEffective temperature\nThermal equilibrium\n\n\n== References ==\n\n\n== Sources ==\nFressin F, Torres G, Rowe JF, Charbonneau D, Rogers LA, Ballard S, Batalha NM, Borucki WJ, Bryson ST, Buchhave LA, Ciardi DR, Désert JM, Dressing CD, Fabrycky DC, Ford EB, Gautier TN 3rd, Henze CE, Holman MJ, Howard A, Howell SB, Jenkins JM, Koch DG, Latham DW, Lissauer JJ, Marcy GW, Quinn SN, Ragozzine D, Sasselov DD, Seager S, Barclay T, Mullally F, Seader SE, Still M, Twicken JD, Thompson SE, Uddin K (2012). \"Two Earth-sized planets orbiting Kepler-20\". Nature. 482 (7384): 195–198. arXiv:1112.4550. Bibcode:2012Natur.482..195F. doi:10.1038/nature10780. PMID 22186831. S2CID 3182266.\nWallace, J.M.; Hobbs, P.V. (2006). Atmospheric Science. An Introductory Survey (2nd ed.). Amsterdam: Elsevier. ISBN 978-0-12-732951-2.",
  "source_url": "https://en.wikipedia.org/wiki/Planetary_equilibrium_temperature",
  "fetched_at": "2025-12-06T07:04:40.475339",
  "page_id": "37657202"
}