{
  "title": "Populous Holdings",
  "text": "Populous Holdings, Inc. (doing business as Populous) is a global firm specializing in the design of sports stadiums and training centres, entertainment arenas, conference and exhibitions centres and aviation and esports facilities, as well as the planning and design of major special events.\nThe firm operates across multiple continents with significant presence in the Americas, Europe, Middle East and Africa (EMEA), and Asia-Pacific (APAC) regions, maintaining regional headquarters in London, Kansas City, Brisbane, and offices in multiple other international locations. \nPopulous has designed more than 3500 projects across the globe, worth over $60 billion across emerging and established markets. Projects of note include Yankee Stadium in New York; the 2012 London Summer Olympic Games main stadium; Tottenham Hotspur Stadium, London; Nanjing Sports Park in China; Sphere in Las Vegas; International Convention Centre Sydney; the new Buffalo Bills football stadium and event planning for the Super Bowl and Major League Baseball All Star Game. \nPopulous was created through a management buyout in January 2009, becoming independently owned and operated. It is reported to be one of the largest architecture firms in the world, with over 1500 staff and 32 offices. Populous formerly operated as HOK Sport, which was part of HOK Group Inc.\n\n\n== History ==\n\n\n=== Company development ===\nIn 1983, HOK under Jerry Sincoff created a sports group (initially called the Sports Facilities Group and later changed to HOK Sport Venue Event). The firm initially consisted of eight architects in Kansas City, and grew to employ 185 people by 1996. The HOK Sport studio was led by architect Ron Labinski, who has been described as \"the world's first sports venue architect.\"\nOn several projects, HOK Sport had teamed with international design practice LOBB Partnership, which maintained offices in London, England, and Brisbane, Australia. On HOK Sport's 15th anniversary in November 1998, the firm merged with LOBB. The new practice retained headquarters in all three cities.\nThe Kansas City, Missouri, office was first based in the city's Garment District in the Lucas Place office building. In 2005, it moved into its headquarters at 300 Wyandotte in the River Market neighborhood in a new building it designed, on land developed as an urban renewal project through tax incentives from the city's Planned Industrial Expansion Authority. It was the first major company to relocate to the neighborhood in several decades. \nIn March 2009, HOK Sport Venue Event changed its name to Populous after a management buyout from HOK Group.\nPopulous completed the design and oversaw the construction of the 2012 Olympic Stadium in London. \nIn October 2015, Populous relocated to its new Americas headquarters at the newly renovated Board of Trade building at 4800 Main street near the Country Club Plaza in Kansas City. In August 2024, the Kansas City Business Journal reported that Populous was moving its Americas headquarters back downtown into the new 1400KC building in the Power and Light District.\nThe company is one of several Kansas City-based sports design firms that trace their roots to Kivett and Myers which designed the Truman Sports Complex which was one of the first modern large single purpose sports stadiums (previously, stadiums were designed for multipurpose use). Other firms with sports design presence in Kansas City that trace their roots to Kivett include Ellerbe Becket Inc. and HNTB Corp. 360 Architecture is also based in Kansas City.\nIn 2019, the Populous-designed Tottenham Hotspur Stadium opened in London, featuring a retractable pitch to accommodate both football and NGL games. \nIn 2022, Populous was named Fast Company's Most Innovative Company in Architecture, largely due to its work on Climate Pledge Arena in Seattle. \nThe firm also worked with Foster + Partners; firstly on the redesign of Wembley Stadium in 2007, then (with Arup as the Stadium engineers), as the designated sports architect responsible for the design of the seating bowl and associated facilities at Lusail Stadium, the largest venue for the 2022 FIFA World Cup. \nIn September 2023, the Las Vegas Sphere designed by Populous officially opened with a residency by U2. It is the most expensive entertainment venue built in the Las Vegas Valley and the world's largest spherical structure. \nIn 2023 Populous announced a strategic minority investment from Providence Equity Partners. \nIn 2025, Populous acquired Fentress Architects, a global design firm specialising in aviation, civil and cultural projects. \nPopulous has a significant design presence in the Kingdom of Saudi Arabia and the Middle East. 11 of the 14 stadiums in the Saudi 2034 World Cup bid are either designed or redeveloped by the practice. \n\n\n=== \"Retro\" era of baseball parks ===\n\nPopulous is credited for spearheading a new era of baseball park design in the 1990s, beginning with Oriole Park at Camden Yards in Baltimore. At Camden Yards, and in other stadiums built by Populous soon thereafter, such as Coors Field in Denver and Progressive Field in Cleveland, the ballpark was designed to incorporate aesthetic elements of the city's history and older \"classic ballparks.\" Camden Yards's red brick facade emulates the massive Baltimore & Ohio Warehouse at Camden Yards that dominates the right field view behind Eutaw Street, whereas Progressive Field's glass and steel exterior \"call[s] to mind the drawbridges and train trestles that crisscross the nearby Cuyahoga River.\" Starting with Great American Ball Park in Cincinnati in 2003, a number of Populous Sport's stadiums featured more contemporary and even futuristic designs. Subsequent stadium exteriors featuring this motif opened in Washington, D.C., and Minnesota.\nIn addition to moving away from the concrete exteriors of the \"cookie-cutter\" multi-purpose stadiums that preceded the new parks, Populous incorporated other innovative touches: natural grass playing surfaces (instead of artificial turf), asymmetrical field dimensions, various park-specific idiosyncrasies (like Tal's Hill in Houston), and less foul territory that would keep fans farther from the diamond. And because the stadiums were designed for baseball instead of several sports, the sightlines were \"uniformly excellent.\"\nCamden Yards was hugely popular with baseball fans, and its success convinced many cities to invest public funds in their own new ballparks to help revitalize struggling urban neighborhoods. From 1992 to 2012, HOK Sport/Populous were the lead architects on 14 Major League Baseball stadiums and helped renovate four existing stadiums.\n\n\n== Criticism ==\nPopulous's designs across Major League Baseball have become so prevalent that some critics have asserted that the distinctiveness that was originally found in early retro-classic ballparks is impossible to maintain. Some older ballparks like Fenway Park have strange dimensions because of the small parcels of land on which the parks were built. Most new stadiums are built on larger, dedicated land parcels. One sportswriter said the attempt to emulate the old parks' quirks is \"contrived.\"\nSome commentators have criticized a tendency to cater new ballparks toward wealthier ticket buyers, such as with expanded numbers of luxury suites. Several writers have noted that upper deck seating at new ballparks may actually be farther away from the field than in the older parks, partly as a result of these new upper decks being pushed higher by rows of luxury suites. One writer in The New Yorker said it is \"not quite right to credit or blame Populous\" for trends in their new stadiums—as it is ultimately team owners that plan what they want in future stadiums—but that the firm \"certainly enabled\" such changes.\n\n\n== Venues ==\n\n\n=== Stadiums ===\nEmirates Stadium – London, England (2006)\nWembley Stadium – London, England (2007)\nYankee Stadium - New York, USA (2009)\nLondon Stadium – London, England (2011)\nStadium MK – Milton Keynes, England (2015)\nGroupama Stadium and Training Centre - Lyon, France (2016)\nMercedes-Benz Stadium - Atlanta, USA (2017)\nTottenham Hotspur Stadium – London, England (2019)\nNarendra Modi Stadium - Ahmedabad, India (2020)\nNassau County International Cricket Stadium - New York, USA (2024)\nKai Tak Sports Park - Hong Kong (2025)\nPrince Moulay Abdellah Stadium - Rabat, Morocco (2025)\nNew Highmark Stadium – Orchard Park, New York, U.S. (2026)\nNS Square – Singapore (2027)\nShah Alam Sports Complex - Shah Alam, Selangor, Malaysia (2030)\n\n\n=== Indoor Arenas ===\nPhilippine Arena – Ciudad de Victoria, Philippines (2014)\nAddition Financial Arena – Orlando, Florida, U.S. (2007)\nUBS Arena – Elmont, New York, U.S. (2021)\n\n\n=== Convention and civic centres ===\nUniversity of Houston Athletics and Alumni Center – Houston, Texas, U.S.  (1995)\nGrand River Event Center – Dubuque, Iowa, U.S. (2003)\nIowa Events Center – Des Moines, Iowa, U.S. (2005)\nPeoria Civic Center - Peoria, Illinois, U.S. (2008)\nPhoenix Convention Center – Phoenix, Arizona, U.S. (2008)\nUtah Valley Convention Center - Provo, Utah, U.S.  (2010)\nQatar National Convention Centre, Doha, Qatar (2011)\nSan Jose McEnery Convention Center expansion, San Jose, U.S. (2014)\nICC Sydney, Sydney, Australia (2016)\nHenry B. Gonzales Convention Center, San Antonio, U.S. (2017)\nWorld Trade Center Bhubaneswar – Bhubaneswar, Odisha, India (2017)\nAnaheim Convention Center – Anaheim, California, U.S. (2017)\n\n\n=== Music and entertainment venues ===\nMSG Sphere Las Vegas – Las Vegas, Nevada, U.S. (2023)\nCo-op Live – Manchester, England (2024)\n\n\n=== Race track ===\nMount Panorama - Bathurst, New South Wales, Australia (1938)\nSilverstone Circuit - Silverstone, England (2011)\nMandalika International Street Circuit – Central Lombok Regency, Indonesia (2021)\n\n\n== References ==\n\n\n== External links ==\nOfficial website",
  "source_url": "https://en.wikipedia.org/wiki/Populous_Holdings",
  "fetched_at": "2025-12-06T07:26:11.487346",
  "page_id": "1474806"
}