{
  "title": "Songwriter",
  "text": "A songwriter is a person who creates musical compositions or writes lyrics for songs, or both. The writer of the music for a song can be called a composer, although this term tends to be used mainly in the classical music genre and film scoring. A songwriter who mainly writes the lyrics for a song is referred to as a lyricist. Pressure from the music industry to produce popular hits means that songwriting is often a collaborative process with tasks shared among multiple people. For example, a songwriter who excels at writing lyrics might be paired with a songwriter with the task of creating original melodies. Pop songs may be composed by group members from the band or by staff writers – songwriters directly employed by music publishers. Some songwriters serve as their own music publishers, while others have external publishers.\nThe old-style apprenticeship approach to learning how to write songs is being supplemented by university degrees, college diplomas and \"rock schools\". Knowledge of modern music technology (sequencers, synthesizers, computer sound editing), songwriting elements and business skills are significant for modern songwriters. Several music colleges offer songwriting diplomas and degrees with music business modules. Since songwriting and publishing royalties can be substantial sources of income, particularly if a song becomes a hit record; legally, in the US, songs written after 1934 may be copied only by the authors. The legal power to grant these permissions may be bought, sold or transferred. This is governed by international copyright law.\nSongwriters can be employed in a variety of different ways. They may exclusively write lyrics or compose music alongside another artist, present songs to A&R, publishers, agents and managers for consideration. Song pitching can be done on a songwriter's behalf by their publisher or independently using tip sheets like RowFax, the MusicRow publication and SongQuarters. Skills associated with song-writing include entrepreneurism and creativity. Staff writers do not necessarily get printed credit for their contributions to the song.\n\n\n== Staff writers ==\nSongwriters who sign an exclusive songwriting agreement with a publisher are called staff writers. Being a staff writer effectively means that, during the term of the songwriter's contract with the publisher, all their songs are automatically published by that company and cannot be published elsewhere.\nIn the Nashville country music scene, there is a strong staff writer culture where contracted writers work normal \"9-to-5\" hours at the publishing office and are paid a regular salary, says staff writer Gary Growden. This salary is in effect the writer's \"draw\", an advance on future earnings, which is paid monthly and enables them to live within a fixed budget. The publisher owns the copyright of songs written during the term of the agreement for a designated period, after which the songwriter can reclaim the copyright. In an interview with HitQuarters, songwriter Dave Berg extolled the benefits of the set-up: \"I was able to concentrate on writing the whole time and have always had enough money to live on.\"\nUnlike contracted writers, some staff writers operate as employees for their respective publishers. Under the terms of these\nwork for hire agreements, the compositions created are fully owned by the publisher. Because the recapture provision of the United States Copyright Act of 1976 does not apply to \"works made for hire\", the rights to a song created under an employment contract cannot be \"recaptured\" by the writer after 35 years. In Nashville, young writers are often strongly encouraged to avoid these types of contracts.\nStaff writers are common across the whole industry, but without the more office-like working arrangements favoured in Nashville. All the major publishers employ writers under contract. Obtaining a staff writer contract with a publisher can be the first step for any professional songwriting career, with some writers with a desire for greater independence outgrowing this set-up once they achieve a degree of success. Songwriter Allan Eshuijs described his staff writer contract at Universal Music Publishing as a starter deal. His success under the arrangement eventually allowed him to found his own publishing company so that he could \"keep as much [publishing income] as possible and say how it's going to be done.\"\n\n\n== Specific roles ==\n\n\n=== Beatmaker ===\n\nA beatmaker is a songwriter who creates and composes music or beats for a song, often laying the groundwork or \"musical bed\". Tools typically used are synthesizers, drum machines, and digital audio workstations. Beat makers or composers are not necessarily record producers by definition since they generally do not work directly with artists in a recording studio that oversees the production and recording of the final product.\nHowever, record producers can be involved in co-writing songs as the composer wearing two hats as the producer and songwriter as they may write and compose the original music such as the beat and then oversee the production that takes control of the recording sessions with the artist and engineer all the way down to the mix stage. They are referred to as Record Producer / Songwriters as they generally receive songwriting and production credits for both roles. This is especially true for R&B, hip-hop producers in urban hip hop production, when composing the original music as the co-writer is integrated into their traditional role as a Record Producer, such as Rodney Jerkins, Dr. Dre, Timbaland or Pharrell Williams, as opposed to a rock producer that may rarely contribute as a co-writer of a song.\n\n\n=== Top-liners ===\nA top-line writer or top-liner is a songwriter who writes a song over a pre-made beat. In top-lining, the writer is not creating a song from scratch, but rather creating lyrics and melodies over an existing music genre, tonality, harmony, rhythm, and form of a song.\nIn modern commercial writing, it is a common practice for the musical track to be produced first without any vocal melody or lyrics. This is partially due to the rise of portable music production equipment and digital audio workstations that are designed for the swift arrangement of electronic music, such as Cubase and Ableton Live.\nThe top-liner usually is also a singer, and will sing over the track as the demo singer. If the song is for a particular artist, the top-liner may sing the demo in that artist's style. Top-liners often work in groups to co-write. Sometimes producers send out tracks to more than one top-line writer so that the producer or singer could choose the best option. Since the track is the same, melodies by different writers can sometimes be very similar. Occasionally, the producer might choose a few lines of melodic or lyrical ideas from one top-liner without properly crediting or paying them. These situations sometimes result in legal battles over ownership of the melodies or lyrics.\nThere is a way to prevent such legal battles. A songwriter can commit their \"intent to make a song\", which prevents any of the parties ripping the song apart. Some artists send out a legal disclaimer making clear that if their melody is not used after doing a topline, it reverts to them, and the track back to the track writer.\n\n\n== Multi-tasking songwriters ==\n\n\n=== As instrumentalists ===\nSongwriters are also often skilled musical instrument players. In part, this is because the process of \"working out\" a song or arrangement requires a songwriter to play an instrument, typically the guitar or the piano, to hear how the chord progression sounds and to hear how well a given set of chords supports a melody. In addition to selling their songs and musical concepts for other artists to sing, some songwriter-musicians create songs to perform themselves. Songwriters need to create a number of elements for a song, including an introduction, various verses and a chorus. At minimum, a songwriter must prepare a lead sheet for a song, which consists of one or more pieces of sheet music with the melody notes and chord progression indicated on it.\nThe songwriter may expand upon the melody and chord progression by adding an instrumental melody (which may occur before or after the vocal melody, or alongside the vocal melody) and creating a more complex song structure (e.g., verse, chorus, bridge, instrumental solo section, etc.).\n\n\n=== As producers ===\nWith recent technological improvements, a songwriter can now create commercially viable music almost entirely on their laptop. This technological advancement has made the producer/songwriter role a much more popular occurrence. Perhaps because the role of producer is not generally understood by the public, the average listener does not know when an artist also takes on the role of producer.\nBrian Wilson of the Beach Boys is one of the earliest and most widely known examples of a songwriter turned music producer. Within two years of the band's commercial breakthrough, Wilson had taken over from his father Murry, and he was the sole producer of all their recordings between 1963 and 1967.\n\n\n=== As singers ===\n\nMany singers also write songs for themselves, and as such, they are usually referred to as singer-songwriters.\n\n\n== Sole writing ==\n\nIn solitary songwriting or sole writing, only one person is responsible in creating the entire music and lyrics of a song. According to Billboard, 44% of the songs that reached number one on the Billboard Hot 100 chart during the 1970s were written by just one songwriter. The percentage declined to 42% in the 1980s, 24% in the 1990s, 6% in the 2000s, and 4% in the 2010s.\nLionel Richie and Diane Warren are the only songwriters with at least 8 number-one singles written solely by themselves. A very few artists solely wrote, produced, and performed a Hot 100 number-one song such as Prince (\"When Doves Cry\"), Debbie Gibson (\"Foolish Beat\" and \"Lost in Your Eyes\"), Lauryn Hill (\"Doo Wop (That Thing)\"), Alicia Keys (\"Fallin'\"), and Pharrell Williams (\"Happy\").\n\n\n== Co-writing ==\nSongs can be written jointly or written in collaboration with other songwriters. Co-writers may use the \"stream of consciousness\" approach, referring to having ideas flow rather than being discussed. The first step in co-writing is to establish the division of the contribution between co-writers. In copyright law, there is no distinction of importance between the lyrics of the song or the melody of the song, therefore each writer is given equal ownership over the song, unless another agreement is arranged. \"Phantom\" songwriters provide small contributions to songs. Examples of this would be a songwriter suggesting a line for a verse or a session musician informally proposing a chord progression for a coda. \"Phantom\" songwriters are usually not given credit.\n\n\n=== Songwriting partnership ===\n\nSongwriting partnership or songwriting duo is a prolific collaboration which consists of two songwriters, usually sharing 50% royalty each. Songwriting partnership can be between a composer and a lyricist (Andrew Lloyd Webber with Tim Rice, or Elton John with Bernie Taupin), a performer and a producer (Madonna with Patrick Leonard or Mariah Carey with Walter Afanasieff), or between bandmates (Mick Jagger and Keith Richards of the Rolling Stones or Björn Ulvaeus and Benny Andersson of ABBA).\nAccording to Billboard, the songwriting partnership between John Lennon and Paul McCartney remains the most successful one of all time, resulting over 180 songs and a record 20 number ones for the Beatles on the Billboard Hot 100. Songwriting partnership between siblings Billie Eilish and Finneas O'Connell have generated multiple wins at the Academy Awards for Best Original Song as well as the Grammy Awards for Song of the Year and Record of the Year.\n\n\n=== Songwriting camp ===\nSongwriting camp is a gathering of multiple producers and topliners in a pre-selected location for the purpose of writing songs for a specific artist. As one of the most successful artists in releasing many hit songs, Rihanna has been known for holding various writing camps to make her albums. Writing camps are also very popular in the K-pop music industry.\n\n\n=== Sampling ===\n\nSampling is the reuse of a portion (or sample) of a sound recording in another recording. The original songwriter(s) of a song usually receive co-writing credit when their work is sampled on another song, although they did not literally involve in making the latter. For example, Sting is credited as a co-writer alongside Todd Gaither and Faith Evans for \"I'll Be Missing You\" (1997) due to the sample of \"Every Breath You Take\" (1983), a song he solely wrote for the Police. However, \"I'll Be Missing You\" did not have legal approval for the sample before its release, thus Sting sued and received 100% of the song royalties, with payments reportedly going until 2053. Beyoncé's album Lemonade (2016) features as many as 72 co-writers due to use of samples in majority of its tracks.\n\n\n== See also ==\nRolling Stone's 100 Greatest Songwriters of All Time\nList of Songwriters Hall of Fame inductees\nGrammy Award for Songwriter of the Year, Non-Classical\n\n\n== References ==",
  "source_url": "https://en.wikipedia.org/wiki/songwriter",
  "fetched_at": "2025-12-06T07:26:09.589218",
  "page_id": "94154"
}