{
  "title": "Song",
  "text": "A song is a musical composition performed by the human voice. The voice often carries the melody (a series of distinct and fixed pitches) using patterns of sound and silence. Songs have a structure, such as the common ABA form, and are usually made of sections that are repeated or performed with variation later. A song without instruments is said to be a cappella.\nWritten words created specifically for music, or for which music is specifically created, are called lyrics. If a pre-existing poem is set to composed music in the classical tradition, it is called an art song. Songs that are sung on repeated pitches without distinct contours and patterns that rise and fall are called chants. Songs composed in a simple style that are learned informally by ear are often referred to as folk songs. Songs composed for the mass market, designed to be sung by professional singers who sell their recordings or live shows, are called popular songs. These songs, which have broad appeal, are often composed by professional songwriters, composers, and lyricists; art songs are composed by trained classical composers for concert or recital performances. Songs are performed in studios and an audio recording is made, or they are performed live for audience. (In some cases a song may be performed live and simultaneously recorded.) Songs may also appear in theatre (e.g., opera), films and TV shows.\nA song may be for a solo singer, a lead singer supported by background singers, a duet, trio, or larger ensemble involving more voices singing in harmony, although the term is generally not used for large classical music vocal forms including opera and oratorio, which use terms such as aria and recitative instead. A song can be sung without accompaniment by instrumentalists (a cappella) or accompanied by instruments. In popular music, a singer may perform with an acoustic guitarist, pianist, organist, accordionist, or a backing band. In jazz, a singer may perform with a single pianist, a small combo (such as a trio or quartet), or with a big band. A Classical singer may perform with a single pianist, a small ensemble, or an orchestra. In jazz and blues, singers often learn songs by ear and they may improvise some melody lines. In Classical music, melodies are written by composers in sheet music format, so singers learn to read music.\nSongs with more than one voice to a part singing in polyphony or harmony are considered choral works. Songs can be broadly divided into many different forms and types, depending on the criteria used. Through semantic widening, a broader sense of the word \"song\" may refer to instrumentals, such as the 19th century Songs Without Words pieces for solo piano.\n\n\n== Genres ==\n\n\n=== Art ===\n\nArt songs are songs created for performance by classical artists, often with piano or other instrumental accompaniment, although they can be sung solo. Art songs require strong vocal technique, an understanding of language, diction, and poetry for interpretation. Though such singers may also perform popular or folk songs on their programs, these characteristics and the use of poetry are what distinguish art songs from popular songs. Art songs are a tradition from most European countries, and now other countries with classical music traditions. German-speaking communities use the term art song (\"Kunstlied\") to distinguish so-called serious compositions from folk songs (Volkslied). The lyrics are often written by a poet or lyricist and the music separately by a composer. Art songs may be more formally complicated than popular or folk songs, though many early Lieder by the likes of Franz Schubert are in simple strophic form. The accompaniment of European art songs is considered as an important part of the composition. Some art songs are so revered that they take on characteristics of national identification.\nArt songs emerge from the tradition of singing romantic love songs, often to an ideal or imaginary person and from religious songs. The troubadours and bards of Europe began the documented tradition of romantic songs, continued by the Elizabethan lutenists. Some of the earliest art songs are found in the music of Henry Purcell. The tradition of the romance, a love song with a flowing accompaniment, often in triple meter, entered opera in the 19th century and spread from there throughout Europe. It expanded into popular music and became one of the underpinnings of popular songs. While a romance generally has a simple accompaniment, art songs tend to have complicated, sophisticated accompaniments that underpin, embellish, illustrate or provide contrast to the voice. Sometimes the accompaniment performer has the melody, while the voice sings a more dramatic part.\n\n\n=== Folk ===\n\nFolk songs are songs of often anonymous origin (or are public domain) that are transmitted orally. They are frequently a major aspect of national or cultural identity. Art songs often approach the status of folk songs when people forget who the author was. Folk songs are also frequently transmitted non-orally (that is, as sheet music), especially in the modern era. Folk songs exist in almost every culture. The German term Volkslied was coined in the late 18th century, in the process of collecting older songs and writing new ones. Popular songs may eventually become folk songs by the same process of detachment from their source. Folk songs are more or less in the public domain by definition, though there are many folk song entertainers who publish and record copyrighted original material. This tradition led also to the singer-songwriter style of performing, where an artist has written confessional poetry or personal statements and sings them set to music, most often with guitar accompaniment.\nThere are many genres of popular songs, including torch songs, ballads, novelty songs, anthems, rock, blues and soul songs as well as indie music. Other commercial genres include rapping. Folk songs include ballads, lullabies, love songs, mourning songs, dance songs, work songs, ritual songs and many more.\n\n\n==== Sporting ====\nA sporting song is a folk song that celebrates fox hunting, horse racing, gambling and other recreations.\nAlthough songs about boxers and successful racehorses were common in the nineteenth century, few are performed by current singers. In particular, fox-hunting is considered politically incorrect. The most famous song about a foxhunter, \"D'ye ken John Peel\" was included in The National Song Book in 1906 and is now often heard as a marching tune. A. L. Lloyd recorded two EPs of sporting ballads; \"Bold Sportsmen All\" (1958) and \"Gamblers and Sporting Blades (Songs of the Ring and the Racecourse)\" (1962). The High Level Ranters and Martin Wyndham-Read recorded an album called \"English Sporting Ballads\" in 1977. The Prospect Before Us (1976) by The Albion Dance Band contains two rarely heard hunting songs.\n\n\n=== Lute ===\n\nThe term lute song is given to a music style from the late 16th century to early 17th century, late Renaissance to early Baroque, that was predominantly in England and France. Lute songs were generally in strophic form or verse repeating with a homophonic texture. The composition was written for a solo voice with an accompaniment, usually the lute. It was not uncommon for other forms of accompaniments such as bass viol or other string instruments, and could also be written for more voices. The composition could be performed either solo or with a small group of instruments.\n\n\n=== Part ===\n\nA part song, part-song or partsong is a form of choral music that consists of a secular (vs. ecclesiastical) song written or arranged for several vocal parts. Part songs are commonly sung by an SATB choir, but sometimes for an all-male or all-female ensemble.\n\n\n=== Patter ===\n\nThe patter song is characterized by a moderately fast to very fast tempo with a rapid succession of rhythmic patterns in which each syllable of text corresponds to one note. It is a staple of comic opera, especially Gilbert and Sullivan, but it has also been used in musicals and elsewhere.\n\n\n== See also ==\n\nAir (music)\nAnimal song\nBird vocalization\nWhale song\nZoomusicology\nCanticle\nCantus firmus\nHymn\nLists of songs\nMadrigal\nSung poetry\nTheme music\nVocal music\n\n\n== References ==\n\n\n== Further reading ==\nGosse, Edmund; Gadow, Hans Friedrich (1911). \"Song\" . Encyclopædia Britannica. Vol. 25 (11th ed.). pp. 400–414.\nMarcello Sorce Keller (1984), \"The Problem of Classification in Folksong Research: A Short History\", Folklore XCV, no. 1, 100–104.\nJean Nicolas De Surmont (2017), From Vocal Poetry to Song, Toward a Theory of Song Objects with a foreword by Geoff Stahl, Stuttgart, Ibidem.\nJean Nicolas De Surmont: From Vocal Poetry to Song. Towards a Theory of Song Objects. Tr. Anastasija Ropa, with a foreword by Geoff Stahl. Stuttgart: Ibidem, 2017. ISBN 978383821072-8. 175 pages.",
  "source_url": "https://en.wikipedia.org/wiki/Song",
  "fetched_at": "2025-12-06T07:26:07.165512",
  "page_id": "28830"
}