{
  "title": "Temperature in Canada",
  "text": "Climate in Canada varies widely from region to region. In many parts of the country, particularly in the interior and Prairie provinces, winters are long, very cold, and feature frequent snow. Most of Canada has a continental climate, which features a large annual range of temperatures, cold winters, and warm summers. Daily average temperatures are near −15 °C (5 °F), but can drop below −50 °C (−58 °F) with severe wind chills. In non-coastal regions, snow can cover the ground for almost six months of the year, while in parts of the north snow can persist year-round. Coastal British Columbia has a more temperate climate, with a mild and rainy, cloudy winter. The British Columbia Southern interior has a semi-desert climate in many locations, with long warm to hot, dry summers, and short moderate winters. The immediate area adjacent to the town of Ashcroft, features Canada's only true desert. On the east and west coasts, average summer high temperatures are generally in the low 20s °C, while between the coasts, the average summer high temperature ranges from 25 to 30 °C (77 to 86 °F), with temperatures in some interior locations occasionally exceeding 40 °C (104 °F).  \nMuch of Northern Canada is covered by ice and permafrost; however, the future of the permafrost is uncertain because the Arctic has been warming at three times the global average as a result of climate change in Canada. Canada's annual average temperature over land has warmed by 1.7 °C (3.1 °F), with changes ranging from 1.1 to 2.3 °C (2.0 to 4.1 °F) in various regions, since 1948. The rate of warming has been higher across the North and in the Prairies. In the southern regions of Canada, air pollution from both Canada and the United States—caused by metal smelting, burning coal to power utilities, and vehicle emissions—has resulted in acid rain, which has severely impacted waterways, forest growth and agricultural productivity in Canada.\n\n\n== Averages ==\nThe following tables show the average maximum and minimum temperatures of Canada of various cities across Canada, based on the climate period from 1981 to 2010 for the months of January and July (generally the lowest and highest average temperature months, but not in every case).\nThe two major Canadian cities that fall outside the continental climate schema are Vancouver and Victoria. Vancouver experiences an oceanic climate, bordering warm-summer mediterranean with a marked summer dry season. Victoria, BC is the only major Canadian city entirely in a warm-summer mediterranean climate. Of the eight largest Canadian cities, Ottawa, Montreal and Toronto have the warmest summers, Winnipeg the coldest winters, while Vancouver's winters are far milder than any other large city in Canada.\nIn mountainous regions such as British Columbia the variety of elevations creates micro-climates with average temperatures that can vary wildly within relatively small distances. A few small towns in southern BC outside of Vancouver, for example, have a humid continental climate (Dfb) with average winter temperatures and cold snaps comparable to other parts of the country.\nCentral Canada and northern Canada experiences subarctic and Arctic climates, much of them arid. Those areas are not heavily populated due to the severe climate, where it drops below −20 °C (−4 °F) on most winter days and has a very brief summer season.\nSome Mountain passes in southern BC also have a subarctic or subalpine climate, creating extremely dangerous driving conditions, as drivers may be unaware of wintry road conditions when they come from nearby areas like Vancouver and Kamloops  which is semi-desert, that are much warmer.\nThe table can be reordered by clicking on the box in each column. Places in italics are provincial capitals, bold is the national capital.\n\n\n=== Heat, cold and frost averages ===\n\n\n== Extremes ==\n\n\n=== Extreme highs ===\n\n\n=== Extreme lows ===\n\nHighest recorded June 29, 2021 49.6 °C (121.3 °F) Lytton, British Columbia.\nLowest recorded February 3, 1947 −63.0 °C (−81.4 °F) Snag, Yukon.\nThe table can be reordered by clicking on the box in each column. Places in italics are provincial capital, bold is the national capital.\n\n\n== Climate change ==\n\n\n== Maps ==\nWeather Stations locations in Canada.\n\n\n== Notes ==\n\n\n== See also ==\n\nList of extreme temperatures in Canada\nWeather extremes in Canada\nList of cities by average temperature\n\n\n== References ==\n\n\n== External links ==\nCurrent surface temperatures in Canada.",
  "source_url": "https://en.wikipedia.org/wiki/Temperature_in_Canada",
  "fetched_at": "2025-12-06T07:06:25.974174",
  "page_id": "13002617"
}