{
  "title": "Temperature-sensitive mutant",
  "text": "Temperature-sensitive mutations are variants of genes that allow the organism to function normally at low temperatures but alter its function at higher temperatures. Cold-sensitive mutants are variants of genes that allow normal function of the organism at higher temperatures but altered function at low temperatures.\n\n\n== Mechanism ==\nMost temperature-sensitive mutations affect proteins, and cause loss of protein function at the non-permissive temperature. The permissive temperature is one at which the protein typically can fold properly or remain properly folded. At higher temperatures, the protein is unstable and ceases to function properly. These mutations are usually recessive in diploid organisms. Temperature -sensitive mutations arrange a reversible mechanism and can reduce particular gene products at varying stages of growth, which is easily done by changing the temperature of growth.\n\n\n== Permissive temperature ==\nThe permissive temperature is the temperature at which a temperature-sensitive mutation gene product takes on a normal, functional phenotype. When a temperature-sensitive mutant is grown in a permissive condition, the mutant gene product behaves normally (meaning that the phenotype is not observed), even if there is a mutant allele present. This results in the survival of the cell or organism,as if it were a wild type strain. In contrast, the nonpermissive temperature or restrictive temperature is the temperature at which the mutant phenotype is observed.\nTemperature-sensitive mutations are usually missense mutations, which slightly modify the energy landscape of the protein folding. The mutant protein will function at the standard, permissive, low temperature. It will alternatively lack the function at a rather high, non-permissive temperature and display a hypomorphic (partial loss of gene function) at a middle, semi-permissive temperature.\n\n\n== Developmental Effects ==\nTemperature-sensitive mutations can significantly impact an organism's development by altering gene function at specific temperatures. These mutations affect proteins that may function normally at a lower, \"permissive\" temperature but become dysfunctional or degrade at a higher, \"restrictive\" temperature. This characteristic allows researchers to study gene function by controlling temperature conditions.\nOne example is a mutation in the virilizer (vir) gene in Drosophila melanogaster, which prevents the proper development of female traits at elevated temperatures. This demonstrates the crucial role temperature-sensitive mutations play in regulating developmental pathways.\nTemperature-sensitive mutations have also been observed in human diseases. For instance, in spinal muscular atrophy (SMA), mutations affecting the Survival of Motor Neuron (SMN) protein can render it unstable at higher temperatures, leading to impaired nerve function.\nResearchers have developed methods to introduce temperature-sensitive mutations artificially. One approach utilizes intein-mediated protein splicing, where protein segments remove themselves under specific temperature conditions. A study by Tan et al. (2009) demonstrated how engineered inteins can regulate protein function by allowing the intein to splice at lower temperatures while remaining intact at higher temperatures, thereby disrupting protein activity.\nBy leveraging temperature-sensitive mutations, scientists can study the functional roles of genes and proteins in both normal development and disease processes.\n\n\n== Ecological Effects ==\nAt a base level, all organisms respond to their environment. Specifically, the temperature in an organism's environment can greatly impact many different aspects of its life. Understanding how temperature affects different species is difficult to study due to the fact that each one reacts differently to temperatures. Some may be more susceptible to higher temperatures due to not having the correct machinery to deal with it. Additionally, it is difficult to predict how a species would respond due to the fact that the fitness of the organism is closely intertwined with others inside of a single ecosystem [14]. \n\n\n== Evolutionary Effects ==\nTemperature is an environmental factor that influences the evolution of organisms by shaping their genetic variation, physiological traits, adaptations, and survivability. As global temperatures increase due to climate change, species have to adapt to these changes through mutations that affect protein function, such as temperature sensitive mutations. Specifically, higher temperatures can increase mutation rates, alter the stability of proteins, and influence natural selection. These factors can lead to evolutionary changes in populations over time. However, when adapting to these higher temperatures, organisms often experience trade-offs, which are compromises where gaining an advantage in one trait leads to a disadvantage in another.\nHigher temperatures can directly influence mutation rates by increasing the rate of spontaneous mutations leading to more errors during DNA replication or increased exposure to mutagens. Studies have shown that these effects are potentially due to enhanced metabolic rates. More specifically, a study involving Daphnia pulex found that spontaneous mutations had varied fitness effects under different thermal conditions, which suggests that temperature plays a role in shaping mutational impacts. In addition, this heightened mutation rate provides a broader range of genetic diversity for natural selection to act upon, allowing populations to adapt more rapidly. However, too many mutations can result in higher rates of genetic disorders or maladaptive traits which reduce the overall fitness.\nSince proteins rely on precise folding to function correctly, higher temperatures can destabilize their structure, leading to loss of function. This instability creates challenges for evolution, as living organisms have to find a way to maintain protein function while dealing with temperature changes. As a result, organisms evolving in hotter environments may develop compensatory mutations that enhance protein stability or adopt proteins that assist in proper folding. However, studies have shown that these mutations, which could help restore the function of destabilized proteins, are rare, emphasizing how crucial it is to keep proteins stable. One study by researchers demonstrated how genome-wide CRISPR screens using temperature-sensitive mutations can map critical pathways involved in protein homeostasis and disease regulation. These evolutionary shifts ensure that essential cellular functions remain unharmed despite thermal conditions.\nPopulations exposed to persistent high temperatures face selective pressures that favor individuals with heat-resistant traits, leading to the spread of beneficial alleles related to thermal tolerance—such as changes in membrane lipids, heat shock proteins, and thermostable enzymes. As global temperatures rise, organisms with temperature-sensitive mutations may experience shifting fitness landscapes, where previously neutral or deleterious mutations become advantageous. This dynamic drives natural selection and rapid adaptation, as seen in experimental evolution studies showing changes in mutation rates and variations in response to elevated temperatures.\nAdaptation to higher temperatures is not without costs. Proteins optimized for stability at higher temperatures may show reduced flexibility or functionality at lower temperatures, leading to trade-offs in the performance of organisms across different environments. Another possible trade-off would be the energy required to maintain protein stability can take away resources from other vital processes, such as reproduction and growth. These trade-offs can shape evolutionary trajectories, as organisms must balance between thermal tolerance and overall fitness.\n\n\n== The Results of Climate Change ==\nClimate change is a huge topic in today's science world. Scientists have been asking many questions about how climate change will affect different ecosystems, organisms, and the human race. This question also arises from the standpoint of temperature-sensitive mutations. \nAs mentioned before, certain species' characteristics or behaviors rely on temperature. With the global climate becoming warmer, the question is what will happen with organisms that are sensitive to temperature change, and it affects their characteristics or ability to obtain nutrients. Though climate change is not necessarily a good thing, some research has shown that some organisms have benefited from the increasing climate temperature. It showed that the rising temperature can increase the fitness of an organism.\nClimate change can also begin to effect the outcome of the ratio of male and females in the wild. Some animals mainly reptiles sex is determined by the temperature of the outside world when developing in an egg. Example of this happen in most species of turtles, which the increasing temperature this could lead to more of one sex which would result in less mates being coupled to repopulate. Though this is not a mutation it does show that many processes in certain species are sesntive to temperature.\n\n\n== Use in research ==\nTemperature-sensitive mutantations are useful in biological research. They allow the study of essential processes required for the survival of the cell or organism. Mutations to essential genes are generally lethal, and hence, temperature-sensitive mutations enable researchers to induce the phenotype at restrictive temperatures and study the effects. The temperature-sensitive phenotype could be expressed during a specific developmental stage to study the effects. This is also done to determine what can happen to certain living organisms with the effects of climate change. Temperature sensitive mutations are important for many different kinds of research especially for genetic research which can help determine many aspects of life from a molecular level. \n\n\n=== Examples ===\nIn the late 1970s, the Saccharomyces cerevisiae secretory pathway, essential for viability of the cell and for growth of new buds, was dissected using temperature-sensitive mutants, resulting in the identification of twenty-three essential genes.\nIn the 1970s, several temperature-sensitive mutant genes were identified in Drosophila melanogaster, such as shibirets, which led to the first genetic dissection of synaptic function.< In the 1990s, the heat shock promoter hsp70 was used in temperature-modulated gene expression in the fruit fly.\n\n\n=== Bacteriophage ===\nAn infection of an Escherichia coli host cell by a bacteriophage (phage) T4 temperature -ensitive (TS) conditionally lethal mutant at a high restrictive temperature generally leads to no phage growth. However, a co-infection under restrictive conditions with two TS mutants defective in different genes generally leads to robust growth because of intergenic complementation. The discovery of TS mutants of phage T4 and the employment of such mutants in complementation tests contributed to the identification of many of the genes in this organism. Because multiple copies of a polypeptide specified by a gene often form multimers, mixed infections with two different TS mutants defective in the same gene often lead to mixed multimers and partial restoration of function, a phenomenon referred to as intragenic complementation. Intragenic complementation of TS mutants defective in the same gene can provide information on the structural organization of the multimer. The growth of phage TS mutants under partially restrictive conditions has been used to identify the functions of genes. Thus, genes employed in the repair of DNA damages were identified, as well as genes affecting genetic recombination. For example, growing a TS DNA repair mutant at an intermediate temperature will allow some progeny phage to be produced. However, if that TS mutant is irradiated with UV light, its survival will be more strongly reduced compared to the reduction of survival of irradiated wild-type phage T4.\nConditional lethal mutants able to grow at high temperatures but unable to grow at low temperatures were also isolated in phage T4. These cold-sensitive mutants defined a discrete set of genes, some of which had been previously identified by other types of conditional lethal mutants.\n\n\n== References ==\n\nFebvre C, Goldblatt C, El-Sabaawi R. Thermal performance of ecosystems: Modeling how physiological responses to temperature scale up in communities. Journal of Theoretical Biology. 2024;585:N.PAG. doi:10.1016/j.jtbi.2024.111792\nEdelsparre, A. H., Fitzpatrick, M. J., Saastamoinen, M., & Teplitsky, C. (2024). Evolutionary adaptation to climate change. Evolution letters, 8(1), 1–7. https://doi.org/10.1093/evlett/qrad070\nHilfiker, A., Nothiger, R. The temperature-sensitive mutation vir ts(virilizer) identifies a new gene involved in sex determination of Drosophila . Roux's Arch Dev Biol 200, 240–248 (1991). https://doi.org/10.1007/BF00241293\nGonsalvez, J. L., Burghes, A. H., & Kunkel, L. M. (2020). Temperature-sensitive spinal muscular atrophy-causing point mutations destabilize the SMN protein at elevated temperatures. Disease Models & Mechanisms, 13(5), dmm043307. https://doi.org/10.1242/dmm.043307\nTan, G., Chen, M., Foote, C., & Tan, C. (2009). Temperature-sensitive mutations made easy: Generating conditional mutations by using temperature-sensitive inteins. Proceedings of the National Academy of Sciences, 106(24), 9155-9160. https://doi.org/10.1073/pnas.0900235106",
  "source_url": "https://en.wikipedia.org/wiki/Temperature-sensitive_mutant",
  "fetched_at": "2025-12-06T07:06:27.090093",
  "page_id": "10389193"
}