{
  "title": "Theravada",
  "text": "Theravāda is Buddhism's oldest existing school. The school's adherents, termed Theravādins (anglicized from Pali theravādī), have preserved their version of the Buddha's teaching or Dhamma in the Pāli Canon for over two millennia. As of 2010, Theravada is the second largest branch of Buddhism with 36% Buddhists belonging to Theravada, compared to 53% to Mahayana.\nThe Pāli Canon is the most complete Buddhist canon surviving in a classical Indian language, Pāli, which serves as the school's sacred language and lingua franca. In contrast to Mahāyāna and Vajrayāna, Theravāda tends to be conservative in matters of doctrine (pariyatti) and monastic discipline (vinaya). One element of this conservatism is the fact that Theravāda rejects the authenticity of the Mahayana sutras (which appeared c. 1st century BCE onwards). Consequently, Theravāda generally does not recognize the existence of many Buddhas and bodhisattvas believed by the Mahāyāna school, such as Amitābha and Vairocana, because they are not found in their scriptures.\nTheravāda derives from Indian Sthavira nikāya (an early Buddhist school). This tradition developed significantly in India and Sri Lanka from the 3rd century BCE onward, particularly with the writing down of the Pāli Canon and the growth of its commentarial literature. From both India, as its historical origin, and Sri Lanka, as its principal center of development, the Theravāda tradition subsequently spread to Southeast Asia, where it became the dominant form of Buddhism. Theravāda is the official religion of Sri Lanka, Myanmar, and Cambodia, and the main dominant Buddhist variant found in Laos and Thailand. It is practiced by minorities in India, Bangladesh, China, Nepal, North Korea, Vietnam, the Philippines, Indonesia, Malaysia, and Taiwan. The diaspora of all of these groups, as well as converts around the world, also embrace and practice Theravāda Buddhism.\nDuring the modern era, new developments have included Buddhist modernism, the Vipassana movement which reinvigorated Theravāda meditation practice, the growth of the Thai Forest Tradition which reemphasized forest monasticism and the spread of Theravāda westward to places such as India and Nepal, along with Buddhist immigrants and converts in the European Union and in the United States.\n\n\n== History ==\n\n\n=== Pre-modern ===\n\nThe Theravāda school descends from the Vibhajjavāda, a division within the Sthāvira nikāya, one of the two major orders that arose after the first schism in the Indian Buddhist community. Theravāda sources trace their tradition to the Third Buddhist council when elder Moggaliputta-Tissa is said to have compiled the Kathavatthu, an important work which lays out the Vibhajjavāda doctrinal position.\nAided by the patronage of Mauryan kings like Ashoka, this school spread throughout India and reached Sri Lanka through the efforts of missionary monks like Mahinda. In Sri Lanka, it became known as the Tambapaṇṇiya (and later as Mahāvihāravāsins) which was based at the Great Vihara (Mahavihara) in Anuradhapura (the ancient Sri Lankan capital). According to Theravāda sources, another one of the Ashokan missions was also sent to Suvaṇṇabhūmi (\"The Golden Land\"), which may refer to Southeast Asia.\nBy the first century BCE, Theravāda Buddhism was well established in the main settlements of the Kingdom of Anuradhapura. The Pali Canon, which contains the main scriptures of the Theravāda, was committed to writing in the first century BCE. Throughout the history of ancient and medieval Sri Lanka, Theravāda was the main religion of the Sinhalese people and its temples and monasteries were patronized by the Sri Lankan kings, who saw themselves as the protectors of the religion.\n\nOver time, two other sects split off from the Mahāvihāra tradition, the Abhayagiri and Jetavana. While the Abhayagiri sect became known for the syncretic study of Mahayana and Vajrayana texts, as well as the Theravāda canon, the Mahāvihāra tradition did not accept these new scriptures. Instead, Mahāvihāra scholars like Buddhaghosa focused on the exegesis of the Pali scriptures and on the Abhidhamma. These Theravāda sub-sects often came into conflict with each other over royal patronage. The reign of Parākramabāhu I (1153–1186) saw an extensive reform of the Sri Lankan sangha after years of warfare on the island. Parākramabāhu created a single unified sangha which came to be dominated by the Mahāvihāra sect.\nEpigraphical evidence has established that Theravāda Buddhism became a dominant religion in the Southeast Asian kingdoms of Sri Ksetra and Dvaravati from about the 5th century CE onwards. The oldest surviving Buddhist texts in the Pāli language are gold plates found at Sri Ksetra dated circa the 5th to 6th century. Before the Theravāda tradition became the dominant religion in Southeast Asia, Mahāyāna, Vajrayana and Hinduism were also prominent.\nStarting at around the 11th century, Sinhalese Theravāda monks and Southeast Asian elites led a widespread conversion of most of mainland Southeast Asia to the Theravādin Mahavihara school. The patronage of monarchs such as the Burmese king Anawrahta (Pali: Aniruddha, 1044–1077) and the Thai king Ram Khamhaeng (floruit. late 13th century) was instrumental in the rise of Theravāda Buddhism as the predominant religion of Burma and Thailand.\nBurmese and Thai kings saw themselves as Dhamma Kings and as protectors of the Theravāda faith. They promoted the building of new temples, patronized scholarship, monastic ordinations and missionary works as well as attempted to eliminate certain non-Buddhist practices like animal sacrifices. During the 15th and 16th centuries, Theravāda also became established as the state religion in Cambodia and Laos. In Cambodia, numerous Hindu and Mahāyāna temples, most famously Angkor Wat and Angkor Thom, were transformed into Theravādin monasteries.\n\n\n=== Modern history ===\n\nIn the 19th and 20th centuries, Theravāda Buddhists came into direct contact with western ideologies, religions and modern science. The various responses to this encounter have been called \"Buddhist modernism\". In the British colonies of Ceylon (modern Sri Lanka) and Burma (Myanmar), Buddhist institutions lost their traditional role as the prime providers of education (a role that was often filled by Christian schools). In response to this, Buddhist organizations were founded which sought to preserve Buddhist scholarship and provide a Buddhist education. Anagarika Dhammapala, Migettuwatte Gunananda Thera, Hikkaduwe Sri Sumangala Thera and Henry Steel Olcott (one of the first American western converts to Buddhism) were some of the main figures of the Sri Lankan Buddhist revival. Two new monastic orders were formed in the 19th century, the Amarapura Nikāya and the Rāmañña Nikāya.\nIn Burma, an influential modernist figure was king Mindon Min (1808–1878), known for his patronage of the Fifth Buddhist council (1871) and the Tripiṭaka tablets at Kuthodaw Pagoda (still the world's largest book) with the intention of preserving the Buddha Dhamma. Burma also saw the growth of the \"Vipassana movement\", which focused on reviving Buddhist meditation and doctrinal learning. Ledi Sayadaw (1846–1923) was one of the key figures in this movement. After independence, Myanmar held the Sixth Buddhist council (Vesak 1954 to Vesak 1956) to create a new redaction of the Pāli Canon, which was then published by the government in 40 volumes. The Vipassana movement continued to grow after independence, becoming an international movement with centers around the world. Influential meditation teachers of the post-independence era include U Narada, Mahasi Sayadaw, Sayadaw U Pandita, Nyanaponika Thera, Webu Sayadaw, U Ba Khin and his student S.N. Goenka.\nMeanwhile, in Thailand (the only Theravāda nation to retain its independence throughout the colonial era), the religion became much more centralized, bureaucratized and controlled by the state after a series of reforms promoted by Thai kings of the Chakri dynasty. King Mongkut (r. 1851–1868) and his successor Chulalongkorn (1868–1910) were especially involved in centralizing sangha reforms. Under these kings, the sangha was organized into a hierarchical bureaucracy led by the Sangha Council of Elders (Pali: Mahāthera Samāgama), the highest body of the Thai sangha. Mongkut also led the creation of a new monastic order, the Dhammayuttika Nikaya, which kept a stricter monastic discipline than the rest of the Thai sangha (this included not using money, not storing up food and not taking milk in the evening). The Dhammayuttika movement was characterized by an emphasis on the original Pali Canon and a rejection of Thai folk beliefs which were seen as irrational. Under the leadership of Prince Wachirayan Warorot, a new education and examination system was introduced for Thai monks.\n\nThe 20th century also saw the growth of \"forest traditions\" which focused on forest living and strict monastic discipline. The main forest movements of this era are the Sri Lankan Forest Tradition and the Thai Forest Tradition, founded by Ajahn Mun (1870–1949) and his students.\nTheravāda Buddhism in Cambodia and Laos went through similar experiences in the modern era. Both had to endure French colonialism, destructive civil wars and oppressive communist governments. Under French Rule, French indologists of the École française d'Extrême-Orient became involved in the reform of Buddhism, setting up institutions for the training of Cambodian and Lao monks, such as the Ecole de Pali which was founded in Phnom Penh in 1914. While the Khmer Rouge effectively destroyed Cambodia's Buddhist institutions, after the end of the communist regime the Cambodian Sangha was re-established by monks who had returned from exile. In contrast, communist rule in Laos was less destructive since the Pathet Lao sought to make use of the sangha for political ends by imposing direct state control. During the late 1980s and 1990s, the official attitudes toward Buddhism began to liberalise in Laos and there was a resurgence of traditional Buddhist activities such as merit-making and doctrinal study.\n\nThe modern era also saw the spread of Theravāda Buddhism around the world and the revival of the religion in places where it remains a minority faith. Some of the major events of the spread of modern Theravāda include:\n\nThe 20th-century Nepalese Theravāda movement which introduced Theravāda Buddhism to Nepal and was led by prominent figures such as Dharmaditya Dharmacharya, Mahapragya, Pragyananda and Dhammalok Mahasthavir.\nThe establishment of some of the first Theravāda Viharas in the Western world, such as the London Buddhist Vihara (1926), Das Buddhistische Haus in Berlin (1957) and the Washington Buddhist Vihara in Washington, DC (1965).\nThe founding of the Bengal Buddhist Association (1892) and the Dharmankur Vihar (1900) in Calcutta by the Bengali monk Kripasaran Mahasthavir, which were key events in the Bengali Theravāda revival.\nThe founding of the Maha Bodhi Society in 1891 by Anagarika Dharmapala which focused on the conservation and restoration of important Indian Buddhist sites, such as Bodh Gaya and Sarnath.\nThe introduction of Theravāda to other Southeast Asian nations like Singapore, Indonesia and Malaysia. Especially with Ven. K. Sri Dhammananda missionary efforts among English-speaking Chinese communities. In addition, the establishment of the Indonesian Theravāda Saṅgha in 1976 and the Theravāda Buddhist Council of Malaysia in 2012 also signaled the revival of Theravāda in both countries.\nThe return of Western Theravādin monks trained in the Thai Forest Tradition to western countries and the subsequent founding of monasteries led by western monastics, such as Abhayagiri Buddhist Monastery, Chithurst Buddhist Monastery, Metta Forest Monastery, Amaravati Buddhist Monastery, Birken Forest Buddhist Monastery, Bodhinyana Monastery and Santacittarama.\nThe spread of the Vipassana movement around the world by the efforts of people like Mother Sayamagyi, S.N. Goenka, Anagarika Munindra, Joseph Goldstein, Jack Kornfield, Sharon Salzberg, Dipa Ma, and Ruth Denison.\nThe Vietnamese Theravāda movement, led by figures such as Ven. Hộ-Tông (Vansarakkhita).\n\n\n== Texts ==\n\n\n=== Pāli Tipiṭaka ===\n\nAccording to Kate Crosby, for Theravāda, the Pāli Tipiṭaka, also known as the Pāli Canon is \"the highest authority on what constitutes the Dhamma (the truth or teaching of the Buddha) and the organization of the Sangha (the community of monks and nuns).\"\nThe language of the Tipiṭaka, Pāli, is a middle-Indic language which is the main religious and scholarly language in Theravāda. This language may have evolved out of various Indian dialects, and is related to, but not the same as, the ancient language of Magadha.\nAn early form of the Tipiṭaka may have been transmitted to Sri Lanka during the reign of Ashoka, which saw a period of Buddhist missionary activity. After being orally transmitted (as was the custom for religious texts in those days) for some centuries, the texts were finally committed to writing in the 1st century BCE. Theravāda is one of the first Buddhist schools to commit its Tipiṭaka to writing. The recension of the Tipiṭaka which survives today is that of the Sri Lankan Mahavihara sect.\nThe oldest manuscripts of the Tipiṭaka from Sri Lanka and Southeast Asia date to the 15th Century, and they are incomplete. Complete manuscripts of the four Nikayas are only available from the 17th Century onwards. However, fragments of the Tipiṭaka have been found in inscriptions from Southeast Asia, the earliest of which have been dated to the 3rd or 4th century. According to Alexander Wynne, \"they agree almost exactly with extant Pāli manuscripts. This means that the Pāli Tipiṭaka has been transmitted with a high degree of accuracy for well over 1,500 years.\"\nThere are numerous editions of the Tipiṭaka, some of the major modern editions include the Pali Text Society edition (published in Roman script), the Burmese Sixth Council edition (in Burmese script, 1954–56) and the Thai Tipiṭaka edited and published in Thai script after the council held during the reign of Rama VII (1925–35). There is also a Khmer edition, published in Phnom Penh (1931–69).\n\nThe Pāli Tipitaka consists of three parts: the Vinaya Pitaka, Sutta Pitaka and Abhidhamma Pitaka. Of these, the Abhidhamma Pitaka is believed to be a later addition to the collection, its composition dating from around the 3rd century BCE onwards. The Pāli Abhidhamma was not recognized outside the Theravāda school. There are also some texts which were late additions that are included in the fifth Nikaya, the Khuddaka Nikāya ('Minor Collection'), such as the Paṭisambhidāmagga (possibly c. 3rd to 1st century BCE) and the Buddhavaṃsa (c. 1st and 2nd century BCE).\nThe main parts of the Sutta Pitaka and some portions of the Vinaya show considerable overlap in content with the Agamas, the parallel collections used by non-Theravāda schools in India which are preserved in Chinese and partially in Sanskrit, Prakrit, and Tibetan, as well as the various non-Theravāda Vinayas. On this basis, these Early Buddhist texts (i.e. the Nikayas and parts of the Vinaya) are generally believed to be some of the oldest and most authoritative sources on the doctrines of pre-sectarian Buddhism by modern scholars.\nMuch of the material in the earlier portions is not specifically \"Theravādan\", but the collection of teachings that this school's adherents preserved from the early, non-sectarian body of teachings. According to Peter Harvey, while the Theravādans may have added texts to their Tipiṭaka (such as the Abhidhamma texts and so on), they generally did not tamper with the earlier material.\nThe historically later parts of the canon, mainly the Abhidhamma and some parts of the Vinaya, contain some distinctive elements and teachings which are unique to the Theravāda school and often differ from the Abhidharmas or Vinayas of other early Buddhist schools. For example, while the Theravāda Vinaya contains a total of 227 monastic rules for bhikkhus, the Dharmaguptaka Vinaya (used in East Asian Buddhism) has a total of 253 rules for bhikkhus (though the overall structure is the same). These differences arose from the systematization and historical development of doctrines and monasticism in the centuries after the death of the Buddha.\nThe Abhidhamma-pitaka contains \"a restatement of the doctrine of the Buddha in strictly formalized language.\" Its texts present a new method, the Abhidhamma method, which attempts to build a single consistent philosophical system (in contrast with the suttas, which present numerous teachings given by the Buddha to particular individuals according to their needs). Because the Abhidhamma focuses on analyzing the internal lived experience of beings and the intentional structure of consciousness, it has often been compared to a kind of phenomenological psychology by numerous modern scholars such as Nyanaponika, Bhikkhu Bodhi and Alexander Piatigorsky.\nThe Theravāda school has traditionally held the doctrinal position that the canonical Abhidhamma Pitaka was actually taught by the Buddha himself. Modern scholarship in contrast, has generally held that the Abhidhamma texts date from the 3rd century BCE onwards. However some scholars, such as Frauwallner, also hold that the early Abhidhamma texts developed out of exegetical and catechetical work which made use of doctrinal lists which can be seen in the suttas, called matikas.\n\n\n=== Non-canonical literature ===\n\nThere are numerous Theravāda works which are important for the tradition even though they are not part of the Tipiṭaka. Perhaps the most important texts apart from the Tipiṭaka are the works of the influential scholar Buddhaghosa (4th–5th century CE), known for his Pāli commentaries (which were based on older Sri Lankan commentaries of the Mahavihara tradition). He is also the author of a very important compendium of Theravāda doctrine, the Visuddhimagga. Other figures like Dhammapala and Buddhadatta also wrote Theravāda commentaries and other works in Pali during the time of Buddhaghosa. While these texts do not have the same scriptural authority in Theravāda as the Tipiṭaka, they remain influential works for the exegesis of the Tipiṭaka.\nAn important genre of Theravādin literature is shorter handbooks and summaries, which serve as introductions and study guides for the larger commentaries. Two of the more influential summaries are Sariputta Thera's Pālimuttakavinayavinicchayasaṅgaha, a summary of Buddhaghosa's Vinaya commentary and Anuruddha's Abhidhammaṭṭhasaṅgaha (a \"Manual of Abhidhamma\").\nThroughout the history of Theravāda, Theravāda monks also produced other works of Pāli literature such as historical chronicles (like the Dipavamsa and the Mahavamsa), hagiographies, poetry, Pāli grammars, and \"sub-commentaries\" (that is, commentaries on the commentaries).\nWhile Pāli texts are symbolically and ritually important for many Theravādins, most people are likely to access Buddhist teachings through vernacular literature, oral teachings, sermons, art and performance as well as films and Internet media. According to Kate Crosby, \"there is a far greater volume of Theravāda literature in vernacular languages than in Pāli.\"\nAn important genre of Theravādin literature, in both Pāli and vernacular languages, are the Jataka tales, stories of the Buddha's past lives. They are very popular among all classes and are rendered in a wide variety of media formats, from cartoons to high literature. The Vessantara Jātaka is one of the most popular of these.\n\n\n=== Other Buddhist texts ===\nMost Theravāda Buddhists generally consider Mahāyāna Buddhist scriptures to be apocryphal, meaning that they are not authentic words of the Buddha. Consequently, Theravādin generally does not recognize the existence of many Buddhas and bodhisattvas believed by the Mahāyāna school, such as Amitābha and Vairocana, because they are not found in the canonical scriptures.\n\n\n== Doctrine (pariyatti) ==\n\n\n=== Core teachings ===\nThe core of Theravāda Buddhist doctrine is contained in the Pāli Canon, the only complete collection of early Buddhist Texts surviving in a classical Indic language. The fundamentals of Theravadin Buddhism are shared by the other early Buddhist schools and Mahayana traditions. They include central concepts such as: \n\nA doctrine of action (karma)—which is based on intention (cetanā)—and a related doctrine of rebirth, which holds that after death, sentient (albeit incompletely awakened) beings will transmigrate to another body, possibly in another realm. The type of realm a being is reborn in is determined by the being's past karma, defining a fundamental reality driven by a cycle of birth and death (saṃsāra).\nA rejection of other doctrines and practices found in Brahmanical religions like Hinduism, including the notion that the Vedas are a divine authority. Any form of sacrifices to the gods (including animal sacrifices) and ritual purification by bathing are considered useless and spiritually corrupted. The Pāli texts also reject the idea that castes are divinely ordained.\nA set of major teachings called the bodhipakkhiyādhammā (factors conducive to awakening).\nDescriptions of various meditative practices or states, namely the four jhanas (meditative absorptions) and the formless dimensions (arupāyatana).\nEthical training (sila), including the ten courses of wholesome action and the five precepts.\nNirvana (Pali: nibbana), the highest good and final state in Theravāda Buddhism. It is the complete and final end of suffering, a state of perfection. It is also the end of all rebirth, but it is not an annihilation (uccheda).\nThe corruptions or influxes (asavas), such as the corruption of sensual pleasures (kāmāsava), existence corruption (bhavāsava), and ignorance corruption (avijjāsava).\nThe doctrine of impermanence (anicca), which holds that all physical and mental phenomena are transient, unstable, and inconstant.\nThe doctrine of not-self (Anattā), which holds that all the constituents of a person, namely, the five aggregates (physical form, feelings, perceptions, intentions and consciousness), are empty of a self (atta), since they are impermanent and not always under our control. Therefore, there is no unchanging substance, permanent self, soul, or essence.\nThe five hindrances (pañca nīvaraṇāni), which are obstacles to meditation: (1) sense-desire, (2) hostility, (3) sloth and torpor, (4) restlessness and worry, and (5) doubt.\nThe Four Divine Abodes (brahmavihārā), also known as the four immeasurables (appamaññā).\nThe Four Noble Truths, which state, in brief: (1) there is dukkha (suffering, unease); (2) there is a cause of dukkha, mainly craving (taṇhā); (3) the removal of craving leads to the end (nirodha) of suffering; and (4) there is a path (magga) to follow to bring this about.\nThe framework of dependent arising (paṭiccasamuppāda), which explains how suffering arises (beginning with ignorance and ending in birth, old age, and death) and how suffering can be brought to an end.\nThe Middle Way, which is seen as having two major facets. First, it is a middle path between extreme asceticism and sensual indulgence. It is also seen as a middle view between the idea that at death beings are annihilated and that there is an eternal self (Pali: atta).\nThe Noble Eightfold Path, one of the main outlines of the Buddhist paths to liberation. The eight factors are: Right View, Right Intention, Right Speech, Right Conduct, Right Livelihood, Right Effort, Right Mindfulness, and Right Samadhi.\nThe practice of taking refuge in the Triple Gems: the Buddha, the Dhamma, and the Saṅgha.\nThe Seven Factors of Awakening (satta bojjhaṅgā): mindfulness (sati), investigation (dhamma vicaya), energy (viriya), bliss (pīti), relaxation (passaddhi), samādhi, and equanimity (upekkha).\nThe six sense bases (saḷāyatana) and a corresponding theory of sense impression (phassa) and consciousness (viññana).\nVarious frameworks for the practice of mindfulness (sati)—mainly, the four satipatthanas (establishments of mindfulness) and the 16 elements of anapanasati (mindfulness of breathing).\n\n\n=== Main doctrinal differences with other Buddhist traditions ===\n\nThe orthodox standpoints of Theravāda in comparison to other Buddhist denominations are presented in the Kathavatthu (Points of Controversy), as well as in other works by commentators like Buddhaghosa.\nTraditionally, Theravāda maintains the following key doctrinal positions, though not all Theravādins agree with the traditional points of view:\n\nOn the philosophy of time, the Theravāda tradition follows philosophical presentism—the view that only present moment phenomena (dhamma) exist—rather than the eternalist view of the Sarvāstivādin tradition, which held that dhammas exist in all three times—past, present, and future.\nThe arahant is never a layperson, for they have abandoned the fetters of a layperson, including married life, using money, etc.\nThe power (bala) of a Buddha is unique and not common to the disciples (savaka) or arahants.\nTheravāda Abhidhamma holds that a single thought (citta) cannot last as long as a day.\nTheravāda Abhidhamma holds that insight into the Four Noble Truths happens instantaneously (khaṇa), rather than gradually (anupubba), as was held by Sarvastivada. The defilements (kilesa) are also abandoned instantaneously, not gradually.\nTheravāda Abhidhamma traditionally rejects the view that there is an intermediate or transitional state (antarabhāva) between rebirths, instead holding that rebirth happens instantaneously. However, as has been noted by various modern scholars (e.g., Bhikkhu Sujato), there are canonical passages that support the idea of an intermediate state (such as the Kutuhalasāla Sutta). Some Theravāda scholars (such as Balangoda Ananda Maitreya Thero) have defended the idea of an intermediate state. It is also a widespread belief some monks and laypersons in the Theravāda world (where it is commonly referred to as the gandhabba or antarabhāva).\nTheravāda does not accept the Mahayana notion that there are two forms of nibbana—an inferior \"localized\" or \"abiding\" (pratiṣṭhita) nirvana and a non-abiding (apratiṣṭhita) nirvana. Such a dual nirvana theory is absent in the suttas. According to the Kathāvatthu, there can be no dividing line separating the unconditioned element, and there is no superiority or inferiority in the unity of nibbana.\nTheravāda exegetical works consider nibbana to be a real existent instead of a conceptual or nominal existent (prajñapti), referring to the mere destruction (khayamatta) of the defilements or non-existence of the five aggregates, as was held by some in the Sautrāntika school, for example. In Theravāda scholasticism, nibbana is defined as the cessation (nirodha) of non-arising and exists separately from the mere destruction of passion, hatred, and delusion.\nIn Theravāda exegetical works, mental phenomena last briefly or instantly (khaṇa), but physical phenomena do not.\nTheravāda holds that the Buddha resided in the human realm (manussa-loka). It rejects the docetic view found in Mahayana that the Buddha's physical body was an incorporeal manifestation, emanation, or magical creation (nirmāṇa) of a transcendental being, and thus, that his birth and death were an illusion. Also, the Theravāda school rejects the view that there are currently numerous Buddhas in all directions.\nTheravāda holds that there is a ground level of consciousness called the bhavaṅga, which conditions the rebirth consciousness.\nTheravāda rejects the Pudgalavada doctrine of the pudgala (\"person\" or \"personal entity\") as being more than a conceptual designation imputed on the five aggregates.\nTheravāda rejects the view of the Lokottaravāda schools that all acts done by the Buddha (including all speech, defecation, and urination, etc.) were supramundane or transcendental (lokuttara). In Theravāda, a Buddha does not have the power to stop something that has already arisen from ceasing; they cannot stop a being from getting old, sick, or dying, and they cannot create a permanent thing (like a flower that does not die).\nTheravāda traditionally defends the idea that the Buddha himself taught the Abhidhamma Pitaka. This is now being questioned by some modern Theravādins in light of modern Buddhist studies scholarship.\nIn Theravāda, nibbana is the only unconstructed phenomenon (asankhata-dhamma, asankhatadhatu). Unlike in the Sarvastivada school, space (akasa), is seen as a constructed dhamma in Theravāda. Even the four noble truths are not unconstructed phenomena, nor is the domain of cessation (nirodhasamapatti). \"Thatness\" (tathatā) is also a constructed phenomenon. According to the Dhammasangani, nibbana, the unconstructed element, is 'without condition' (appaccaya) and is different from the five aggregates which are 'with condition' (sappaccaya).\nIn Theravāda, the bodhisatta path is suitable only for a few exceptional people (like Sakyamuni and Metteya). Theravāda also defines a bodhisatta as someone who has made a vow in front of a living Buddha.\nIn Theravāda, a physical sensory organ (indriya) conditions the mental consciousness (manovinñāna) and is the material support for consciousness. Some later Theravāda works like the Visuddhimagga locate this physical basis for consciousness at the heart (hadaya-vatthu), the Pali Canon itself is silent on this issue. Some modern Theravāda scholars propose alternative notions. For example, Suwanda H. J. Sugunasiri proposes that the basis for consciousness is the entire physical organism, which he ties with the canonical concept of jīvitindriya or life faculty. W. F. Jayasuriya meanwhile, argues that \"hadaya\" is not meant literally (it can also mean \"essence\", \"core\"), but refers to the entire nervous system (including the brain), which is dependent on the heart and blood.\nTheravādins generally reject the Mahayana sutras as Buddhavacana (word of the Buddha), and do not study or see these texts (or Mahayana doctrines) as reliable sources. They reject the view that the Tipitaka is incomplete or inferior (i.e., \"Hinayana\") and that Mahayana texts are somehow more advanced.\nTheravādins traditionally believe that an awakened arahant has an \"incorruptible nature\" and is thus morally perfect. They have no ignorance or doubts. According to Theravāda doctrine, arahants (and the other three lesser ariyas: stream enterers, etc.) cannot fall back or regress from their state.\n\n\n=== Abhidhamma philosophy ===\n\nTheravāda scholastics developed a systematic exposition of the Buddhist doctrine called the Abhidhamma. In the Pāli Nikayas, the Buddha teaches through an analytical method in which experience is explained using various conceptual groupings of physical and mental processes called \"dhammas\". Examples of lists of dhammas taught by the Buddha include the twelve sense 'spheres' or ayatanas, the five aggregates or khandha, and the eighteen elements of cognition or dhatus.\nTheravāda traditionally promotes itself as the Vibhajjavāda \"teaching of analysis\" and as the heirs to the Buddha's analytical method. Expanding this model, Theravāda Abhidhamma scholasticism concerned itself with analyzing \"ultimate truth\" (paramattha-sacca), which it sees as being composed of all possible dhammas and their relationships. The central theory of the Abhidhamma is thus known as the \"dhamma theory\". \"Dhamma\" has been translated as \"factors\" (Collett Cox), \"psychic characteristics\" (Bronkhorst), \"psycho-physical events\" (Noa Ronkin), and \"phenomena\" (Nyanaponika Thera).\nAccording to the Sri Lankan scholar Y. Karunadasa, a dhammas (\"principles\" or \"elements\") are \"those items that result when the process of analysis is taken to its ultimate limits\". However, this does not mean that they have an independent existence, for it is \"only for the purposes of description\" that they are postulated. Noa Ronkin defines dhammas as \"the constituents of sentient experience; the irreducible 'building blocks' that make up one's world, albeit they are not static mental contents and certainly not substances.\" Thus, while in Theravāda Abhidhamma, dhammas are the ultimate constituents of experience, they are not seen as substances, essences or independent particulars, since they are empty (suñña) of a self (attā) and conditioned. This is spelled out in the Patisambhidhamagga, which states that dhammas are empty of svabhava (sabhavena suññam).\nAccording to Ronkin, the canonical Pāli Abhidhamma remains pragmatic and psychological, and \"does not take much interest in ontology\" in contrast with the Sarvastivada tradition. Paul Williams also notes that the Abhidhamma remains focused on the practicalities of insight meditation and leaves ontology \"relatively unexplored\". Ronkin does note, however, that later Theravāda sub-commentaries (ṭīkā) do show a doctrinal shift towards ontological realism from the earlier epistemic and practical concerns.\nOn the other hand, Y. Karunadasa contends that the tradition of realism goes back to the earliest discourses, as opposed to developing only in later Theravada sub-commentaries:\n\nIf we base ourselves on the Pali Nikayas, then we should be compelled to conclude that Buddhism is realistic. There is no explicit denial anywhere of the external world. Nor is there any positive evidence to show that the world is mind-made or simply a projection of subjective thoughts. That Buddhism recognizes the extra-mental existence of matter and, the external world is clearly suggested by the texts. Throughout the discourses it is the language of realism that one encounters. The whole Buddhist practical doctrine and discipline, which has the attainment of Nibbana as its final goal, is based on the recognition of the material world and the conscious living beings living therein.\nThe Theravāda Abhidhamma holds that there is a total of 82 possible types of dhammas, 81 of which are conditioned (sankhata), while one is unconditioned, which is nibbana. The 81 conditioned dhammas are divided into three broad categories: consciousness (citta), associated mentality (cetasika) and materiality, or physical phenomena (rupa). Since no dhamma exists independently, every single dhamma of consciousness, known as a citta, arises associated (sampayutta) with at least seven mental factors (cetasikas). In Abhidhamma, all awareness events are thus seen as being characterized by intentionality and never exist in isolation. Much of Abhidhamma philosophy deals with categorizing the different consciousnesses and their accompanying mental factors as well as their conditioned relationships (paccaya).\n\n\n=== Cosmology ===\n\nThe Pāli Tipiṭaka outlines a hierarchical cosmological system with various planes of existence (bhava) into which sentient beings may be reborn depending on their past actions. Good actions lead one to the higher realms, and bad actions lead to the lower realms. However, even for the gods (devas) in the higher realms like Indra, there is still death, loss and suffering.\nThe main categories of the planes of existence are:\n\nArūpa-bhava, the formless or incorporeal plane. These are associated with the four formless meditations: infinite space, infinite consciousness, infinite nothingness, and neither perception nor non-perception. Beings in these realms live extremely long lives (thousands of kappas).\nKāma-bhava, the spiritual plane of desires. This includes numerous realms of existence such as: various hells (niraya) which are devoid of happiness, the realms of animals, the hungry ghosts (peta), the realm of humans, and various heaven realms where the devas live (such as Tavatimsa and Tusita).\nRūpa-bhava, the plane of form. The realms in this plane are associated with the four meditative absorptions (jhanas), and those who attain these meditations are reborn in these divine realms.\nThese various planes of existence can be found in countless world systems (loka-dhatu), which are born, expand, contract, and are destroyed in a cyclical nature across vast expanses of time (measures in kappas). This cosmology is similar to other ancient Indian systems, such as the Jain cosmology. This entire cyclical multiverse of constant birth and death is called samsara. Outside of this system of samsara is nibbana (lit. 'vanishing, quenching, blowing out'), a deathless (amata) and transcendent reality, which is a total and final release (vimutti) from all suffering (dukkha) and rebirth.\n\n\n=== Soteriology and Buddhology ===\nAccording to Theravāda doctrine, release from suffering (i.e. nibbana) is attained in four stages of awakening (bodhi):\n\nStream-Enterers: Those who have destroyed the first three fetters (the false view of self, doubt/indecision, and clinging to ethics and vows);\nOnce-Returners: Those who have destroyed the first three fetters and have weakened the fetters of desire and ill-will;\nNon-Returners: Those who have destroyed the five lower fetters, which bind beings to the world of the senses;\nArahants (lit. \"honorable\" or \"worthies\"): Those who have realized Nibbana and are free from all defilements. They have abandoned all ignorance, craving for existence, restlessness (uddhacca) and subtle pride (māna).\nIn Theravāda Buddhism, a Buddha is a sentient being who has discovered the path out of samsara by themselves, has reached Nibbana, and then makes the path available to others by teaching (known as \"turning the wheel of the Dhamma\"). A Buddha is also believed to have extraordinary powers and abilities (abhiññā), such as the ability to read minds and fly through the air.\nThe Theravāda canon depicts Gautama Buddha as the most recent Buddha in a line of previous Buddhas stretching back for aeons. They also mention the future Buddha, named Metteyya. Traditionally, the Theravāda school also rejects the idea that there can be numerous Buddhas active in the world simultaneously. \n\nRegarding how a sentient being becomes a Buddha, the Theravāda school also presents this path. Indeed, according to Buddhaghosa, there are three main soteriological paths: the path of the Buddhas (buddhayāna); the way of the individual Buddhas (paccekabuddhayāna); and the way of the disciples (sāvakayāna).\nHowever, unlike in Mahayana Buddhism, the Theravāda holds that the Buddha path is not for everyone and that beings on the Buddha path (bodhisattas) are quite rare. While in Mahayana, bodhisattas refers to beings who have developed the wish to become Buddhas, Theravāda (like other early Buddhist schools), defines a bodhisatta as someone who has resolved (abhinīhāra) to become a Buddha in front of a living Buddha, and has also received a confirmation from that Buddha that they will reach Buddhahood. Cariyāpiṭaka is a Theravāda text which focuses on the path of the Buddhas, while the Nidānakathā and the Buddhavaṃsa are also Theravāda texts which discuss the Buddha's path.\n\n\n=== Modern developments ===\nThe modern era saw new developments in Theravāda scholarship due to the influence of Western thought. As Donald K. Swearer writes: Although monastic education is still grounded in the study of Buddhist texts, doctrine, and the Pali language, the curricula of monastic colleges and universities also reflect subject matter and disciplines associated with Western education.Buddhist modernist trends can be traced to figures like Anagarika Dhammapala, King Mongkut, and the first prime minister of Burma U Nu. They promoted a form of Buddhism that was compatible with rationalism and science, and opposed to superstition and certain folk practices. Walpola Rahula's What the Buddha Taught is seen by scholars as an introduction to modernist Buddhist thought, and the book continues to be widely used in universities.\nAnother modern phenomenon is Buddhist philosophers who received an education in the West, such as K. N. Jayatilleke (a student of Wittgenstein at Cambridge) and Hammalawa Saddhatissa (who received his Phd at Edinburgh), going on to write modern works on Buddhist philosophy (Early Buddhist Theory of Knowledge, 1963 and Buddhist Ethics, 1987 respectively). Henepola Gunaratana is another modern Theravāda scholar who studied philosophy in the West (at the American University). The modern encounter with Christian missionaries also led to new debates (such as the Panadura debate) and doctrinal works written in defense of Buddhism or attacking Christian ideas, such as Gunapala Dharmasiri's A Buddhist critique of the Christian concept of God (1988).\nThere have also been several modern Theravāda scholars who have taken a historical-critical perspective on Theravāda literature and doctrine, attempting to understand its historical development. Some of these figures, such as David Kalupahana, Buddhadasa, and Bhikkhu Sujato, have criticized traditional Theravāda commentators like Buddhaghosa for their doctrinal innovations which differ in significant ways from the early Buddhist texts.\nThe modern era also saw new Buddhist works on topics which pre-modern Buddhists avoided, such as socially engaged Buddhism and Buddhist economics. Thinkers such as Buddhadasa, Sulak Sivaraksa, Prayudh Payutto, Neville Karunatilake, and Padmasiri de Silva have written on these topics. Modern scholarship in Western languages by Western Buddhist monks such as Nyanatiloka, Nyanaponika, Nyanamoli, Bhikkhu Bodhi, and Analayo is another recent development in the Theravāda world.\n\n\n== Practice (paṭipatti) ==\n\n\n=== Textual basis ===\nIn the Pāli Canon, the path (magga) or way (patipada) of Buddhist practice is described in various ways, one of the most widely used frameworks in Theravāda is the Noble Eightfold Path:\n\nThe Blessed One said, \"Now what, monks, is the Noble Eightfold Path? Right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.\"\nThe Noble Eightfold Path can also be summarized as the Three Noble Disciplines of sīla (moral conduct or discipline), Samādhi (meditation or concentration) and Paññā (understanding or wisdom).\nTheravāda orthodoxy takes the seven stages of purification as outlined in the Visuddhimagga as the basic outline of the path to be followed. The Visuddhimagga, a Sinhala Theravāda doctrinal summa written in the fifth century by Buddhaghosa, became the orthodox account of the Theravāda path to liberation in Sri Lanka after the 12th century and this influence spread to other Theravāda nations. It gives the sequence of seven purifications, in three sections:\n\nThe first section (part 1) explains the rules of discipline, and the method for finding a correct temple to practice, or how to meet a good teacher.\nThe second section (part 2) describes Samatha (calming) practice, object by object (see Kammaṭṭhāna for the list of the forty traditional objects). It mentions different stages of Samādhi.\nThe third section (parts 3–7) is a description of the five khandhas, ayatanas, the Four Noble Truths, dependent origination, and the practise of Vipassanā (insight) through the development of wisdom. It emphasizes different forms of knowledge emerging because of the practice. This part shows a great analytical effort specific to Buddhist philosophy.\nThis basic outline is based on the threefold discipline. The emphasis is on understanding the three marks of existence, which removes ignorance. Understanding destroys the ten fetters and leads to Nibbana.\nTheravādins believe that every individual is personally responsible for achieving their own self-awakening and liberation, each being responsible for their own karma (actions and consequences). Applying knowledge acquired through direct experience and personal realization is more heavily emphasized than beliefs about the nature of reality as revealed by the Buddha.\n\n\n=== Moral conduct ===\nGiving (Dana) is an important Buddhist virtue. The community of monastics is seen as the most meritorious field of karmic fruitfulness.\nSīla, meaning moral conduct, is mainly defined as right speech, right action, and right livelihood. It is primarily understood through the doctrine of kamma. In Theravāda, one's previous intentional actions strongly influence one's present experience. Whatever intended actions are carried out will have future consequences, whether in this life or subsequent lives. Intention is central to the idea of kamma. Actions done with good intentions, even if they have bad results, will not have negative kammic consequences.\nSeveral sets of precepts or moral trainings (sikkhāpada) guide right action. After taking Refuge in the Triple Gems, lay Theravādin Buddhists traditionally take the Five precepts (whether for life or for a limited time) in the presence of Sangha. Laypeople also sometimes take an extended set of Eight precepts, which includes chastity during sacred days of observance such as Uposatha.\nPerforming good deeds is another important feature of Theravādin Buddhist ethics. Doing so is said to make \"merit\" (puñña), which results in a better rebirth. The \"ten wholesome actions\" is a common list of good deeds:\n\nGenerosity (Dāna); This typically involves providing monks with \"the four requisites\"; food, clothing, shelter, and medicine; however, giving to charity and the needy is also considered dāna.\nMoral conduct (Sīla); Keeping the five precepts and generally refraining from doing harm.\nMeditation (Bhāvanā).\nDedication of merit; doing good deeds in the name of someone who has passed away or in the name of all sentient beings.\nRejoicing in merit of good deeds done by others, this is common in communal activities.\nRendering service to others; looking after others or needy.\nHonoring others; showing appropriate deference, particularly to the Buddha, Dhamma and Sangha, and to seniors and parents. Usually done by placing the hands together in Añjali Mudrā, and sometimes bowing.\nPreaching or sharing the Dhamma; the gift of Dhamma is seen as a form of highest gift. (Dhammapada 354)\nListening to Dhamma\nHaving right view or Sammādiṭṭhi; mainly the Four Noble Truths and the three marks of existence.\n\n\n=== Meditation ===\n\nMeditation (Pāli: Bhāvanā, literally \"causing to become\" or cultivation) means the positive cultivation of one's mind.\n\n\n==== Forms ====\nTheravāda Buddhist meditation practice varies considerably in technique and objects. Currently, there are also various traditions of Theravāda meditation practice, such as the Burmese Vipassana tradition, the Thai Forest Tradition, the esoteric Borān kammaṭṭhāna ('ancient practices'), the Burmese Weikza tradition, Dhammakaya meditation and the Western Insight Meditation movement.\nTheravāda Buddhist meditation practices or Bhavana (mental cultivation) are categorized into two broad categories: Samatha bhavana (calming), and Vipassanā bhavana (investigation, insight). Originally these referred to effects or qualities of meditation, but after the time of Buddhaghosa, they also referred to two distinct meditation types or paths (yāna).\nSamatha (\"calm\") consists of meditation techniques in which the mind is focused on a single object, thought, or gatha, leading to Samādhi'. In traditional Theravāda it is considered to be the base for vipassanā (\"insight\"). In the Theravāda-tradition, as early as the Pāli Nikayas, the four jhānas are regarded as a samatha-practice. The eighth and final step of the Eightfold Path, Right Samadhi, is often defined as the four jhanas. In the Pāli Nikayas, Jhānas are described as preceding the awakening insight of the Buddha, which turned him into an awakened being. Yet the interpretation of jhana as single-pointed concentration and calm may be a later re-interpretation in which the original aim of jhana was lost.\nVipassana (\"insight\", \"clear seeing\") refers to practices that aim to develop an inner understanding or knowledge of the nature of phenomena (dhammas), especially the characteristics of dukkha, anatta and anicca, which are seen as being universally applicable to all constructed phenomena (sankhata-dhammas). Vipassana is also described as insight into dependent origination, the five aggregates, the sense spheres and the Four Noble Truths. It is the primary focus of the modernist Burmese Vipassana movement. In western countries it is complemented with the four divine abidings, the development of loving-kindness and compassion.\nVipassana practice begins with the preparatory stage, the practice of sila, morality, giving up worldly thoughts and desires. The practitioner then engages in anapanasati, mindfulness of breathing, which is described in the Satipatthana Sutta as going into the forest and sitting beneath a tree and then simply to watch the breath. If the breath is long, to notice that the breath is long, if the breath is short, to notice that the breath is short. In the \"New Burmese Method\" the practitioner pays attention to any arising mental or physical phenomenon, engaging in vitaka, noting or naming physical and mental phenomena (\"breathing, breathing\"), without engaging the phenomenon with conceptual thinking. By noticing the arising of physical and mental phenomena the meditator becomes aware of how sense impressions arise from the contact between the senses and physical and mental phenomena, as described in the five skandhas and paṭiccasamuppāda. The practitioner also becomes aware of the perpetual changes involved in breathing, and the arising and passing away of mindfulness. This noticing is accompanied by reflections on causation and other Buddhist teachings, leading to insight into dukkha, anatta, and anicca. When the three characteristics have been comprehended, reflection subdues and the process of noticing accelerates, noting phenomena in general without necessarily naming them.\nAccording to Vajiranāṇa Mahathera, writing from a traditional and text-based point of view, in the Pāli Canon whether one begins the practice by way of samatha or by way of vipassanā is generally seen as depending on one's temperament. According to Vajiranāṇa Mahathera, it is generally held that there are two kinds of individuals. Those of a passionate disposition (or those who enter the path by faith) attain Arahatship through vipassanā preceded by samatha. Those of a skeptical disposition (or those who enter by way of wisdom or the intellect) achieve it through samatha preceded by vipassanā.\n\n\n==== Aims of meditation ====\n\nTraditionally, the ultimate goal of the practice is to achieve mundane and supramundane wisdom. Mundane wisdom is the insight in the three marks of existence. The development of this insight leads to four supramundane paths and fruits, these experiences consist a direct apprehension of Nibbana. Supramundane (lokuttara) wisdom refers to that which transcends the world of samsara.\nApart from nibbana, there are various reasons why traditional Theravāda Buddhism advocates meditation, including a good rebirth, supranormal powers, combating fear and preventing danger. Recent modernist Theravādins have tended to focus on the psychological benefits and psychological well-being.\n\n\n==== Historical development and sources ====\nThe practice of Theravāda meditation can be traced back to the 5th century exegete Buddhaghosa, who systematized the classic Theravāda meditation, dividing them into samatha and vipassana types and listing 40 different forms (known as \"kammaṭṭhānas\", \"workplaces\") in his magnum opus, the Visuddhimagga. This text has remained central for the study and practice of Theravāda meditation. Buddhaghosa's commentary on the Satipatthana sutta (\"Bases of mindfulness discourse\"), as well as the source text itself, are also another important source for meditation in this tradition. Buddhaghosa's work drew heavily on the Pali suttas as well as the Pali Abhidhamma. Kate Crosby notes that Buddhaghosa's work also \"explicitly refers to the contemporaneous existence of secret meditation manuals but not to their content.\"\n\nRegarding post Visuddhimagga Theravāda meditation, according to Kate Crosby, In the period between the Visuddhimagga and the present, there have been numerous meditation texts, both manuals and descriptive treatises. Many of the texts found in manuscript collections relate to meditation, some on a single, simple subject such as the recollection of the qualities of the Buddha, others more complex. Little research has been done to assess their variety. One difficulty is that meditation manuals as such are often in a mixture of a classical language, that is, Pali, and a vernacular that may or may not be a currently used language. Also, actual manuals often contain prompts or reminders rather than an in-depth explanation. In recent years it has emerged that there is still extant a relatively high number of manuals and related texts pertaining to a system of meditation called – among other things – borān kammaṭṭhāna or yogāvacara. Its core text, the Mūla-kammaṭṭhāna \"original, fundamental or basic meditation practice,\" circulated under a number of different titles, or without a title, throughout the Tai–Lao–Khmer and Sri Lankan Buddhist worlds. Some versions of this text are simple lists of kammaṭṭhāna and from that perspective look entirely in accord with the Visuddhimagga or Theravada Abhidhamma texts. Other versions contain extensive narratives, explanations of symbolism, and of the somatic locations involved in the practice that make it clear that we are dealing with techniques of practice not described in the Canon or Visuddhimagga.According to Crosby, the esoteric borān kammaṭṭhāna or yogāvacara meditation tradition was the dominant form of meditation in the Theravāda world during the 18th century, and may date as far back as the 16th century. Crosby notes that this tradition of meditation involved a rich collection of symbols, somatic methods and visualizations which included \"the physical internalisation or manifestation of aspects of the Theravada path by incorporating them at points in the body between the nostril and navel.\" In spite of the novel elements in this meditation tradition, close study of borān kammaṭṭhāna texts reveals that they are closely connected to Theravada Abhidhamma and the works of Buddhaghosa. Modernist reforms which emphasized Pali Canon study, a shift in state support to other traditions and modern wars in Indochina led to this tradition's decline, and it now only survives in a few Cambodian and Thai temples. \n\nDuring the 19th and 20th centuries, the Theravāda world saw a modernist revival and reinvention of meditation practice, as exemplified by the Burmese Vipassana movement. According to Buswell vipassana, \"appears to have fallen out of practice\" by the 10th century, due to the belief that Buddhism had degenerated, and that liberation was no longer attainable until the coming of Maitreya. The practice was revived in Myanmar (Burma) in the 18th century by Medawi (1728–1816) and by later figures such as Ledi Sayadaw and Mahāsī Sayadaw during the 19th and 20th centuries. These Burmese figures re-invented vipassana-meditation and developed simplified meditation techniques, based on the Satipatthana sutta, the Visuddhimagga, and other texts, emphasizing satipatthana and bare insight. These techniques were globally popularized by the Vipassana movement in the second half of the 20th century.\nSimilar revival movements developed in Thailand, such as the Thai forest tradition and Dhammakaya meditation. These traditions are influenced by the older borān kammaṭṭhāna forms. Thailand and Cambodia also saw attempts to preserve and revive the ancient \"borān kammaṭṭhāna\" tradition of meditation. In Sri Lanka, the new Buddhist traditions of the Amarapura and Rāmañña Nikāyas developed their own meditation forms based on the Pali Suttas, the Visuddhimagga, and other manuals, while borān kammaṭṭhāna mostly disappeared by the end of the 19th century.\nThough the Vipassana movement has popularised meditation both in traditional Theravāda countries among the laity, and in western countries, \"meditation plays a minor if not negligible role in the lives of the majority of Theravāda monks.\" Meditation is especially popular laypersons, especially during special religious holidays or in their old age, when they have more free time to spend at the temple. Buddhist modernists tend to present Buddhism as rational and scientific, and this has also affected how Vipassana meditation has been taught and presented. This has led in some quarters to a playing down of older non-empirical elements of Theravāda, associated with 'superstition'. Strains of older, traditional Theravāda meditation known as \"borān kammaṭṭhāna\" still exist, but this tradition has mostly been eclipsed by the Buddhist modernist meditation movements.\n\n\n=== Other practices ===\n\nLaypersons and monks also perform various types of religious practices daily or during Buddhist holidays. One of these is keeping a Buddhist shrine with a picture or statue of the Buddha for devotional practice in one's home, mirroring the larger shrines at temples. It is common to offer candles, incense, flowers and other objects to these shrine. Gestures of respect are also done in front of Buddha images and shrines, mainly the respectful salutation with the hands (añjalikamma), and the five-limb prostration (pañc'anga-vandana).\nBuddhist forms of chanting is also widely practiced by both monks and laypersons, who may recite famous phrases such as the taking of refuge, the Metta Sutta and the Mangala Sutta in front of their shrine. Chanting may also be part of the practice of recollection (anussati), which refers to contemplating various topics such as the sublime qualities of the Buddha, Dhamma and Sangha or the five subjects for daily recollection. This may be done as part of a daily puja ritual.\nAnother important religious practice for the devout is the keeping of special religious holidays known as Uposatha which are based on a lunar calendar. Laypersons commonly take the eight precepts while visiting a temple or monastery and commit to focusing on Buddhist practice for the day.\nStudy (ganthadhura) of the Buddhist texts and listening to Dhamma talks by monks or teachers are also important practices.\n\n\n== Lay and monastic life ==\n\n\n=== Distinction between lay and monastic life ===\nTraditionally, Theravāda Buddhism has observed a distinction between the practices suitable for a lay person and the practices undertaken by ordained monks (in ancient times, there was a separate body of practices for nuns). While the possibility of significant attainment by laymen is not entirely disregarded by the Theravāda, it generally occupies a position of less prominence than in the Mahāyāna and Vajrayāna traditions, with monastic life being hailed as a superior method of achieving Nibbana. The view that Theravāda, unlike other Buddhist schools, is primarily a monastic tradition has, however, been disputed.\n\nSome Western scholars have erroneously tried to claim that Mahāyāna is primarily a religion for laymen and Theravāda is a primarily monastic religion. Both Mahāyāna and Theravāda have as their foundation strong monastic communities, which are almost identical in their regulations. Schools of Mahāyāna Buddhism without monastic communities of fully ordained monks and nuns are relatively recent and atypical developments, usually based on cultural and historical considerations rather than differences in fundamental doctrine. Both Mahāyāna and Theravāda also provided a clear and important place for lay followers.\nThis distinction between ordained monks and laypeople – as well as the distinction between those practices advocated by the Pāli Canon, and the folk religious elements embraced by many monks – have motivated some scholars to consider Theravāda Buddhism to be composed of multiple separate traditions, overlapping though still distinct.  Most prominently, the anthropologist Melford Spiro in his work Buddhism and Society separated Burmese Theravāda into three groups: Apotropaic Buddhism (concerned with providing protection from evil spirits), Kammatic Buddhism (concerned with making merit for a future birth), and Nibbanic Buddhism (concerned with attaining the liberation of Nibbana, as described in the Tipitaka). He stresses that all three are firmly rooted in the Pāli Canon. These categories are not accepted by all scholars, and are usually considered non-exclusive by those who employ them.\nThe role of lay people has traditionally been primarily occupied with activities that are commonly termed merit-making (falling under Spiro's category of kammatic Buddhism). Merit-making activities include offering food and other basic necessities to monks, making donations to temples and monasteries, burning incense or lighting candles before images of the Buddha, chanting protective or scriptural verses from the Pali Canon, building roads and bridges, charity to the needy and providing drinking water to strangers along roadside. Some lay practitioners have always chosen to take a more active role in religious affairs, while still maintaining their lay status. Dedicated lay men and women sometimes act as trustees or custodians for their temples, taking part in the financial planning and management of the temple. Others may volunteer significant time in tending to the mundane needs of local monks (by cooking, cleaning, maintaining temple facilities, etc.). Study of the Pāli scriptures and the practice of meditation are less common among the lay community in the past, though in the 20th century these areas have become more popular to the lay community, especially in Thailand.\n\nA number of senior monastics in the Thai Forest Tradition, including Buddhadasa, Ajahn Maha Bua, Ajahn Plien Panyapatipo, Ajahn Pasanno, and Ajahn Jayasaro, have begun teaching meditation retreats outside of the monastery for lay disciples. Ajahn Sumedho, a disciple of Ajahn Chah, founded the Amaravati Buddhist Monastery in Hertfordshire, which has a retreat center specifically for lay retreats. Sumedho extended this to Harnham in Northumberland as Aruna Ratanagiri under the present guidance of Ajahn Munindo, another disciple of Ajahn Chah.\n\n\n=== Lay devotee ===\n\nIn Pāli the word for a male lay devotee is Upasaka and a female devotee is Upasika. One of the duties of the lay followers, as taught by the Buddha, is to look after the needs of the monk/nuns. They are to see that the monk/nuns do not suffer from lack of the four requisites: food, clothing, shelter and medicine. As neither monks nor nuns are allowed to have an occupation, they depend entirely on the laity for their sustenance. In return for this charity, they are expected to lead exemplary lives.\nIn Myanmar and Thailand, the monastery was and is still regarded as a seat of learning. Theravādin monasteries have been providing free education to many children since ancient times. In fact, today about half of the primary schools in Thailand are located in monasteries. Religious rituals and ceremonies held in a monastery are always accompanied by social activities. In times of crisis, it is to the monks that people bring their problems for counsel and monks often took up the role of mediators in most disputes. Traditionally, a ranking monk will deliver a sermon four times a month: when the moon waxes and wanes and the day before the new and full moons. The laity also have a chance to learn meditation from the monks during these times.\nIt is also possible for a lay disciple to become enlightened. As Bhikkhu Bodhi notes, \"The Suttas and commentaries do record a few cases of lay disciples attaining the final goal of Nirvana. However, such disciples either attain Arahantship on the brink of death or enter the monastic order soon after their attainment. They do not continue to dwell at home as Arahant householders, for dwelling at home is incompatible with the state of one who has severed all craving.\"\nIn the modern era, it is now common for lay disciples to practice meditation, attend lay meditation centers and even aim for awakening. The impetus for this trend began in Myanmar and was supported by prime minister U Nu who himself established the International Meditation Center (IMC) in Yangon. Modern lay teachers such as U Ba Khin (who was also the Accountant General of the Union of Burma) promoted meditation as part of a laypersons daily routine. According to Donald K Swearer, another development in modern Theravāda is \"the formation of lay Buddhist associations that have partially assumed the social service responsibilities formerly associated with the monastery\". These include social service and activist organizations such as the Young Men's Buddhist Association of Colombo, the All Ceylon Buddhist Congress, the Sarvodaya Shramadana of A. T. Ariyaratne, the NGO's founded by Sulak Sivaraksa such as Santi Pracha.\n\n\n=== Monastic vocation ===\n\nTheravāda sources dating back to medieval Sri Lanka (2nd century BCE to 10th century CE) such as the Mahavamsa show that monastic roles in the tradition were often seen as being in a polarity between urban monks (Sinhala: khaamawaasii, Pāli: gāmavasī) on one end and rural forest monks (Sinhala: aranyawaasii, Pali: araññavasi, nagaravasi, also known as Tapassin) on the other. The ascetic focused monks were known by the names Pamsukulikas (rag robe wearers) and Araññikas (forest dwellers).\nThe Mahavamsa mentions forest monks associated with the Mahavihara. The Pāli Dhammapada Commentary mentions another split based on the \"duty of study\" and the \"duty of contemplation\". This second division has traditionally been seen as corresponding with the city – forest split, with the city monks focusing on the vocation of books (ganthadhura) or learning (pariyatti) while the forest monks leaning more towards meditation (vipassanadhura) and practice (patipatti). However this opposition is not consistent, and urban monasteries have often promoted meditation while forest communities have also produced excellent scholars, such as the Island Hermitage of Nyanatiloka.\nScholar monks generally undertake the path of studying and preserving Theravāda's Pāli literature. Forest monks tend to be the minority among Theravāda sanghas and also tend to focus on asceticism (dhutanga) and meditative praxis. They view themselves as living closer to the ideal set forth by the Buddha, and are often perceived as such by lay folk, while at the same time often being on the margins of the Buddhist establishment and on the periphery of the social order.\nWhile this divide seems to have been in existence for some time in the Theravāda school, only in the 10th century is a specifically forest monk monastery, mentioned as existing near Anuradhapura, called \"Tapavana\". This division was then carried over into the rest of Southeast Asia as Theravāda spread.\nToday there are forest based traditions in most Theravāda countries, including the Sri Lankan Forest Tradition, the Thai Forest Tradition as well as lesser known forest based traditions in Burma and Laos, such as the Burmese forest based monasteries (taw\"yar) of the Pa Auk Sayadaw. In Thailand, forest monks are known as phra thudong (ascetic wandering monks) or phra thudong kammathan (wandering ascetic meditator).\n\n\n=== Ordination ===\n\nThe minimum age for ordaining as a Buddhist monk is 20 years, which is calculated from conception. Those under this age can perform traditional ceremonies such as shinbyu, in Myanmar, in order to ordain as novices (sāmaṇera). Novices shave their heads, wear the yellow robes, and observe the Ten Precepts. While there is no explicit minimum age for novices prescribed in the scriptures, it is traditionally accepted that boys as young as seven can be accepted for ordination. This tradition echoes the story of the Buddha's son, Rahula, who was allowed to become a novice at the age of seven. Both monks and nuns are expected to adhere to a specific code of discipline, of which monks follow 227 rules, and nuns follow 311.\nIn most Theravāda countries, it is a common practice for young men to ordain as monks for a fixed period of time. In Thailand and Myanmar, young men typically ordain for the retreat during Vassa, the three-month monsoon season, though shorter or longer periods of ordination are not rare. Traditionally, temporary ordination was even more flexible among Laotians. Once they had undergone their initial ordination as young men, Laotian men were permitted to temporarily ordain again at any time, though married men were expected to seek their wife's permission. Throughout Southeast Asia, there is little stigma attached to leaving the monastic life. Monks regularly leave the robes after acquiring an education, or when compelled by family obligations or ill health.\nOrdaining as a monk, even for a short period, is seen as having many virtues. In many Southeast Asian cultures, it is seen as a means for a young man to \"repay his gratitude\" to his parents for their work and effort in raising him, because the merit from his ordination is dedicated for their well-being. Thai men who have ordained as a monk may be seen as more mature and suitable husbands by Thai women, who refer to men who have served as monks with a colloquial term meaning \"ripe\" to indicate that they are more mature and ready for marriage. Particularly in rural areas, temporary ordination of boys and young men traditionally offered peasant boys an opportunity to receive free education in temple schools with sponsorship and accommodation.\nIn Sri Lanka, temporary ordination is not practised, and a monk leaving the order is frowned upon but not condemned. The continuing influence of the caste system in Sri Lanka plays a role in the taboo against temporary or permanent ordination as a bhikkhu in some orders. Though Sri Lankan orders are often organized along caste lines, men who ordain as monks temporarily pass outside of the conventional caste system, and as such during their time as monks may act (or be treated) in a way that would not be in line with the expected duties and privileges of their caste.\nFor those born in Western countries who wish to become Buddhist monks or nuns, it is possible to undertake the lifestyle in their home countries, among other Buddhist monastics in Western countries, or to travel and take up residence in a Buddhist monastery in Asian countries such as Sri Lanka or Thailand. In countries where Buddhism is deeply rooted, it can often be easier to adhere to the lifestyle of a monk or nun, as it requires considerable discipline to successfully live by the non-secular rules and regulations for which Buddhist practices are known. For instance, Theravāda monastics are typically required to abstain from activities such as working, handling money, listening to music and cooking. Such obligations can be especially challenging in non-Buddhist societies.\nSome of the more well-known Theravādin monks are Ajahn Mun, Ajahn Chah, Ledi Sayadaw, Webu Sayadaw, Narada Maha Thera, Ajahn Plien Panyapatipo, Buddhadasa, Mahasi Sayadaw, Nyanatiloka Mahathera, Nyanaponika Thera, Preah Maha Ghosananda, U Pandita, Ajahn Sumedho, Ajahn Khemadhammo, Bhikkhu Bodhi, Ajahn Amaro, Ajahn Sucitto, Ajahn Jayasaro, Thanissaro Bhikkhu, Walpola Rahula Thero, Henepola Gunaratana, Bhaddanta Āciṇṇa, Bhante Yogavacara Rahula, Luang Pu Sodh Candasaro, K. Sri Dhammananda, Sayadaw U Tejaniya and Bhikkhu Analayo.\n\n\n=== Monastic practices ===\n\nThe practices usually vary in different sub-schools and monasteries within Theravāda. But in the most orthodox forest monastery, the monk usually models his practice and lifestyle on that of the Buddha and his first generation of disciples by living close to nature in forest, mountains and caves. Forest monasteries still keep alive the ancient traditions through following the Buddhist monastic code of discipline in all its detail and developing meditation in secluded forests.\nIn a typical daily routine at the monastery during the 3-month vassa period, the monk will wake up before dawn and will begin the day with group chanting and meditation. At dawn the monks will go out to surrounding villages bare-footed on alms-round and will have the only meal of the day before noon by eating from the bowl by hand. Most of the time is spent on Dhamma study and meditation. Sometimes the abbot or a senior monk will give a Dhamma talk to the visitors. Laity who stay at the monastery will have to abide by the traditional eight Buddhist precepts.\nThe life of the monk or nun in a community is much more complex than the life of the forest monk. In the Buddhist society of Sri Lanka, most monks spend hours every day in taking care of the needs of lay people such as preaching bana, accepting alms, officiating funerals, teaching dhamma to adults and children in addition to providing social services to the community.\nAfter the end of the Vassa period, many of the monks will go out far away from the monastery to find a remote place (usually in the forest) where they can hang their umbrella tents and where it is suitable for the work of self-development. When they go wandering, they walk barefoot, and go wherever they feel inclined. Only those requisites which are necessary will be carried along.  These generally consist of the bowl, the three robes, a bathing cloth, an umbrella tent, a mosquito net, a kettle of water, a water filter, razor, sandals, some small candles, and a candle lantern.\nThe monks do not fix their times for walking and sitting meditation, for as soon as they are free, they just start doing it; nor do they determine for how long they will go on to meditate. Some of them sometimes walk from dusk to dawn whereas at other times they may walk from between two and seven hours. Some may decide to fast for days or stay at dangerous places where ferocious animals live in order to aid their meditation.\nThose monks who have been able to achieve a high level of attainment will be able to guide the junior monks and lay Buddhists toward the four degrees of spiritual attainment.\n\n\n=== Bhikkhunis ===\n\nA few years after the arrival of Mahinda, the bhikkhu Saṅghamittā, who is also believed to have been the daughter of Ashoka, came to Sri Lanka. She ordained the first nuns in Sri Lanka. In 429, by request of China's emperor, nuns from Anuradhapura were sent to China to establish the order there, which subsequently spread across East Asia. The prātimokṣa of the nun's order in East Asian Buddhism is the Dharmaguptaka, which is different from the prātimokṣa of the current Theravāda school; the specific ordination of the early Sangha in Sri Lanka not known, although the Dharmaguptaka sect originated with the Sthāvirīya as well.\nThe nun's order subsequently died out in Sri Lanka in the 11th century and in Burma in the 13th century. It had already died out around the 10th century in other Theravādin areas. Novice ordination has also disappeared in those countries. Therefore, women who wish to live as renunciates in those countries must do so by taking eight or ten precepts. Neither laywomen nor formally ordained, these women do not receive the recognition, education, financial support or status enjoyed by Buddhist men in their countries.  These \"precept-holders\" live in Myanmar, Cambodia, Laos, Nepal, and Thailand. In particular, the governing council of Burmese Buddhism has ruled that there can be no valid ordination of women in modern times, though some Burmese monks disagree. Japan is a special case as, although it has neither the bhikkhuni nor novice ordinations, the precept-holding nuns who live there do enjoy a higher status and better education than their precept-holder sisters elsewhere, and can even become Zen priests. In Tibet there is currently no bhikkhuni ordination, but the Dalai Lama has authorized followers of the Tibetan tradition to be ordained as nuns in traditions that have such ordination.\nIn 1996, 11 selected Sri Lankan women were ordained fully as Theravāda bhikkhunis by a team of Theravāda monks in concert with a team of Korean nuns in India. There is disagreement among Theravāda vinaya authorities as to whether such ordinations are valid. The Dambulla chapter of the Siam Nikaya in Sri Lanka also carried out a nun's ordination at this time, specifically stating their ordination process was a valid Theravādin process where the other ordination session was not. This chapter has carried out ordination ceremonies for hundreds of nuns since then. This has been criticized by leading figures in the Siam Nikaya and Amarapura Nikaya, and the governing council of Buddhism in Myanmar has declared that there can be no valid ordination of nuns in modern times, though some Burmese monks disagree with this.\nIn 1997 Dhamma Cetiya Vihara in Boston was founded by Ven. Gotami of Thailand, then a 10 precept nun; when she received full ordination in 2000, her dwelling became America's first Theravāda Buddhist bhikkhuni vihara.\nA 55-year-old Thai Buddhist 8-precept white-robed maechee nun, Varanggana Vanavichayen, became the first woman to receive the going-forth ceremony of a novice (and the gold robe) in Thailand, in 2002. On 28 February 2003, Dhammananda Bhikkhuni, formerly known as Chatsumarn Kabilsingh, became the first Thai woman to receive bhikkhuni ordination as a Theravāda nun.\nDhammananda Bhikkhuni was ordained in Sri Lanka. The Thai Senate has reviewed and revoked the secular law passed in 1928 banning women's full ordination in Buddhism as unconstitutional for being counter to laws protecting freedom of religion. However, Thailand's two main Theravāda Buddhist orders, the Mahanikaya and Dhammayutika Nikaya, have yet to officially accept fully ordained women into their ranks.\nIn 2009 in Australia four women received bhikkhuni ordination as Theravāda nuns, the first time such ordination had occurred in Australia. It was performed in Perth, Australia, on 22 October 2009 at Bodhinyana Monastery. Abbess Vayama together with Venerables Nirodha, Seri, and Hasapanna were ordained as Bhikkhunis by a dual Sangha act of Bhikkhus and Bhikkhunis in full accordance with the Pāli Vinaya.\nIn 2010, in the US, four novice nuns were given the full bhikkhuni ordination in the Thai Theravāda tradition, which included the double ordination ceremony. Henepola Gunaratana and other monks and nuns were in attendance. It was the first such ordination ever in the Western hemisphere.\nThe first bhikkhuni ordination in Germany, the ordination of German woman Samaneri Dhira, occurred on 21 June 2015 at Anenja Vihara.\nIn Indonesia, the first Theravāda ordination of bhikkhunis in Indonesia after more than a thousand years occurred in 2015 at Wisma Kusalayani in Lembang, Bandung in West Java. Those ordained included Vajiradevi Sadhika Bhikkhuni from Indonesia, Medha Bhikkhuni from Sri Lanka, Anula Bhikkhuni from Japan, Santasukha Santamana Bhikkhuni from Vietnam, Sukhi Bhikkhuni and Sumangala Bhikkhuni from Malaysia, and Jenti Bhikkhuni from Australia.\n\n\n=== Monastic orders ===\n\nTheravāda monks typically belong to a particular nikaya, variously referred to as monastic orders or fraternities. These different orders do not typically develop separate doctrines, but may differ in the manner in which they observe monastic rules. These monastic orders represent lineages of ordination, typically tracing their origin to a particular group of monks that established a new ordination tradition within a particular country or geographic area. \nIn Myanmar, all the monastic orders are called gaing (ဂိုဏ်း) or gaṇa (ဂဏ) instead of nikāya, although some orders include Nikāya (နိကာယ) in addition to Gaing in their names. Currently, it is prohibited by law to establish gaings other than the nine major gaings sanctioned in 1980. Other monastic orders and sects have to merge with these nine gaings, while some sects are totally banned.\nIn Sri Lanka caste plays a major role in the division into nikayas. Some Theravāda Buddhist countries appoint or elect a sangharaja, or Supreme Patriarch of the Sangha, as the highest ranking or seniormost monk in a particular area, or from a particular nikaya.  The demise of monarchies has resulted in the suspension of these posts in some countries, but patriarchs have continued to be appointed in Thailand.  Cambodia ended the practice of appointing a sangharaja for some time, but the position was later restored, though it lapsed again.\n\nBangladesh:\nMahasthabir Nikaya\nSangharaj Nikaya\nMyanmar:\nThudhamma Gaing\nShwegyin Nikāya Shwegyin Gaing\nDhammānudhamma Mahādvāra Nikāya Gaing\nDhammavinayānuloma Mūladvāra Nikāya Gaing\nAnaukchaung Dvāra Gaing\nVeḷuvan Nikāya Gaing\nCatubhummika Mahāsatipaṭṭhāna Hngettwin Gaing\nGaṇavimut Kudo Gaing\nDhammayutti Nikāya Mahā Yin Gaing\nSri Lanka:\nAmarapura Nikaya has many Sub orders including\nDharmarakshitha\nKanduboda (or Swejin Nikaya)\nTapovana (or Kalyanavamsa)\nRamañña Nikaya\nDelduwa\nSri Kalyani Yogasrama Samstha (or 'Galduwa Tradition')\nSiam Nikaya\nAsgiriya\nMalwaththa\nRohana\nWaturawila (or Mahavihara Vamshika Shyamopali Vanavasa Nikaya)\nThailand and Cambodia\nDhammayuttika Nikaya\nMaha Nikaya\n\n\n== Impact on modern society ==\n\nTheravāda Buddhism's emphasis on mindfulness and meditation practices has influenced modern society by promoting mental well-being and stress reduction techniques leading to the integration of mindfulness in various therapeutic and self-improvement programs. Additionally, its teachings on ethical conduct and compassion continue to inspire individuals and organizations to prioritize moral values and social responsibility in their actions and decision-making. The emphasis on ethical conduct in Theravada Buddhism encourages individuals to lead virtuous lives. This includes refraining from actions that harm others, such as lying, stealing, and harming living beings. These principles promote personal integrity and honesty in modern society. Buddhism encourages the cultivation of compassion and loving-kindness (metta) towards all sentient beings. In contemporary society, these teachings inspire individuals and organizations to prioritize social responsibility, charitable activities, and humanitarian efforts aimed at alleviating suffering and promoting the welfare of others. Theravada Buddhism places significant emphasis on self-awareness and self-transformation. Practitioners are encouraged to explore the nature of the self (anatta), impermanence (anicca), and the nature of suffering (dukkha). These teachings have inspired individuals in modern society to embark on journeys of self-discovery, self-improvement, and personal growth. The teachings on mindfulness and the impermanence of life have provided individuals with effective tools for coping with stress and life's challenges. In today's fast-paced and often stressful world, these teachings offer valuable strategies for maintaining balance and emotional stability. This journey of mindfulness and mental health has been strengthened by top institutions encouraging the idea of mindfulness and the effects it has on people. The mindfulness classes/courses/programs provided by many top universities and institutions such as Yale, Stanford, etc. to their students, staff, and general public have benefited them\n\n\n== Demographics ==\nTheravāda Buddhism is practiced in the following countries and by people worldwide:\nEast Asia:\nChina (mainly by the Shan, Tai, Dai, Hani, Wa, Achang, Blang ethnic groups mainly in Yunnan)\nSouth Asia:\nBangladesh (by 2% of the population) mainly in Chittagong Hill Tracts and Kuwakata, Barishal\nIndia, traditional Theravāda mainly in the Seven Sister States\nNepal\nSri Lanka (by 70% of the population)\nSoutheast Asia:\nCambodia (by 97% of the population)\nIndonesia\nLaos (by 66% of the population)\nMalaysia (in peninsular Malaysia especially north-western parts of Malaysia, primarily by the Malaysian Siamese and Malaysian Sinhalese)\nMyanmar (by 89% of the population)\nSingapore\nThailand (by 90% of the population, 94% of the population that practices religion)\nVietnam (by the Khmer Krom in the south and central parts of Vietnam and Tai Dam in northern Vietnam)\nTheravāda has also recently gained popularity in the Western world.\nToday, Theravādins number over 150 million worldwide, and during the past few decades Theravāda Buddhism has begun to take root in the West and in the Buddhist revival in India.\n\n\n== See also ==\nAccess to Insight\nAdhiṭṭhāna\nArahant\nAwgatha\nBuddha Sasana\nBuddhism in Southeast Asia\nBuddhist pilgrimage\nBuddhist Publication Society\nCetiya\nFruits of the noble path\nMahanayaka\nPariyatti, paṭipatti, paṭivedha\nSacca-kiriya\nSambuddhatva jayanthi\nSangharaja\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n=== Printed sources ===\n\n\n=== Web sources ===\n\n\n== External links ==\n\nAccess to Insight – Readings in Theravāda Buddhism\nThe Bodhisattva Ideal in Theravāda Theory and Practice by Jeffrey Samuels\nWhat are the teachings of Theravada Buddhism? on Tricycle's Buddhism for Beginners Series",
  "source_url": "https://en.wikipedia.org/wiki/theravada",
  "fetched_at": "2025-12-06T07:26:03.220661",
  "page_id": "30994"
}